<abi-corpus version='2.4' architecture='elf-amd-x86_64' soname='libskk.so.0'>
  <elf-needed>
    <dependency name='libgee-0.8.so.2'/>
    <dependency name='libjson-glib-1.0.so.0'/>
    <dependency name='libgio-2.0.so.0'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='skk_candidate_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='skk_candidate_get_annotation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='skk_candidate_get_midasi' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='skk_candidate_get_okuri' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='skk_candidate_get_output' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='skk_candidate_get_text' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='skk_candidate_get_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='json_node_get_node_type' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='json_node_get_object' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='json_node_get_string' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='json_node_get_type' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='json_object_get_member' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='json_object_get_members' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='json_object_has_member' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='json_object_ref' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='json_object_unref' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='json_parser_get_root' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='json_parser_load_from_file' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='json_parser_new' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memmove' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='mmap' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='munmap' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_utf8_skip' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='&lt;artificial&gt;-1dbf1' comp-dir-path='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk' language='LANG_C11'>
    <enum-decl name='JsonNodeType' naming-typedef-id='type-id-1' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/json-glib-1.0/json-glib/json-types.h' line='113' column='1' hash='44cb2bfba0970415' id='type-id-2'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='JSON_NODE_OBJECT' value='0'/>
      <enumerator name='JSON_NODE_ARRAY' value='1'/>
      <enumerator name='JSON_NODE_VALUE' value='2'/>
      <enumerator name='JSON_NODE_NULL' value='3'/>
    </enum-decl>
    <enum-decl name='SkkExprNodeType' naming-typedef-id='type-id-4' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='39' column='1' hash='de9b6cc452081d26' id='type-id-5'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='SKK_EXPR_NODE_TYPE_ARRAY' value='0'/>
      <enumerator name='SKK_EXPR_NODE_TYPE_SYMBOL' value='1'/>
      <enumerator name='SKK_EXPR_NODE_TYPE_STRING' value='2'/>
    </enum-decl>
    <enum-decl name='SkkInputMode' naming-typedef-id='type-id-6' size-in-bits='32' alignment-in-bits='32' filepath='../libskk/libskk.h' line='2300' column='1' hash='64dec24566a3d544' id='type-id-7'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='SKK_INPUT_MODE_HIRAGANA' value='0'/>
      <enumerator name='SKK_INPUT_MODE_KATAKANA' value='1'/>
      <enumerator name='SKK_INPUT_MODE_HANKAKU_KATAKANA' value='2'/>
      <enumerator name='SKK_INPUT_MODE_LATIN' value='3'/>
      <enumerator name='SKK_INPUT_MODE_WIDE_LATIN' value='4'/>
      <enumerator name='SKK_INPUT_MODE_LAST' value='5'/>
      <enumerator name='SKK_INPUT_MODE_DEFAULT' value='0'/>
    </enum-decl>
    <class-decl name='_GList' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/glib/glist.h' line='41' column='1' hash='5bcda368f5e9b7d5' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-9' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-10' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prev' type-id='type-id-10' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeLinkedList' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/include/gee-0.8/gee.h' line='1327' column='1' hash='75f378c9a4428a2a' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-12' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='1328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='priv' type-id='type-id-13' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='1329' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonParser' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/json-glib-1.0/json-glib/json-parser.h' line='125' column='1' hash='33263f5928a3ff3a' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/include/json-glib-1.0/json-glib/json-parser.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-16' visibility='default' filepath='/usr/include/json-glib-1.0/json-glib/json-parser.h' line='130' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkCandidateList' is-struct='yes' visibility='default' size-in-bits='256' filepath='../libskk/libskk.h' line='2487' column='1' hash='e6dce38eac88c781' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='../libskk/libskk.h' line='2488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-18' visibility='default' filepath='../libskk/libskk.h' line='2489' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkExprEvaluator' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='102' column='1' hash='5fb19e378ae759d7' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-20' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='104' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkExprNode' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='343' column='1' hash='2bd3b2c1667544ba' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-4' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nodes' type-id='type-id-22' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='90' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkExprReader' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='93' column='1' hash='95afc8afa380b98d' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-25' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='95' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkKeymap' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/keymap.c' line='57' column='1' hash='14761dfb8a3c71c3' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/keymap.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-27' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/keymap.c' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkKeymapMapFile' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='333' column='1' hash='7c233cf2d541774e' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-29' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-30' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='keymap' type-id='type-id-31' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='145' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkKeymapPrivate' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/keymap.c' line='66' column='1' hash='192d8fe715ce3671' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entries' type-id='type-id-33' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/keymap.c' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkMapFile' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/map-file.c' line='62' column='1' hash='5e3183f30b19b730' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/map-file.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-35' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/map-file.c' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkMapFilePrivate' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/map-file.c' line='71' column='1' hash='427565582c8dbf5d' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='maps' type-id='type-id-33' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/map-file.c' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkRule' is-struct='yes' visibility='default' size-in-bits='448' filepath='../libskk/libskk.h' line='2456' column='1' hash='7f5484f708b31b57' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='../libskk/libskk.h' line='2457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-38' visibility='default' filepath='../libskk/libskk.h' line='2458' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='keymaps' type-id='type-id-39' visibility='default' filepath='../libskk/libskk.h' line='2459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='keymaps_length1' type-id='type-id-40' visibility='default' filepath='../libskk/libskk.h' line='2460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='_keymaps_size_' type-id='type-id-40' visibility='default' filepath='../libskk/libskk.h' line='2461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='rom_kana' type-id='type-id-41' visibility='default' filepath='../libskk/libskk.h' line='2462' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkRulePrivate' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='170' column='1' hash='187ffb6e282ab3d3' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_metadata' type-id='type-id-43' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='filter' type-id='type-id-44' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='172' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkStatePrivate' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='316' column='1' hash='b792c416112ce7f2' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_input_mode' type-id='type-id-6' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='completion' type-id='type-id-46' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_typing_rule' type-id='type-id-47' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='numeric_regex' type-id='type-id-48' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='numeric_ref_regex' type-id='type-id-48' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='321' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkUnicodeString' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='154' column='1' hash='bdae5194c877aca0' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-50' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='length' type-id='type-id-40' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='157' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkUnicodeStringPrivate' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='164' column='1' hash='823f3b8ce34c436b' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='165' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GBoxedCopyFunc' type-id='type-id-52' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gboxed.h' line='58' column='1' hash='fd7a63c0c6c822c4' id='type-id-53'/>
    <typedef-decl name='GBoxedFreeFunc' type-id='type-id-54' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gboxed.h' line='67' column='1' hash='fd7a63c0c6c822c4' id='type-id-55'/>
    <typedef-decl name='GList' type-id='type-id-8' size-in-bits='192' filepath='/usr/include/glib-2.0/glib/glist.h' line='39' column='1' id='type-id-56'/>
    <typedef-decl name='GeeLinkedList' type-id='type-id-11' size-in-bits='448' filepath='/usr/include/gee-0.8/gee.h' line='517' column='1' id='type-id-57'/>
    <typedef-decl name='JsonNodeType' type-id='type-id-2' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/json-glib-1.0/json-glib/json-types.h' line='118' column='1' hash='44cb2bfba0970415' id='type-id-1'/>
    <typedef-decl name='JsonParser' type-id='type-id-14' size-in-bits='256' filepath='/usr/include/json-glib-1.0/json-glib/json-parser.h' line='59' column='1' id='type-id-58'/>
    <typedef-decl name='SkkCandidateList' type-id='type-id-17' size-in-bits='256' filepath='../libskk/libskk.h' line='2330' column='1' id='type-id-59'/>
    <typedef-decl name='SkkExprEvaluator' type-id='type-id-19' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='77' column='1' id='type-id-60'/>
    <typedef-decl name='SkkExprNode' type-id='type-id-21' size-in-bits='192' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='48' column='1' id='type-id-61'/>
    <typedef-decl name='SkkExprNodeType' type-id='type-id-5' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='43' column='1' hash='de9b6cc452081d26' id='type-id-4'/>
    <typedef-decl name='SkkExprReader' type-id='type-id-24' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='59' column='1' id='type-id-62'/>
    <typedef-decl name='SkkInputMode' type-id='type-id-7' size-in-bits='32' alignment-in-bits='32' filepath='../libskk/libskk.h' line='2308' column='1' hash='64dec24566a3d544' id='type-id-6'/>
    <typedef-decl name='SkkKeymap' type-id='type-id-26' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/keymap.c' line='45' column='1' id='type-id-63'/>
    <typedef-decl name='SkkKeymapMapFile' type-id='type-id-28' size-in-bits='384' filepath='../libskk/libskk.h' line='2288' column='1' id='type-id-64'/>
    <typedef-decl name='SkkKeymapPrivate' type-id='type-id-32' size-in-bits='64' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/keymap.c' line='47' column='1' id='type-id-65'/>
    <typedef-decl name='SkkMapFilePrivate' type-id='type-id-36' size-in-bits='64' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/map-file.c' line='48' column='1' id='type-id-66'/>
    <typedef-decl name='SkkRule' type-id='type-id-37' size-in-bits='448' filepath='../libskk/libskk.h' line='2267' column='1' id='type-id-67'/>
    <typedef-decl name='SkkRulePrivate' type-id='type-id-42' size-in-bits='384' filepath='../libskk/libskk.h' line='2269' column='1' id='type-id-68'/>
    <typedef-decl name='SkkUnicodeStringPrivate' type-id='type-id-51' size-in-bits='64' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='212' column='1' id='type-id-69'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' hash='f1053b8e4a8b5d7d' id='type-id-10'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' hash='00c69a3db6b69d54' id='type-id-71'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' hash='8660fd2aeaf3d4fe' id='type-id-22'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' hash='960c98c149a5d759' id='type-id-72'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' hash='c15dce00ea845750' id='type-id-73'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' hash='3ed56c4924b599ed' id='type-id-74'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' hash='557ada187350213b' id='type-id-75'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' hash='e7f94355e51cab06' id='type-id-76'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' hash='a272a4e88a4f9e75' id='type-id-31'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' hash='45c3315b1f9bd9f9' id='type-id-77'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' hash='c39586ceecabfddd' id='type-id-39'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' hash='bcf57630eafc85cb' id='type-id-27'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' hash='1bb29574b63608fb' id='type-id-78'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' hash='166f6eef7a669bda' id='type-id-47'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' hash='9d18fd39679e1e05' id='type-id-38'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' hash='1974d2083710c6ec' id='type-id-80'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' hash='475d2b7627985b8f' id='type-id-82'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' hash='f1fa495df7826a2a' id='type-id-84'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' hash='c38e436d82c26870' id='type-id-50'/>
    <qualified-type-def type-id='type-id-43' const='yes' hash='2c12267f664910cf' id='type-id-85'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' hash='00d2d43754bde93c' id='type-id-86'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-52'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' hash='2a03f946d3a2a4e3' id='type-id-89'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-13'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-101'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-109'/>
    <pointer-type-def type-id='type-id-110' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-30'/>
    <class-decl name='_GDateTime' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-115'/>
    <class-decl name='_GDir' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-116'/>
    <class-decl name='_GeeBidirIterator' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-117'/>
    <class-decl name='_GeeBidirListIterator' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-118'/>
    <class-decl name='_GeeLinkedListPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-119'/>
    <class-decl name='_GeeListIterator' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    <class-decl name='_GeeMapIterator' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-121'/>
    <class-decl name='_JsonArray' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-122'/>
    <class-decl name='_JsonNode' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-123'/>
    <class-decl name='_JsonObject' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-124'/>
    <class-decl name='_JsonParserPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-125'/>
    <class-decl name='_SkkCandidateListPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-126'/>
    <class-decl name='_SkkExprEvaluatorPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-127'/>
    <class-decl name='_SkkExprReaderPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-128'/>
    <class-decl name='_SkkKeymapMapFilePrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
    <class-decl name='_SkkRomKanaConverterPrivate' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='118' column='1' hash='8ea4f5db3df092e4' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_rule' type-id='type-id-41' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='current_node' type-id='type-id-131' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_kana_mode' type-id='type-id-132' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='_period_style' type-id='type-id-133' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_output' type-id='type-id-134' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_preedit' type-id='type-id-134' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='124' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkRomKanaMapFile' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='152' column='1' hash='add77ecc53c01b9e' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-29' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-136' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='root_node' type-id='type-id-131' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='155' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='SkkCandidateListPrivate' type-id='type-id-126' filepath='../libskk/libskk.h' line='2333' column='1' id='type-id-111'/>
    <typedef-decl name='GeeListIterator' type-id='type-id-120' filepath='/usr/include/gee-0.8/gee.h' line='103' column='1' id='type-id-100'/>
    <typedef-decl name='GeeBidirListIterator' type-id='type-id-118' filepath='/usr/include/gee-0.8/gee.h' line='130' column='1' id='type-id-97'/>
    <typedef-decl name='GeeBidirIterator' type-id='type-id-117' filepath='/usr/include/gee-0.8/gee.h' line='138' column='1' id='type-id-95'/>
    <typedef-decl name='GeeMapIterator' type-id='type-id-121' filepath='/usr/include/gee-0.8/gee.h' line='222' column='1' id='type-id-102'/>
    <typedef-decl name='GeeLinkedListPrivate' type-id='type-id-119' filepath='/usr/include/gee-0.8/gee.h' line='519' column='1' id='type-id-99'/>
    <typedef-decl name='GDateTime' type-id='type-id-115' filepath='/usr/include/glib-2.0/glib/gdatetime.h' line='122' column='1' id='type-id-90'/>
    <typedef-decl name='GDir' type-id='type-id-116' filepath='/usr/include/glib-2.0/glib/gdir.h' line='39' column='1' id='type-id-92'/>
    <typedef-decl name='JsonParserPrivate' type-id='type-id-125' filepath='/usr/include/json-glib-1.0/json-glib/json-parser.h' line='60' column='1' id='type-id-110'/>
    <typedef-decl name='JsonNode' type-id='type-id-123' filepath='/usr/include/json-glib-1.0/json-glib/json-types.h' line='100' column='1' id='type-id-106'/>
    <typedef-decl name='JsonObject' type-id='type-id-124' filepath='/usr/include/json-glib-1.0/json-glib/json-types.h' line='101' column='1' id='type-id-108'/>
    <typedef-decl name='JsonArray' type-id='type-id-122' filepath='/usr/include/json-glib-1.0/json-glib/json-types.h' line='102' column='1' id='type-id-104'/>
    <typedef-decl name='SkkExprReaderPrivate' type-id='type-id-128' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='61' column='1' id='type-id-113'/>
    <typedef-decl name='SkkExprEvaluatorPrivate' type-id='type-id-127' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/expr.c' line='79' column='1' id='type-id-112'/>
    <function-decl name='skk_map_file_get_type' mangled-name='skk_map_file_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/map-file.c' line='1341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_map_file_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <typedef-decl name='SkkKeymapMapFilePrivate' type-id='type-id-129' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='60' column='1' id='type-id-114'/>
    <function-decl name='skk_keymap_map_file_get_type' mangled-name='skk_keymap_map_file_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='520' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_keymap_map_file_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_rom_kana_map_file_get_type' mangled-name='skk_rom_kana_map_file_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_map_file_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_rule_parse_error_quark' mangled-name='skk_rule_parse_error_quark' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_parse_error_quark' hash='2bb88322482ae81c'>
      <return type-id='type-id-138'/>
    </function-decl>
    <function-decl name='skk_rule_parse_error_get_type' mangled-name='skk_rule_parse_error_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_parse_error_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_rule_metadata_locate_map_file' mangled-name='skk_rule_metadata_locate_map_file' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_metadata_locate_map_file' hash='a4dfb9a22e4bae94'>
      <parameter type-id='type-id-139' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1140' column='1'/>
      <parameter type-id='type-id-140' name='type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1141' column='1'/>
      <parameter type-id='type-id-140' name='name' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1142' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='skk_rule_metadata_copy' mangled-name='skk_rule_metadata_copy' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_metadata_copy' hash='5d81a142615bd60c'>
      <parameter type-id='type-id-86' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1190' column='1'/>
      <parameter type-id='type-id-139' name='dest' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1191' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_rule_metadata_destroy' mangled-name='skk_rule_metadata_destroy' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_metadata_destroy' hash='2724ccec0c27b65f'>
      <parameter type-id='type-id-139' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1247' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_rule_metadata_dup' mangled-name='skk_rule_metadata_dup' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_metadata_dup' hash='bb62d1ac3f5dcda8'>
      <parameter type-id='type-id-86' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1263' column='1'/>
      <return type-id='type-id-139'/>
    </function-decl>
    <function-decl name='skk_rule_metadata_free' mangled-name='skk_rule_metadata_free' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_metadata_free' hash='2724ccec0c27b65f'>
      <parameter type-id='type-id-139' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1247' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_rule_metadata_get_type' mangled-name='skk_rule_metadata_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_metadata_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_rule_construct' mangled-name='skk_rule_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1782' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_construct' hash='e48c6fe2469617bc'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1782' column='1'/>
      <parameter type-id='type-id-140' name='name' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1783' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='1784' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='skk_rule_new' mangled-name='skk_rule_new' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='2113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_new' hash='58e6707eede365bf'>
      <parameter type-id='type-id-140' name='name' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='2113' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='2114' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='skk_rule_find_rule' mangled-name='skk_rule_find_rule' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='2129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_find_rule' hash='fe14d828cbcb5590'>
      <parameter type-id='type-id-140' name='name' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='2129' column='1'/>
      <return type-id='type-id-139'/>
    </function-decl>
    <function-decl name='skk_rule_list' mangled-name='skk_rule_list' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='2365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_list' hash='2ec641f985973ef7'>
      <parameter type-id='type-id-143' name='result_length1' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='2365' column='1'/>
      <return type-id='type-id-139'/>
    </function-decl>
    <function-decl name='skk_rule_get_metadata' mangled-name='skk_rule_get_metadata' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='2684' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_get_metadata' hash='024b14226a03b800'>
      <parameter type-id='type-id-47' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='2684' column='1'/>
      <parameter type-id='type-id-139' name='result' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='2685' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_rule_get_type' mangled-name='skk_rule_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='2986' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rule_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-144'/>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-87'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-30f6' comp-dir-path='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-131' size-in-bits='8192' hash='f071e83555ca2de3' id='type-id-145'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-146' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-147'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-148'/>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-149'/>
    <enum-decl name='GConverterFlags' naming-typedef-id='type-id-150' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gio/gioenums.h' line='62' column='1' hash='f3b738aa57b0954b' id='type-id-151'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='G_CONVERTER_NO_FLAGS' value='0'/>
      <enumerator name='G_CONVERTER_INPUT_AT_END' value='1'/>
      <enumerator name='G_CONVERTER_FLUSH' value='2'/>
    </enum-decl>
    <enum-decl name='GConverterResult' naming-typedef-id='type-id-152' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gio/gioenums.h' line='79' column='1' hash='6248ef276a3b0eea' id='type-id-153'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='G_CONVERTER_ERROR' value='0'/>
      <enumerator name='G_CONVERTER_CONVERTED' value='1'/>
      <enumerator name='G_CONVERTER_FINISHED' value='2'/>
      <enumerator name='G_CONVERTER_FLUSHED' value='3'/>
    </enum-decl>
    <enum-decl name='GFileCreateFlags' naming-typedef-id='type-id-154' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gio/gioenums.h' line='211' column='1' hash='e3f0171bfbfc5c1c' id='type-id-155'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='G_FILE_CREATE_NONE' value='0'/>
      <enumerator name='G_FILE_CREATE_PRIVATE' value='1'/>
      <enumerator name='G_FILE_CREATE_REPLACE_DESTINATION' value='2'/>
    </enum-decl>
    <enum-decl name='GFileQueryInfoFlags' naming-typedef-id='type-id-156' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gio/gioenums.h' line='187' column='1' hash='6d74a941cab3c188' id='type-id-157'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='G_FILE_QUERY_INFO_NONE' value='0'/>
      <enumerator name='G_FILE_QUERY_INFO_NOFOLLOW_SYMLINKS' value='1'/>
    </enum-decl>
    <enum-decl name='GParamFlags' naming-typedef-id='type-id-158' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='157' column='1' hash='0d731ff2ef6aeaf8' id='type-id-159'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='G_PARAM_READABLE' value='1'/>
      <enumerator name='G_PARAM_WRITABLE' value='2'/>
      <enumerator name='G_PARAM_READWRITE' value='3'/>
      <enumerator name='G_PARAM_CONSTRUCT' value='4'/>
      <enumerator name='G_PARAM_CONSTRUCT_ONLY' value='8'/>
      <enumerator name='G_PARAM_LAX_VALIDATION' value='16'/>
      <enumerator name='G_PARAM_STATIC_NAME' value='32'/>
      <enumerator name='G_PARAM_PRIVATE' value='32'/>
      <enumerator name='G_PARAM_STATIC_NICK' value='64'/>
      <enumerator name='G_PARAM_STATIC_BLURB' value='128'/>
      <enumerator name='G_PARAM_EXPLICIT_NOTIFY' value='1073741824'/>
      <enumerator name='G_PARAM_DEPRECATED' value='-2147483648'/>
    </enum-decl>
    <enum-decl name='GRegexMatchFlags' naming-typedef-id='type-id-160' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/glib/gregex.h' line='397' column='1' hash='c0bc91920f535acc' id='type-id-161'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='G_REGEX_MATCH_DEFAULT' value='0'/>
      <enumerator name='G_REGEX_MATCH_ANCHORED' value='16'/>
      <enumerator name='G_REGEX_MATCH_NOTBOL' value='128'/>
      <enumerator name='G_REGEX_MATCH_NOTEOL' value='256'/>
      <enumerator name='G_REGEX_MATCH_NOTEMPTY' value='1024'/>
      <enumerator name='G_REGEX_MATCH_PARTIAL' value='32768'/>
      <enumerator name='G_REGEX_MATCH_NEWLINE_CR' value='1048576'/>
      <enumerator name='G_REGEX_MATCH_NEWLINE_LF' value='2097152'/>
      <enumerator name='G_REGEX_MATCH_NEWLINE_CRLF' value='3145728'/>
      <enumerator name='G_REGEX_MATCH_NEWLINE_ANY' value='4194304'/>
      <enumerator name='G_REGEX_MATCH_NEWLINE_ANYCRLF' value='5242880'/>
      <enumerator name='G_REGEX_MATCH_BSR_ANYCRLF' value='8388608'/>
      <enumerator name='G_REGEX_MATCH_BSR_ANY' value='16777216'/>
      <enumerator name='G_REGEX_MATCH_PARTIAL_SOFT' value='32768'/>
      <enumerator name='G_REGEX_MATCH_PARTIAL_HARD' value='134217728'/>
      <enumerator name='G_REGEX_MATCH_NOTEMPTY_ATSTART' value='268435456'/>
    </enum-decl>
    <enum-decl name='SkkKanaMode' naming-typedef-id='type-id-132' size-in-bits='32' alignment-in-bits='32' filepath='../libskk/libskk.h' line='2108' column='1' hash='8e33501bccd91ebc' id='type-id-162'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='SKK_KANA_MODE_HIRAGANA' value='0'/>
      <enumerator name='SKK_KANA_MODE_KATAKANA' value='1'/>
      <enumerator name='SKK_KANA_MODE_HANKAKU_KATAKANA' value='2'/>
    </enum-decl>
    <enum-decl name='SkkModifierType' naming-typedef-id='type-id-163' size-in-bits='32' alignment-in-bits='32' filepath='../libskk/libskk.h' line='2212' column='1' hash='dbad5c257429b6af' id='type-id-164'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='SKK_MODIFIER_TYPE_NONE' value='0'/>
      <enumerator name='SKK_MODIFIER_TYPE_SHIFT_MASK' value='1'/>
      <enumerator name='SKK_MODIFIER_TYPE_LOCK_MASK' value='2'/>
      <enumerator name='SKK_MODIFIER_TYPE_CONTROL_MASK' value='4'/>
      <enumerator name='SKK_MODIFIER_TYPE_MOD1_MASK' value='8'/>
      <enumerator name='SKK_MODIFIER_TYPE_MOD2_MASK' value='16'/>
      <enumerator name='SKK_MODIFIER_TYPE_MOD3_MASK' value='32'/>
      <enumerator name='SKK_MODIFIER_TYPE_MOD4_MASK' value='64'/>
      <enumerator name='SKK_MODIFIER_TYPE_MOD5_MASK' value='128'/>
      <enumerator name='SKK_MODIFIER_TYPE_LSHIFT_MASK' value='4194304'/>
      <enumerator name='SKK_MODIFIER_TYPE_RSHIFT_MASK' value='8388608'/>
      <enumerator name='SKK_MODIFIER_TYPE_USLEEP_MASK' value='16777216'/>
      <enumerator name='SKK_MODIFIER_TYPE_SUPER_MASK' value='67108864'/>
      <enumerator name='SKK_MODIFIER_TYPE_HYPER_MASK' value='134217728'/>
      <enumerator name='SKK_MODIFIER_TYPE_META_MASK' value='268435456'/>
      <enumerator name='SKK_MODIFIER_TYPE_RELEASE_MASK' value='1073741824'/>
    </enum-decl>
    <enum-decl name='SkkPeriodStyle' naming-typedef-id='type-id-133' size-in-bits='32' alignment-in-bits='32' filepath='../libskk/libskk.h' line='2115' column='1' hash='907f9d21e214bc01' id='type-id-165'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='SKK_PERIOD_STYLE_JA_JA' value='0'/>
      <enumerator name='SKK_PERIOD_STYLE_EN_EN' value='1'/>
      <enumerator name='SKK_PERIOD_STYLE_JA_EN' value='2'/>
      <enumerator name='SKK_PERIOD_STYLE_EN_JA' value='3'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' hash='d7ec3bf03d3c5690' id='type-id-166'/>
    <array-type-def dimensions='1' type-id='type-id-167' size-in-bits='4096' hash='8e180b272798c153' id='type-id-168'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-146' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-147'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-169' size-in-bits='32768' hash='27c0e8e69abd6664' id='type-id-170'>
      <subrange length='4096' lower-bound='0' upper-bound='4095' type-id='type-id-146' size-in-bits='64' is-anonymous='yes' hash='28c39550727a8b34' id='type-id-171'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-172'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-173'/>
    <class-decl name='_GBufferedInputStream' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='44' column='1' hash='8793c3f600dc6d57' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-175' visibility='default' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priv' type-id='type-id-176' visibility='default' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GCancellable' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='44' column='1' hash='1aba4482416b944a' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-178' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GDataInputStream' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='44' column='1' hash='23e86412cd84d1e5' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-180' visibility='default' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='priv' type-id='type-id-181' visibility='default' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GError' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/gerror.h' line='45' column='1' hash='a8773754418f4d7e' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-138' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='code' type-id='type-id-40' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='message' type-id='type-id-23' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GFilterInputStream' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='43' column='1' hash='8b9be57ceb909f2a' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-184' visibility='default' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='base_stream' type-id='type-id-185' visibility='default' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GFlagsValue' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/genums.h' line='211' column='1' hash='baef399c44e1e72f' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value_name' type-id='type-id-140' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value_nick' type-id='type-id-140' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='215' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GIOStream' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/giostream.h' line='43' column='1' hash='ca059a5c260b9e4b' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/include/glib-2.0/gio/giostream.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-189' visibility='default' filepath='/usr/include/glib-2.0/gio/giostream.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GInputStream' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='44' column='1' hash='fe04ce50f217811b' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-191' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GObject' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='252' column='1' hash='db1fbbe14f2aacaf' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type_instance' type-id='type-id-70' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='qdata' type-id='type-id-193' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='258' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GOutputStream' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/goutputstream.h' line='44' column='1' hash='58d7c757a7738aff' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/include/glib-2.0/gio/goutputstream.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-195' visibility='default' filepath='/usr/include/glib-2.0/gio/goutputstream.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GParamSpec' is-struct='yes' visibility='default' size-in-bits='576' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='209' column='1' hash='30607f711855f218' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type_instance' type-id='type-id-70' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-140' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-158' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='value_type' type-id='type-id-137' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='owner_type' type-id='type-id-137' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_nick' type-id='type-id-23' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_blurb' type-id='type-id-23' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='qdata' type-id='type-id-193' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ref_count' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='param_id' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='223' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSocketClient' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/gsocketclient.h' line='67' column='1' hash='3af3f59f69a531c2' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/include/glib-2.0/gio/gsocketclient.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-198' visibility='default' filepath='/usr/include/glib-2.0/gio/gsocketclient.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSocketConnection' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/glib-2.0/gio/gsocketconnection.h' line='67' column='1' hash='ef8e5cffd0ee3881' id='type-id-199'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-200' visibility='default' filepath='/usr/include/glib-2.0/gio/gsocketconnection.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-201' visibility='default' filepath='/usr/include/glib-2.0/gio/gsocketconnection.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GString' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/glib/gstring.h' line='45' column='1' hash='c4334d726eae4ebb' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='type-id-23' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-203' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='allocated_len' type-id='type-id-203' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeClass' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='451' column='1' hash='5069632588d09e4e' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-137' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='454' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeInstance' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='461' column='1' hash='702e9d196e69b503' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_class' type-id='type-id-206' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='464' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GValue' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='113' column='1' hash='61f088755dd30e61' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-137' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-208' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='129' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeAbstractBidirList' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/include/gee-0.8/gee.h' line='776' column='1' hash='15828c1259d27032' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-210' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priv' type-id='type-id-211' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='778' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeAbstractCollection' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/gee-0.8/gee.h' line='667' column='1' hash='cb190d6dc7258c8d' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-213' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='669' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeAbstractList' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/gee-0.8/gee.h' line='721' column='1' hash='fd61c50dc994742f' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-215' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-216' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='723' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeArrayList' is-struct='yes' visibility='default' size-in-bits='640' filepath='/usr/include/gee-0.8/gee.h' line='1179' column='1' hash='65749c44493ed8f2' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-12' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='1180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='priv' type-id='type-id-218' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='1181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_items' type-id='type-id-219' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='1182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_items_length1' type-id='type-id-40' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='1183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='__items_size_' type-id='type-id-40' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='1184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_size' type-id='type-id-40' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='1185' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeMapEntry' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/gee-0.8/gee.h' line='1336' column='1' hash='5c97737610cf3410' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='1337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-221' visibility='default' filepath='/usr/include/gee-0.8/gee.h' line='1338' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkCandidate' is-struct='yes' visibility='default' size-in-bits='256' filepath='../libskk/libskk.h' line='2478' column='1' hash='a79d2c76eae5e37f' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='../libskk/libskk.h' line='2479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-223' visibility='default' filepath='../libskk/libskk.h' line='2480' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkCandidatePrivate' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='49' column='1' hash='2baa254a78aa7713' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_midasi' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_okuri' type-id='type-id-167' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_text' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_annotation' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_output' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkCdbDict' is-struct='yes' visibility='default' size-in-bits='320' filepath='../libskk/libskk.h' line='2390' column='1' hash='01b896746e11f26a' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-226' visibility='default' filepath='../libskk/libskk.h' line='2391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-227' visibility='default' filepath='../libskk/libskk.h' line='2392' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkCdbDictPrivate' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='69' column='1' hash='8301d498d080d666' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file' type-id='type-id-229' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mmap' type-id='type-id-230' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='etag' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='converter' type-id='type-id-231' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='73' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkDict' is-struct='yes' visibility='default' size-in-bits='256' filepath='../libskk/libskk.h' line='2356' column='1' hash='75f435a456fdf325' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='../libskk/libskk.h' line='2357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-233' visibility='default' filepath='../libskk/libskk.h' line='2358' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkEmptyDict' is-struct='yes' visibility='default' size-in-bits='320' filepath='../libskk/libskk.h' line='2372' column='1' hash='3aa6eb0769598523' id='type-id-234'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-226' visibility='default' filepath='../libskk/libskk.h' line='2373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-235' visibility='default' filepath='../libskk/libskk.h' line='2374' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkEncodingConverter' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/encoding.c' line='65' column='1' hash='eef69b053881a8da' id='type-id-236'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/encoding.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-237' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/encoding.c' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkEncodingConverterPrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/encoding.c' line='74' column='1' hash='d36ab2cdd0b69101' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_encoding' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/encoding.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='encoder' type-id='type-id-239' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/encoding.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='decoder' type-id='type-id-239' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/encoding.c' line='77' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkFileDict' is-struct='yes' visibility='default' size-in-bits='320' filepath='../libskk/libskk.h' line='2381' column='1' hash='ef54d10849fcb14a' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-226' visibility='default' filepath='../libskk/libskk.h' line='2382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-241' visibility='default' filepath='../libskk/libskk.h' line='2383' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkFileDictPrivate' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='75' column='1' hash='f7aba74ef276ebdb' id='type-id-242'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file' type-id='type-id-229' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mmap' type-id='type-id-230' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='etag' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='converter' type-id='type-id-231' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='okuri_ari_offset' type-id='type-id-243' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='okuri_nasi_offset' type-id='type-id-243' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkKeyEvent' is-struct='yes' visibility='default' size-in-bits='256' filepath='../libskk/libskk.h' line='2423' column='1' hash='9cc9f97aa5ff62ed' id='type-id-244'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='../libskk/libskk.h' line='2424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-245' visibility='default' filepath='../libskk/libskk.h' line='2425' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkKeyEventFilter' is-struct='yes' visibility='default' size-in-bits='256' filepath='../libskk/libskk.h' line='2432' column='1' hash='879725cc62c94358' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='../libskk/libskk.h' line='2433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-247' visibility='default' filepath='../libskk/libskk.h' line='2434' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkKeyEventPrivate' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='59' column='1' hash='2ad9dd49106305a0' id='type-id-248'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_name' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_code' type-id='type-id-88' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='_modifiers' type-id='type-id-163' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkMemoryMappedFile' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='168' column='1' hash='c9cd75871d7735cb' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-250' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkMemoryMappedFilePrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='177' column='1' hash='b310672b8da0cb72' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_memory' type-id='type-id-252' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_length' type-id='type-id-203' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='file' type-id='type-id-229' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='180' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkRomKanaConverter' is-struct='yes' visibility='default' size-in-bits='256' filepath='../libskk/libskk.h' line='2347' column='1' hash='fbe469ef0208ba76' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='../libskk/libskk.h' line='2348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-254' visibility='default' filepath='../libskk/libskk.h' line='2349' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkRomKanaEntry' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='162' column='1' hash='28f8719a1802d072' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rom' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='carryover' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hiragana' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='katakana' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hankaku_katakana' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkRomKanaNode' is-struct='yes' visibility='default' size-in-bits='12736' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='103' column='1' hash='ead84cab1d8675b8' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-257' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='entry' type-id='type-id-258' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='parent' type-id='type-id-131' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='children' type-id='type-id-145' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='c' type-id='type-id-259' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8608'>
        <var-decl name='n_children' type-id='type-id-187' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='valid' type-id='type-id-168' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkRuleMetadata' is-struct='yes' visibility='default' size-in-bits='320' filepath='../libskk/libskk.h' line='2448' column='1' hash='93c71d7de6ecbec0' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base_dir' type-id='type-id-23' visibility='default' filepath='../libskk/libskk.h' line='2449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-23' visibility='default' filepath='../libskk/libskk.h' line='2450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='label' type-id='type-id-23' visibility='default' filepath='../libskk/libskk.h' line='2451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='description' type-id='type-id-23' visibility='default' filepath='../libskk/libskk.h' line='2452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='filter' type-id='type-id-23' visibility='default' filepath='../libskk/libskk.h' line='2453' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkSkkServ' is-struct='yes' visibility='default' size-in-bits='320' filepath='../libskk/libskk.h' line='2408' column='1' hash='8e86a7fb77652dff' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-226' visibility='default' filepath='../libskk/libskk.h' line='2409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-262' visibility='default' filepath='../libskk/libskk.h' line='2410' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkSkkServPrivate' is-struct='yes' visibility='default' size-in-bits='33024' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='66' column='1' hash='b85df5994033b929' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='connection' type-id='type-id-264' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='buffer' type-id='type-id-170' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='host' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='port' type-id='type-id-265' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32960'>
        <var-decl name='converter' type-id='type-id-231' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkUserDict' is-struct='yes' visibility='default' size-in-bits='320' filepath='../libskk/libskk.h' line='2399' column='1' hash='9db1f6ab65a38205' id='type-id-266'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-226' visibility='default' filepath='../libskk/libskk.h' line='2400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-267' visibility='default' filepath='../libskk/libskk.h' line='2401' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkUserDictPrivate' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='62' column='1' hash='36a3ea6af0cb78bf' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file' type-id='type-id-229' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='etag' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='converter' type-id='type-id-231' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='okuri_ari_entries' type-id='type-id-33' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='okuri_nasi_entries' type-id='type-id-33' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='67' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GBufferedInputStream' type-id='type-id-174' size-in-bits='384' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='38' column='1' id='type-id-180'/>
    <typedef-decl name='GCancellable' type-id='type-id-177' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='40' column='1' id='type-id-269'/>
    <typedef-decl name='GConverterFlags' type-id='type-id-151' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gio/gioenums.h' line='66' column='1' hash='f3b738aa57b0954b' id='type-id-150'/>
    <typedef-decl name='GConverterResult' type-id='type-id-153' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gio/gioenums.h' line='84' column='1' hash='6248ef276a3b0eea' id='type-id-152'/>
    <typedef-decl name='GDataInputStream' type-id='type-id-179' size-in-bits='448' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='46' column='1' id='type-id-270'/>
    <typedef-decl name='GDestroyNotify' type-id='type-id-54' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='140' column='1' hash='fd7a63c0c6c822c4' id='type-id-271'/>
    <typedef-decl name='GError' type-id='type-id-182' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/gerror.h' line='43' column='1' id='type-id-272'/>
    <typedef-decl name='GFileCreateFlags' type-id='type-id-155' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gio/gioenums.h' line='215' column='1' hash='e3f0171bfbfc5c1c' id='type-id-154'/>
    <typedef-decl name='GFileQueryInfoFlags' type-id='type-id-157' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gio/gioenums.h' line='190' column='1' hash='6d74a941cab3c188' id='type-id-156'/>
    <typedef-decl name='GFilterInputStream' type-id='type-id-183' size-in-bits='320' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='71' column='1' id='type-id-175'/>
    <typedef-decl name='GFlagsValue' type-id='type-id-186' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/genums.h' line='143' column='1' id='type-id-273'/>
    <typedef-decl name='GIOStream' type-id='type-id-188' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='124' column='1' id='type-id-200'/>
    <typedef-decl name='GInputStream' type-id='type-id-190' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='97' column='1' id='type-id-184'/>
    <typedef-decl name='GObject' type-id='type-id-192' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='192' column='1' id='type-id-15'/>
    <typedef-decl name='GOutputStream' type-id='type-id-194' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='123' column='1' id='type-id-274'/>
    <typedef-decl name='GParamFlags' type-id='type-id-159' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='172' column='1' hash='0d731ff2ef6aeaf8' id='type-id-158'/>
    <typedef-decl name='GParamSpec' type-id='type-id-196' size-in-bits='576' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='204' column='1' id='type-id-275'/>
    <typedef-decl name='GQuark' type-id='type-id-276' size-in-bits='32' filepath='/usr/include/glib-2.0/glib/gquark.h' line='38' column='1' hash='e66b43f97c38e87a' id='type-id-138'/>
    <typedef-decl name='GRegexMatchFlags' type-id='type-id-161' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/glib/gregex.h' line='414' column='1' hash='c0bc91920f535acc' id='type-id-160'/>
    <typedef-decl name='GSocketClient' type-id='type-id-197' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='137' column='1' id='type-id-277'/>
    <typedef-decl name='GSocketConnection' type-id='type-id-199' size-in-bits='320' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='138' column='1' id='type-id-278'/>
    <typedef-decl name='GString' type-id='type-id-202' size-in-bits='192' filepath='/usr/include/glib-2.0/glib/gstring.h' line='43' column='1' id='type-id-279'/>
    <typedef-decl name='GType' type-id='type-id-203' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='427' column='1' hash='8fdc5eea2983a729' id='type-id-137'/>
    <typedef-decl name='GTypeClass' type-id='type-id-204' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='434' column='1' id='type-id-280'/>
    <typedef-decl name='GTypeInstance' type-id='type-id-205' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='436' column='1' id='type-id-70'/>
    <typedef-decl name='GValue' type-id='type-id-207' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='431' column='1' id='type-id-281'/>
    <typedef-decl name='GeeAbstractBidirList' type-id='type-id-209' size-in-bits='384' filepath='/usr/include/gee-0.8/gee.h' line='148' column='1' id='type-id-12'/>
    <typedef-decl name='GeeAbstractCollection' type-id='type-id-212' size-in-bits='256' filepath='/usr/include/gee-0.8/gee.h' line='86' column='1' id='type-id-215'/>
    <typedef-decl name='GeeAbstractList' type-id='type-id-214' size-in-bits='320' filepath='/usr/include/gee-0.8/gee.h' line='113' column='1' id='type-id-210'/>
    <typedef-decl name='GeeArrayList' type-id='type-id-217' size-in-bits='640' filepath='/usr/include/gee-0.8/gee.h' line='359' column='1' id='type-id-282'/>
    <typedef-decl name='GeeMapEntry' type-id='type-id-220' size-in-bits='256' filepath='/usr/include/gee-0.8/gee.h' line='234' column='1' id='type-id-283'/>
    <typedef-decl name='SkkCandidate' type-id='type-id-222' size-in-bits='256' filepath='../libskk/libskk.h' line='2153' column='1' id='type-id-284'/>
    <typedef-decl name='SkkCandidatePrivate' type-id='type-id-224' size-in-bits='320' filepath='../libskk/libskk.h' line='2332' column='1' id='type-id-285'/>
    <typedef-decl name='SkkCdbDict' type-id='type-id-225' size-in-bits='320' filepath='../libskk/libskk.h' line='2185' column='1' id='type-id-286'/>
    <typedef-decl name='SkkCdbDictPrivate' type-id='type-id-228' size-in-bits='256' filepath='../libskk/libskk.h' line='2187' column='1' id='type-id-287'/>
    <typedef-decl name='SkkDict' type-id='type-id-232' size-in-bits='256' filepath='../libskk/libskk.h' line='2142' column='1' id='type-id-226'/>
    <typedef-decl name='SkkEmptyDict' type-id='type-id-234' size-in-bits='320' filepath='../libskk/libskk.h' line='2163' column='1' id='type-id-288'/>
    <typedef-decl name='SkkEncodingConverter' type-id='type-id-236' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='55' column='1' id='type-id-289'/>
    <typedef-decl name='SkkEncodingConverterPrivate' type-id='type-id-238' size-in-bits='192' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/encoding.c' line='49' column='1' id='type-id-290'/>
    <typedef-decl name='SkkFileDict' type-id='type-id-240' size-in-bits='320' filepath='../libskk/libskk.h' line='2174' column='1' id='type-id-291'/>
    <typedef-decl name='SkkFileDictPrivate' type-id='type-id-242' size-in-bits='384' filepath='../libskk/libskk.h' line='2176' column='1' id='type-id-292'/>
    <typedef-decl name='SkkKanaMode' type-id='type-id-162' size-in-bits='32' alignment-in-bits='32' filepath='../libskk/libskk.h' line='2112' column='1' hash='8e33501bccd91ebc' id='type-id-132'/>
    <typedef-decl name='SkkKeyEvent' type-id='type-id-244' size-in-bits='256' filepath='../libskk/libskk.h' line='2240' column='1' id='type-id-293'/>
    <typedef-decl name='SkkKeyEventFilter' type-id='type-id-246' size-in-bits='256' filepath='../libskk/libskk.h' line='2251' column='1' id='type-id-294'/>
    <typedef-decl name='SkkKeyEventPrivate' type-id='type-id-248' size-in-bits='128' filepath='../libskk/libskk.h' line='2242' column='1' id='type-id-295'/>
    <typedef-decl name='SkkMapFile' type-id='type-id-34' size-in-bits='256' filepath='../libskk/libskk.h' line='2278' column='1' id='type-id-29'/>
    <typedef-decl name='SkkMemoryMappedFile' type-id='type-id-249' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='45' column='1' id='type-id-296'/>
    <typedef-decl name='SkkMemoryMappedFilePrivate' type-id='type-id-251' size-in-bits='192' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/util.c' line='108' column='1' id='type-id-297'/>
    <typedef-decl name='SkkModifierType' type-id='type-id-164' size-in-bits='32' alignment-in-bits='32' filepath='../libskk/libskk.h' line='2229' column='1' hash='dbad5c257429b6af' id='type-id-163'/>
    <typedef-decl name='SkkPeriodStyle' type-id='type-id-165' size-in-bits='32' alignment-in-bits='32' filepath='../libskk/libskk.h' line='2120' column='1' hash='907f9d21e214bc01' id='type-id-133'/>
    <typedef-decl name='SkkRomKanaConverter' type-id='type-id-253' size-in-bits='256' filepath='../libskk/libskk.h' line='2131' column='1' id='type-id-298'/>
    <typedef-decl name='SkkRomKanaConverterPrivate' type-id='type-id-130' size-in-bits='320' filepath='../libskk/libskk.h' line='2133' column='1' id='type-id-299'/>
    <typedef-decl name='SkkRomKanaEntry' type-id='type-id-255' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='39' column='1' id='type-id-300'/>
    <typedef-decl name='SkkRomKanaMapFile' type-id='type-id-135' size-in-bits='384' filepath='../libskk/libskk.h' line='2298' column='1' id='type-id-301'/>
    <typedef-decl name='SkkRomKanaNode' type-id='type-id-256' size-in-bits='12736' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='49' column='1' id='type-id-302'/>
    <typedef-decl name='SkkRuleMetadata' type-id='type-id-260' size-in-bits='320' filepath='../libskk/libskk.h' line='2258' column='1' id='type-id-43'/>
    <typedef-decl name='SkkSkkServ' type-id='type-id-261' size-in-bits='320' filepath='../libskk/libskk.h' line='2207' column='1' id='type-id-303'/>
    <typedef-decl name='SkkSkkServPrivate' type-id='type-id-263' size-in-bits='33024' filepath='../libskk/libskk.h' line='2209' column='1' id='type-id-304'/>
    <typedef-decl name='SkkUserDict' type-id='type-id-266' size-in-bits='320' filepath='../libskk/libskk.h' line='2196' column='1' id='type-id-305'/>
    <typedef-decl name='SkkUserDictPrivate' type-id='type-id-268' size-in-bits='320' filepath='../libskk/libskk.h' line='2198' column='1' id='type-id-306'/>
    <typedef-decl name='gboolean' type-id='type-id-40' size-in-bits='32' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='56' column='1' hash='09d17c08f594edc7' id='type-id-167'/>
    <typedef-decl name='gchar' type-id='type-id-148' size-in-bits='8' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='52' column='1' hash='65b2d157027b431a' id='type-id-259'/>
    <typedef-decl name='gdouble' type-id='type-id-149' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='64' column='1' hash='e9e9b320886d9aa6' id='type-id-307'/>
    <typedef-decl name='gfloat' type-id='type-id-166' size-in-bits='32' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='63' column='1' hash='d7ec3bf03d3c5690' id='type-id-308'/>
    <typedef-decl name='gint' type-id='type-id-172' size-in-bits='32' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='55' column='1' hash='09d17c08f594edc7' id='type-id-40'/>
    <typedef-decl name='gint64' type-id='type-id-173' size-in-bits='64' filepath='/usr/lib64/glib-2.0/include/glibconfig.h' line='66' column='1' hash='b119fe0931d2ee10' id='type-id-309'/>
    <typedef-decl name='glong' type-id='type-id-173' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='54' column='1' hash='b119fe0931d2ee10' id='type-id-243'/>
    <typedef-decl name='gsize' type-id='type-id-146' size-in-bits='64' filepath='/usr/lib64/glib-2.0/include/glibconfig.h' line='83' column='1' hash='8fdc5eea2983a729' id='type-id-203'/>
    <typedef-decl name='gssize' type-id='type-id-173' size-in-bits='64' filepath='/usr/lib64/glib-2.0/include/glibconfig.h' line='82' column='1' hash='b119fe0931d2ee10' id='type-id-310'/>
    <typedef-decl name='guint' type-id='type-id-311' size-in-bits='32' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='61' column='1' hash='e66b43f97c38e87a' id='type-id-187'/>
    <typedef-decl name='guint16' type-id='type-id-312' size-in-bits='16' filepath='/usr/lib64/glib-2.0/include/glibconfig.h' line='49' column='1' hash='d7723bb93a30b11d' id='type-id-265'/>
    <typedef-decl name='guint32' type-id='type-id-311' size-in-bits='32' filepath='/usr/lib64/glib-2.0/include/glibconfig.h' line='57' column='1' hash='e66b43f97c38e87a' id='type-id-276'/>
    <typedef-decl name='guint64' type-id='type-id-146' size-in-bits='64' filepath='/usr/lib64/glib-2.0/include/glibconfig.h' line='67' column='1' hash='8fdc5eea2983a729' id='type-id-313'/>
    <typedef-decl name='guint8' type-id='type-id-314' size-in-bits='8' filepath='/usr/lib64/glib-2.0/include/glibconfig.h' line='46' column='1' hash='6ebac62b3366db68' id='type-id-169'/>
    <typedef-decl name='gulong' type-id='type-id-146' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='60' column='1' hash='8fdc5eea2983a729' id='type-id-315'/>
    <typedef-decl name='gunichar' type-id='type-id-276' size-in-bits='32' filepath='/usr/include/glib-2.0/glib/gunicode.h' line='61' column='1' hash='e66b43f97c38e87a' id='type-id-88'/>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='119' column='1' hash='1bfae6eb37df9f20' id='type-id-316'>
      <data-member access='public'>
        <var-decl name='v_int' type-id='type-id-40' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='120' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_uint' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='121' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_long' type-id='type-id-243' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='122' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_ulong' type-id='type-id-315' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='123' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_int64' type-id='type-id-309' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='124' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_uint64' type-id='type-id-313' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='125' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_float' type-id='type-id-308' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='126' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_double' type-id='type-id-307' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='127' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_pointer' type-id='type-id-9' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='128' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-316' size-in-bits='128' hash='d87458c517811566' id='type-id-208'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-146' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-317'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='type-id-3'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-314'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-311'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-146'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='type-id-312'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' hash='488004dced2dfa9f' id='type-id-318'/>
    <pointer-type-def type-id='type-id-270' size-in-bits='64' hash='66b94a446df1f05a' id='type-id-319'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' hash='96686f4623f16fd0' id='type-id-320'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' hash='f3a3b0f39224c369' id='type-id-142'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' hash='f6f4f9b9b5ec1113' id='type-id-321'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' hash='67f13c1923df2743' id='type-id-185'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' hash='63a180762139620b' id='type-id-322'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' hash='708bb624586f2761' id='type-id-323'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' hash='f9ccab5e19df5072' id='type-id-324'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' hash='1c31dec900b610a9' id='type-id-264'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' hash='de334dd51ba793b2' id='type-id-134'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' hash='95b352ae0855cfe2' id='type-id-206'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' hash='d4d4fc65e4fe278d' id='type-id-325'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' hash='aecbb2a82c1431e1' id='type-id-326'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' hash='aea52ccebdf44e28' id='type-id-46'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' hash='e067b39c58f49f16' id='type-id-327'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' hash='cbd8530eb0d452b8' id='type-id-328'/>
    <pointer-type-def type-id='type-id-328' size-in-bits='64' hash='4e4950bb80aead19' id='type-id-329'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' hash='f3f311815b62dc9d' id='type-id-223'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' hash='e03d637d4e504ec2' id='type-id-330'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' hash='6a4b8b95b2290d42' id='type-id-227'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' hash='59bdb7092c3fc94c' id='type-id-331'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' hash='adb38d1c4ff4ea7d' id='type-id-332'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' hash='8813534f082f40f3' id='type-id-231'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' hash='d5aeb68060cb65ab' id='type-id-237'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' hash='f2a2c0ab5f1beb76' id='type-id-333'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' hash='d38e34ccfa804e6a' id='type-id-241'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' hash='4df7bcb51f3c1642' id='type-id-334'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' hash='1d42d3efb4321175' id='type-id-44'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' hash='0c0227f4a27d391a' id='type-id-245'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' hash='de9dcc04d7db2fc1' id='type-id-35'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' hash='22a02b654c185cfd' id='type-id-230'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' hash='a4d3a9961e7ae06f' id='type-id-250'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' hash='6193c4936347937a' id='type-id-335'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' hash='fe857e4d7c981e51' id='type-id-254'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' hash='b31db109077e9da9' id='type-id-258'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' hash='5b7fc79e731da868' id='type-id-41'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' hash='1dac571ff7eaad5f' id='type-id-131'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' hash='413f40e2653c1f3e' id='type-id-139'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' hash='fedb4d19819e7cd8' id='type-id-336'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' hash='26004e62431d9e82' id='type-id-262'/>
    <pointer-type-def type-id='type-id-305' size-in-bits='64' hash='2c2ac324fbb20563' id='type-id-337'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' hash='20ed664ea62e08c7' id='type-id-267'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-338'/>
    <pointer-type-def type-id='type-id-338' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-339'/>
    <qualified-type-def type-id='type-id-273' const='yes' hash='8ff97f2adbc699a1' id='type-id-340'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' hash='1edb75ee97d537b3' id='type-id-341'/>
    <qualified-type-def type-id='type-id-281' const='yes' hash='5579a3cec125e90f' id='type-id-342'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' hash='5b0604936bdf7526' id='type-id-343'/>
    <qualified-type-def type-id='type-id-148' const='yes' hash='3e50fd33f9bb78d9' id='type-id-344'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' hash='c44743f354f6a443' id='type-id-345'/>
    <qualified-type-def type-id='type-id-259' const='yes' hash='b9f89cb05ba8439c' id='type-id-346'/>
    <pointer-type-def type-id='type-id-346' size-in-bits='64' hash='517acb362f3f5873' id='type-id-140'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' hash='cbdb20c7890e205d' id='type-id-23'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' hash='b850e17205d9f8d1' id='type-id-347'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='7c3bfb2f442d97d9' id='type-id-143'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' hash='a22803f0822b9536' id='type-id-219'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' hash='4384563727abe56b' id='type-id-348'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-54'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' id='type-id-176'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-354'/>
    <pointer-type-def type-id='type-id-355' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-181'/>
    <pointer-type-def type-id='type-id-357' size-in-bits='64' id='type-id-229'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-359'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-361' size-in-bits='64' id='type-id-191'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-363'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' id='type-id-364'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-368' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-369' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-218'/>
    <pointer-type-def type-id='type-id-372' size-in-bits='64' id='type-id-373'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-376' size-in-bits='64' id='type-id-377'/>
    <pointer-type-def type-id='type-id-378' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' id='type-id-221'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-381'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-384' size-in-bits='64' id='type-id-247'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-386'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-388' size-in-bits='64' id='type-id-257'/>
    <qualified-type-def type-id='type-id-94' const='yes' id='type-id-389'/>
    <pointer-type-def type-id='type-id-389' size-in-bits='64' id='type-id-390'/>
    <class-decl name='_GBufferedInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-391'/>
    <class-decl name='_GCancellablePrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-392'/>
    <class-decl name='_GCharsetConverter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-393'/>
    <class-decl name='_GConverter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-394'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-395'/>
    <class-decl name='_GDataInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-396'/>
    <class-decl name='_GFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-397'/>
    <class-decl name='_GFileInfo' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-398'/>
    <class-decl name='_GIOStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-399'/>
    <class-decl name='_GInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-400'/>
    <class-decl name='_GMatchInfo' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-401'/>
    <class-decl name='_GOutputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-402'/>
    <class-decl name='_GRegex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-403'/>
    <class-decl name='_GSocketClientPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-404'/>
    <class-decl name='_GSocketConnectionPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-405'/>
    <class-decl name='_GeeAbstractBidirListPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-406'/>
    <class-decl name='_GeeAbstractCollectionPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-407'/>
    <class-decl name='_GeeAbstractListPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-408'/>
    <class-decl name='_GeeArrayListPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-409'/>
    <class-decl name='_GeeCollection' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-410'/>
    <class-decl name='_GeeIterator' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-411'/>
    <class-decl name='_GeeList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-412'/>
    <class-decl name='_GeeMap' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-413'/>
    <class-decl name='_GeeMapEntryPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-414'/>
    <class-decl name='_GeeSet' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-415'/>
    <class-decl name='_SkkDictPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-416'/>
    <class-decl name='_SkkEmptyDictPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-417'/>
    <class-decl name='_SkkKeyEventFilterPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-418'/>
    <class-decl name='_SkkRomKanaMapFilePrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-419'/>
    <class-decl name='_SkkRomKanaMapFilePrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-420'/>
    <class-decl name='_SkkRomKanaNodePrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-421'/>
    <typedef-decl name='SkkDictPrivate' type-id='type-id-416' filepath='../libskk/libskk.h' line='2144' column='1' id='type-id-382'/>
    <typedef-decl name='SkkEmptyDictPrivate' type-id='type-id-417' filepath='../libskk/libskk.h' line='2165' column='1' id='type-id-383'/>
    <typedef-decl name='SkkKeyEventFilterPrivate' type-id='type-id-418' filepath='../libskk/libskk.h' line='2253' column='1' id='type-id-384'/>
    <typedef-decl name='GeeIterator' type-id='type-id-411' filepath='/usr/include/gee-0.8/gee.h' line='56' column='1' id='type-id-374'/>
    <typedef-decl name='GeeCollection' type-id='type-id-410' filepath='/usr/include/gee-0.8/gee.h' line='76' column='1' id='type-id-372'/>
    <typedef-decl name='GeeAbstractCollectionPrivate' type-id='type-id-407' filepath='/usr/include/gee-0.8/gee.h' line='88' column='1' id='type-id-369'/>
    <typedef-decl name='GeeList' type-id='type-id-412' filepath='/usr/include/gee-0.8/gee.h' line='95' column='1' id='type-id-376'/>
    <typedef-decl name='GeeAbstractListPrivate' type-id='type-id-408' filepath='/usr/include/gee-0.8/gee.h' line='115' column='1' id='type-id-370'/>
    <typedef-decl name='GeeAbstractBidirListPrivate' type-id='type-id-406' filepath='/usr/include/gee-0.8/gee.h' line='150' column='1' id='type-id-368'/>
    <typedef-decl name='GeeSet' type-id='type-id-415' filepath='/usr/include/gee-0.8/gee.h' line='157' column='1' id='type-id-380'/>
    <typedef-decl name='GeeMap' type-id='type-id-413' filepath='/usr/include/gee-0.8/gee.h' line='214' column='1' id='type-id-378'/>
    <typedef-decl name='GeeArrayListPrivate' type-id='type-id-409' filepath='/usr/include/gee-0.8/gee.h' line='361' column='1' id='type-id-371'/>
    <typedef-decl name='GeeMapEntryPrivate' type-id='type-id-414' filepath='/usr/include/gee-0.8/gee.h' line='520' column='1' id='type-id-379'/>
    <typedef-decl name='GBufferedInputStreamPrivate' type-id='type-id-391' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='42' column='1' id='type-id-350'/>
    <typedef-decl name='GCancellablePrivate' type-id='type-id-392' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='42' column='1' id='type-id-351'/>
    <typedef-decl name='GDataInputStreamPrivate' type-id='type-id-396' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='42' column='1' id='type-id-356'/>
    <typedef-decl name='GInputStreamPrivate' type-id='type-id-400' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='42' column='1' id='type-id-361'/>
    <typedef-decl name='GIOStreamPrivate' type-id='type-id-399' filepath='/usr/include/glib-2.0/gio/giostream.h' line='40' column='1' id='type-id-360'/>
    <typedef-decl name='GCharsetConverter' type-id='type-id-393' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='41' column='1' id='type-id-352'/>
    <typedef-decl name='GConverter' type-id='type-id-394' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='42' column='1' id='type-id-353'/>
    <typedef-decl name='GFile' type-id='type-id-397' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='74' column='1' id='type-id-357'/>
    <typedef-decl name='GFileInfo' type-id='type-id-398' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='75' column='1' id='type-id-358'/>
    <typedef-decl name='GOutputStreamPrivate' type-id='type-id-402' filepath='/usr/include/glib-2.0/gio/goutputstream.h' line='42' column='1' id='type-id-365'/>
    <typedef-decl name='GSocketClientPrivate' type-id='type-id-404' filepath='/usr/include/glib-2.0/gio/gsocketclient.h' line='48' column='1' id='type-id-366'/>
    <typedef-decl name='GSocketConnectionPrivate' type-id='type-id-405' filepath='/usr/include/glib-2.0/gio/gsocketconnection.h' line='51' column='1' id='type-id-367'/>
    <typedef-decl name='GData' type-id='type-id-395' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='38' column='1' id='type-id-355'/>
    <typedef-decl name='GRegex' type-id='type-id-403' filepath='/usr/include/glib-2.0/glib/gregex.h' line='416' column='1' id='type-id-94'/>
    <typedef-decl name='GMatchInfo' type-id='type-id-401' filepath='/usr/include/glib-2.0/glib/gregex.h' line='425' column='1' id='type-id-362'/>
    <typedef-decl name='gpointer' type-id='type-id-252' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='109' column='1' id='type-id-9'/>
    <typedef-decl name='gconstpointer' type-id='type-id-252' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='110' column='1' id='type-id-422'/>
    <function-decl name='skk_cdb_dict_construct' mangled-name='skk_cdb_dict_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_cdb_dict_construct' hash='0001e226b0f3274e'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='889' column='1'/>
      <parameter type-id='type-id-140' name='path' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='890' column='1'/>
      <parameter type-id='type-id-140' name='encoding' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='891' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='892' column='1'/>
      <return type-id='type-id-330'/>
    </function-decl>
    <function-decl name='skk_cdb_dict_new' mangled-name='skk_cdb_dict_new' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_cdb_dict_new' hash='c51e7af42342e684'>
      <parameter type-id='type-id-140' name='path' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='973' column='1'/>
      <parameter type-id='type-id-140' name='encoding' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='974' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='975' column='1'/>
      <return type-id='type-id-330'/>
    </function-decl>
    <function-decl name='skk_cdb_dict_get_type' mangled-name='skk_cdb_dict_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/cdb-dict.c' line='1067' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_cdb_dict_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_dict_split_candidates' mangled-name='skk_dict_split_candidates' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_dict_split_candidates' hash='62e97e32dc1dc7b5'>
      <parameter type-id='type-id-331' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='204' column='1'/>
      <parameter type-id='type-id-140' name='midasi' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='205' column='1'/>
      <parameter type-id='type-id-167' name='okuri' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='206' column='1'/>
      <parameter type-id='type-id-140' name='line' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='207' column='1'/>
      <parameter type-id='type-id-143' name='result_length1' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='208' column='1'/>
      <return type-id='type-id-329'/>
    </function-decl>
    <function-decl name='skk_dict_join_candidates' mangled-name='skk_dict_join_candidates' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='746' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_dict_join_candidates' hash='caf55fc0bf65e38f'>
      <parameter type-id='type-id-331' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='746' column='1'/>
      <parameter type-id='type-id-329' name='candidates' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='747' column='1'/>
      <parameter type-id='type-id-40' name='candidates_length1' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='748' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='skk_dict_reload' mangled-name='skk_dict_reload' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='870' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_dict_reload' hash='56b7083b6ddfd311'>
      <parameter type-id='type-id-331' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='870' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='871' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_dict_lookup' mangled-name='skk_dict_lookup' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='909' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_dict_lookup' hash='f0433eb1297f97de'>
      <parameter type-id='type-id-331' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='909' column='1'/>
      <parameter type-id='type-id-140' name='midasi' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='910' column='1'/>
      <parameter type-id='type-id-167' name='okuri' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='911' column='1'/>
      <parameter type-id='type-id-143' name='result_length1' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='912' column='1'/>
      <return type-id='type-id-329'/>
    </function-decl>
    <function-decl name='skk_dict_complete' mangled-name='skk_dict_complete' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='950' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_dict_complete' hash='9e3c07a6c60289c3'>
      <parameter type-id='type-id-331' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='950' column='1'/>
      <parameter type-id='type-id-140' name='midasi' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='951' column='1'/>
      <parameter type-id='type-id-143' name='result_length1' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='952' column='1'/>
      <return type-id='type-id-347'/>
    </function-decl>
    <function-decl name='skk_dict_select_candidate' mangled-name='skk_dict_select_candidate' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='992' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_dict_select_candidate' hash='b4a40f64772441cc'>
      <parameter type-id='type-id-331' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='992' column='1'/>
      <parameter type-id='type-id-328' name='candidate' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='993' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_dict_purge_candidate' mangled-name='skk_dict_purge_candidate' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='1033' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_dict_purge_candidate' hash='b4a40f64772441cc'>
      <parameter type-id='type-id-331' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='992' column='1'/>
      <parameter type-id='type-id-328' name='candidate' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='993' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_dict_save' mangled-name='skk_dict_save' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='1064' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_dict_save' hash='56b7083b6ddfd311'>
      <parameter type-id='type-id-331' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='870' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='871' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_dict_construct' mangled-name='skk_dict_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='1081' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_dict_construct' hash='7ca0f1d9e7faf3f6'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='1081' column='1'/>
      <return type-id='type-id-331'/>
    </function-decl>
    <function-decl name='skk_dict_get_read_only' mangled-name='skk_dict_get_read_only' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='1092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_dict_get_read_only' hash='e20d2379acd48e7d'>
      <parameter type-id='type-id-331' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='1092' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_dict_get_type' mangled-name='skk_dict_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='1158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_dict_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_empty_dict_construct' mangled-name='skk_empty_dict_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='1276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_empty_dict_construct' hash='91b2eddd62d5ed61'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='1276' column='1'/>
      <return type-id='type-id-332'/>
    </function-decl>
    <function-decl name='skk_empty_dict_new' mangled-name='skk_empty_dict_new' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='1287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_empty_dict_new' hash='a7e2d2f449df21e1'>
      <return type-id='type-id-332'/>
    </function-decl>
    <function-decl name='skk_empty_dict_get_type' mangled-name='skk_empty_dict_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/dict.c' line='1352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_empty_dict_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_file_dict_construct' mangled-name='skk_file_dict_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='2204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_file_dict_construct' hash='091a3f3464e4bf11'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='2204' column='1'/>
      <parameter type-id='type-id-140' name='path' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='2205' column='1'/>
      <parameter type-id='type-id-140' name='encoding' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='2206' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='2207' column='1'/>
      <return type-id='type-id-333'/>
    </function-decl>
    <function-decl name='skk_file_dict_new' mangled-name='skk_file_dict_new' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='2288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_file_dict_new' hash='402de6c7477c4fca'>
      <parameter type-id='type-id-140' name='path' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='2288' column='1'/>
      <parameter type-id='type-id-140' name='encoding' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='2289' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='2290' column='1'/>
      <return type-id='type-id-333'/>
    </function-decl>
    <function-decl name='skk_file_dict_get_type' mangled-name='skk_file_dict_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/file-dict.c' line='2382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_file_dict_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_key_event_filter_filter_key_event' mangled-name='skk_key_event_filter_filter_key_event' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event-filter.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_filter_filter_key_event' hash='52f6afad5ac62599'>
      <parameter type-id='type-id-44' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event-filter.c' line='108' column='1'/>
      <parameter type-id='type-id-334' name='key' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event-filter.c' line='109' column='1'/>
      <return type-id='type-id-334'/>
    </function-decl>
    <function-decl name='skk_key_event_filter_reset' mangled-name='skk_key_event_filter_reset' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event-filter.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_filter_reset' hash='be6249b0449cf18a'>
      <parameter type-id='type-id-44' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event-filter.c' line='136' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_key_event_filter_construct' mangled-name='skk_key_event_filter_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event-filter.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_filter_construct' hash='6ca2cb7331fb6497'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event-filter.c' line='152' column='1'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='skk_key_event_filter_get_type' mangled-name='skk_key_event_filter_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event-filter.c' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_filter_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_key_event_format_error_quark' mangled-name='skk_key_event_format_error_quark' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_format_error_quark' hash='2bb88322482ae81c'>
      <return type-id='type-id-138'/>
    </function-decl>
    <function-decl name='skk_key_event_format_error_get_type' mangled-name='skk_key_event_format_error_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_format_error_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_modifier_type_get_type' mangled-name='skk_modifier_type_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_modifier_type_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_key_event_construct' mangled-name='skk_key_event_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_construct' hash='a500232061d5888e'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='181' column='1'/>
      <parameter type-id='type-id-140' name='name' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='182' column='1'/>
      <parameter type-id='type-id-88' name='code' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='183' column='1'/>
      <parameter type-id='type-id-163' name='modifiers' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='184' column='1'/>
      <return type-id='type-id-334'/>
    </function-decl>
    <function-decl name='skk_key_event_new' mangled-name='skk_key_event_new' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_new' hash='481dc38d4a82758c'>
      <parameter type-id='type-id-140' name='name' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='201' column='1'/>
      <parameter type-id='type-id-88' name='code' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='202' column='1'/>
      <parameter type-id='type-id-163' name='modifiers' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='203' column='1'/>
      <return type-id='type-id-334'/>
    </function-decl>
    <function-decl name='skk_key_event_copy' mangled-name='skk_key_event_copy' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_copy' hash='0781e6bf6a5e003d'>
      <parameter type-id='type-id-334' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='216' column='1'/>
      <return type-id='type-id-334'/>
    </function-decl>
    <function-decl name='skk_key_event_construct_from_string' mangled-name='skk_key_event_construct_from_string' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_construct_from_string' hash='6811f92e8dc95df4'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='467' column='1'/>
      <parameter type-id='type-id-140' name='key' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='468' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='469' column='1'/>
      <return type-id='type-id-334'/>
    </function-decl>
    <function-decl name='skk_key_event_new_from_string' mangled-name='skk_key_event_new_from_string' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='994' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_new_from_string' hash='d1ff103e7ad59c1e'>
      <parameter type-id='type-id-140' name='key' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='994' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='995' column='1'/>
      <return type-id='type-id-334'/>
    </function-decl>
    <function-decl name='skk_key_event_to_string' mangled-name='skk_key_event_to_string' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_to_string' hash='23d44a6f2c61b886'>
      <parameter type-id='type-id-334' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1320' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='skk_key_event_construct_from_x_keysym' mangled-name='skk_key_event_construct_from_x_keysym' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_construct_from_x_keysym' hash='0b4e19aefb601c7c'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1597' column='1'/>
      <parameter type-id='type-id-187' name='keyval' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1598' column='1'/>
      <parameter type-id='type-id-163' name='modifiers' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1599' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1600' column='1'/>
      <return type-id='type-id-334'/>
    </function-decl>
    <function-decl name='skk_key_event_new_from_x_keysym' mangled-name='skk_key_event_new_from_x_keysym' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_new_from_x_keysym' hash='bb1acf81a2e5d271'>
      <parameter type-id='type-id-187' name='keyval' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1770' column='1'/>
      <parameter type-id='type-id-163' name='modifiers' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1771' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1772' column='1'/>
      <return type-id='type-id-334'/>
    </function-decl>
    <function-decl name='skk_key_event_base_equal' mangled-name='skk_key_event_base_equal' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1787' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_base_equal' hash='6584f67f841777c4'>
      <parameter type-id='type-id-334' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1787' column='1'/>
      <parameter type-id='type-id-334' name='key' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1788' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_key_event_get_name' mangled-name='skk_key_event_get_name' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_get_name' hash='da63507d4b7dd2a5'>
      <parameter type-id='type-id-334' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1827' column='1'/>
      <return type-id='type-id-140'/>
    </function-decl>
    <function-decl name='skk_key_event_get_code' mangled-name='skk_key_event_get_code' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1868' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_get_code' hash='718cd21d0000a1bc'>
      <parameter type-id='type-id-334' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1868' column='1'/>
      <return type-id='type-id-88'/>
    </function-decl>
    <function-decl name='skk_key_event_get_modifiers' mangled-name='skk_key_event_get_modifiers' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1900' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_get_modifiers' hash='00fd154c44cdea30'>
      <parameter type-id='type-id-334' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1900' column='1'/>
      <return type-id='type-id-163'/>
    </function-decl>
    <function-decl name='skk_key_event_set_modifiers' mangled-name='skk_key_event_set_modifiers' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1913' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_set_modifiers' hash='ecbc6bcf4aee5bd8'>
      <parameter type-id='type-id-334' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1913' column='1'/>
      <parameter type-id='type-id-163' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='1914' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_key_event_get_type' mangled-name='skk_key_event_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/key-event.c' line='2117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_key_event_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <typedef-decl name='SkkRomKanaNodePrivate' type-id='type-id-421' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='51' column='1' id='type-id-388'/>
    <typedef-decl name='SkkRomKanaMapFilePrivate' type-id='type-id-419' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='92' column='1' id='type-id-385'/>
    <function-decl name='skk_kana_mode_get_type' mangled-name='skk_kana_mode_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_kana_mode_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_period_style_get_type' mangled-name='skk_period_style_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_period_style_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_construct' mangled-name='skk_rom_kana_converter_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_construct' hash='6540eac2b9c00f58'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='727' column='1'/>
      <return type-id='type-id-335'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_new' mangled-name='skk_rom_kana_converter_new' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='860' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_new' hash='58fe555038b80769'>
      <return type-id='type-id-335'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_is_valid' mangled-name='skk_rom_kana_converter_is_valid' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='868' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_is_valid' hash='3bf440c97e3c0ef2'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='868' column='1'/>
      <parameter type-id='type-id-88' name='uc' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='869' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_output_nn_if_any' mangled-name='skk_rom_kana_converter_output_nn_if_any' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='902' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_output_nn_if_any' hash='a2510ac6edc85b6a'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1649' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_append_text' mangled-name='skk_rom_kana_converter_append_text' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1012' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_append_text' hash='06d1b49d853a0de1'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1887' column='1'/>
      <parameter type-id='type-id-140' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1888' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_append' mangled-name='skk_rom_kana_converter_append' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_append' hash='3bf440c97e3c0ef2'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='868' column='1'/>
      <parameter type-id='type-id-88' name='uc' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='869' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_can_consume' mangled-name='skk_rom_kana_converter_can_consume' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1492' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_can_consume' hash='2a8b911235e69b6b'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1492' column='1'/>
      <parameter type-id='type-id-88' name='uc' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1493' column='1'/>
      <parameter type-id='type-id-167' name='preedit_only' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1494' column='1'/>
      <parameter type-id='type-id-167' name='no_carryover' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1495' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_reset' mangled-name='skk_rom_kana_converter_reset' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1610' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_reset' hash='58fe555038b80769'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1610' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_delete' mangled-name='skk_rom_kana_converter_delete' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_delete' hash='a2510ac6edc85b6a'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1649' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_get_kana_mode' mangled-name='skk_rom_kana_converter_get_kana_mode' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_get_kana_mode' hash='a03dbf941cbf6e71'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1804' column='1'/>
      <return type-id='type-id-132'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_set_kana_mode' mangled-name='skk_rom_kana_converter_set_kana_mode' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_set_kana_mode' hash='694f6fe348d40449'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1817' column='1'/>
      <parameter type-id='type-id-132' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1818' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_get_period_style' mangled-name='skk_rom_kana_converter_get_period_style' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1836' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_get_period_style' hash='397f8c24302df24a'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1836' column='1'/>
      <return type-id='type-id-133'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_set_period_style' mangled-name='skk_rom_kana_converter_set_period_style' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_set_period_style' hash='31fbd21534c9060a'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1849' column='1'/>
      <parameter type-id='type-id-133' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1850' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_get_output' mangled-name='skk_rom_kana_converter_get_output' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1868' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_get_output' hash='f4f1e6d778057d06'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1903' column='1'/>
      <return type-id='type-id-140'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_get_preedit' mangled-name='skk_rom_kana_converter_get_preedit' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1903' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_get_preedit' hash='f4f1e6d778057d06'>
      <parameter type-id='type-id-335' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='1903' column='1'/>
      <return type-id='type-id-140'/>
    </function-decl>
    <function-decl name='skk_rom_kana_converter_get_type' mangled-name='skk_rom_kana_converter_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rom-kana.c' line='2004' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_rom_kana_converter_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <typedef-decl name='SkkRomKanaMapFilePrivate' type-id='type-id-420' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/rule.c' line='89' column='1' id='type-id-387'/>
    <function-decl name='skk_skk_serv_construct' mangled-name='skk_skk_serv_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_skk_serv_construct' hash='f62d11489c6a1270'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1566' column='1'/>
      <parameter type-id='type-id-140' name='host' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1567' column='1'/>
      <parameter type-id='type-id-265' name='port' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1568' column='1'/>
      <parameter type-id='type-id-140' name='encoding' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1569' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1570' column='1'/>
      <return type-id='type-id-336'/>
    </function-decl>
    <function-decl name='skk_skk_serv_new' mangled-name='skk_skk_serv_new' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_skk_serv_new' hash='d93087963bcbe658'>
      <parameter type-id='type-id-140' name='host' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1636' column='1'/>
      <parameter type-id='type-id-265' name='port' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1637' column='1'/>
      <parameter type-id='type-id-140' name='encoding' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1638' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1639' column='1'/>
      <return type-id='type-id-336'/>
    </function-decl>
    <function-decl name='skk_skk_serv_get_type' mangled-name='skk_skk_serv_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/skkserv.c' line='1731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_skk_serv_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_user_dict_construct' mangled-name='skk_user_dict_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='2712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_user_dict_construct' hash='0a6a76f016b3d403'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='2712' column='1'/>
      <parameter type-id='type-id-140' name='path' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='2713' column='1'/>
      <parameter type-id='type-id-140' name='encoding' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='2714' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='2715' column='1'/>
      <return type-id='type-id-337'/>
    </function-decl>
    <function-decl name='skk_user_dict_new' mangled-name='skk_user_dict_new' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='2789' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_user_dict_new' hash='7b5c7e20b574987d'>
      <parameter type-id='type-id-140' name='path' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='2789' column='1'/>
      <parameter type-id='type-id-140' name='encoding' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='2790' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='2791' column='1'/>
      <return type-id='type-id-337'/>
    </function-decl>
    <function-decl name='skk_user_dict_get_type' mangled-name='skk_user_dict_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/user-dict.c' line='2987' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_user_dict_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <type-decl name='void' id='type-id-141'/>
    <pointer-type-def type-id='type-id-141' id='type-id-252'/>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-349'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-141'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-35a37' comp-dir-path='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk' language='LANG_C11'>
    <enum-decl name='GSignalMatchType' naming-typedef-id='type-id-423' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gsignal.h' line='215' column='1' hash='d637ff36353906c9' id='type-id-424'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='G_SIGNAL_MATCH_ID' value='1'/>
      <enumerator name='G_SIGNAL_MATCH_DETAIL' value='2'/>
      <enumerator name='G_SIGNAL_MATCH_CLOSURE' value='4'/>
      <enumerator name='G_SIGNAL_MATCH_FUNC' value='8'/>
      <enumerator name='G_SIGNAL_MATCH_DATA' value='16'/>
      <enumerator name='G_SIGNAL_MATCH_UNBLOCKED' value='32'/>
    </enum-decl>
    <class-decl name='_GClosure' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='173' column='1' hash='42fe4534f4f2d3ff' id='type-id-425'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='meta_marshal_nouse' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='n_guards' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='n_fnotifiers' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='n_inotifiers' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='in_inotify' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='floating' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='derivative_flag' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='in_marshal' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='is_invalid' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='marshal' type-id='type-id-426' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-9' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='notifiers' type-id='type-id-427' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='199' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GClosureNotifyData' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='167' column='1' hash='8a400b7d68a380b2' id='type-id-428'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-9' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='notify' type-id='type-id-429' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTimeVal' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='580' column='1' hash='c239771f65a4623b' id='type-id-430'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-243' visibility='default' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_usec' type-id='type-id-243' visibility='default' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='583' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkContext' is-struct='yes' visibility='default' size-in-bits='256' filepath='../libskk/libskk.h' line='2469' column='1' hash='4f1c65a74fef4cf3' id='type-id-431'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='../libskk/libskk.h' line='2470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-432' visibility='default' filepath='../libskk/libskk.h' line='2471' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkContextPrivate' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='177' column='1' hash='6dab979ce9eb3827' id='type-id-433'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_dictionaries' type-id='type-id-377' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_candidates' type-id='type-id-73' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='state_stack' type-id='type-id-22' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='handlers' type-id='type-id-33' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_preedit' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='preedit_underline_offset' type-id='type-id-187' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='preedit_underline_nchars' type-id='type-id-187' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='184' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkKutenStateHandler' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='385' column='1' hash='88193de906ac0da0' id='type-id-434'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-435' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-436' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='387' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkKutenStateHandlerPrivate' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='394' column='1' hash='71e9e06b96ca9684' id='type-id-437'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='converter' type-id='type-id-231' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='395' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkProxyCandidateList' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='120' column='1' hash='8856c5f8b3429386' id='type-id-438'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-59' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-439' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkProxyCandidateListPrivate' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='129' column='1' hash='b5646577979644db' id='type-id-440'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_candidates' type-id='type-id-73' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='130' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkStateHandler' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='349' column='1' hash='2721843e930d5d98' id='type-id-441'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-442' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='351' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GClosure' type-id='type-id-425' size-in-bits='256' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='77' column='1' id='type-id-443'/>
    <typedef-decl name='GClosureNotify' type-id='type-id-444' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='101' column='1' hash='fd7a63c0c6c822c4' id='type-id-429'/>
    <typedef-decl name='GClosureNotifyData' type-id='type-id-428' size-in-bits='128' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='78' column='1' id='type-id-445'/>
    <typedef-decl name='GSignalMatchType' type-id='type-id-424' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gsignal.h' line='222' column='1' hash='d637ff36353906c9' id='type-id-423'/>
    <typedef-decl name='GTimeVal' type-id='type-id-430' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='578' column='1' id='type-id-446'/>
    <typedef-decl name='SkkContext' type-id='type-id-431' size-in-bits='256' filepath='../libskk/libskk.h' line='2319' column='1' id='type-id-447'/>
    <typedef-decl name='SkkContextPrivate' type-id='type-id-433' size-in-bits='384' filepath='../libskk/libskk.h' line='2321' column='1' id='type-id-448'/>
    <typedef-decl name='SkkKutenStateHandlerPrivate' type-id='type-id-437' size-in-bits='64' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='243' column='1' id='type-id-449'/>
    <typedef-decl name='SkkProxyCandidateList' type-id='type-id-438' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='84' column='1' id='type-id-450'/>
    <typedef-decl name='SkkProxyCandidateListPrivate' type-id='type-id-440' size-in-bits='64' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='86' column='1' id='type-id-451'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' hash='341d8feba9ff036a' id='type-id-452'/>
    <pointer-type-def type-id='type-id-445' size-in-bits='64' hash='c0fd71a7d87cca88' id='type-id-427'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' hash='61a6808aad469222' id='type-id-453'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' hash='a20db1dc8f37cf5b' id='type-id-454'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' hash='3a0c149b8dafd8db' id='type-id-455'/>
    <pointer-type-def type-id='type-id-448' size-in-bits='64' hash='a4edfff8487d716b' id='type-id-432'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' hash='96e53461e1d0858f' id='type-id-456'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' hash='10b92fd4be57fa08' id='type-id-457'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' hash='b1b1984a74c7d60d' id='type-id-459'/>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' hash='25cfd9599a24666d' id='type-id-436'/>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' hash='7577765d1051211f' id='type-id-460'/>
    <pointer-type-def type-id='type-id-451' size-in-bits='64' hash='4022c18b94ebf825' id='type-id-439'/>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' hash='effdac98347bdd5c' id='type-id-461'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' hash='6deef6b7069cfec0' id='type-id-462'/>
    <pointer-type-def type-id='type-id-463' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-426'/>
    <pointer-type-def type-id='type-id-464' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-444'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' id='type-id-466'/>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' id='type-id-468'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' id='type-id-442'/>
    <class-decl name='_GeeDeque' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-470'/>
    <class-decl name='_GeeQueue' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-471'/>
    <class-decl name='_SkkStateHandlerPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-472'/>
    <typedef-decl name='GeeQueue' type-id='type-id-471' filepath='/usr/include/gee-0.8/gee.h' line='338' column='1' id='type-id-467'/>
    <typedef-decl name='GeeDeque' type-id='type-id-470' filepath='/usr/include/gee-0.8/gee.h' line='368' column='1' id='type-id-465'/>
    <function-decl name='skk_candidate_list_get' mangled-name='skk_candidate_list_get' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_get' hash='44250e82d51b7515'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='266' column='1'/>
      <parameter type-id='type-id-40' name='index' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='267' column='1'/>
      <return type-id='type-id-328'/>
    </function-decl>
    <function-decl name='skk_candidate_list_cursor_up' mangled-name='skk_candidate_list_cursor_up' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_cursor_up' hash='30e54588d1505648'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='384' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_candidate_list_cursor_down' mangled-name='skk_candidate_list_cursor_down' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_cursor_down' hash='30e54588d1505648'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='384' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_candidate_list_page_up' mangled-name='skk_candidate_list_page_up' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='454' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_page_up' hash='30e54588d1505648'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='384' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_candidate_list_page_down' mangled-name='skk_candidate_list_page_down' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_page_down' hash='30e54588d1505648'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='384' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_candidate_list_next' mangled-name='skk_candidate_list_next' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='545' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_next' hash='30e54588d1505648'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='384' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_candidate_list_previous' mangled-name='skk_candidate_list_previous' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_previous' hash='30e54588d1505648'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='384' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_candidate_list_get_page_start_cursor_pos' mangled-name='skk_candidate_list_get_page_start_cursor_pos' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='625' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_get_page_start_cursor_pos' hash='674f8758110fc30c'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='788' column='1'/>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='skk_candidate_list_select_at' mangled-name='skk_candidate_list_select_at' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_select_at' hash='5a9f5c826dc4533d'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='690' column='1'/>
      <parameter type-id='type-id-187' name='index_in_page' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='691' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_candidate_list_select' mangled-name='skk_candidate_list_select' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_select' hash='b8e40a3fddee26dc'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='296' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_candidate_list_construct' mangled-name='skk_candidate_list_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='739' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_construct' hash='f062f9dda8998d03'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='739' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='skk_candidate_list_get_cursor_pos' mangled-name='skk_candidate_list_get_cursor_pos' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='750' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_get_cursor_pos' hash='30e54588d1505648'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='750' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='skk_candidate_list_get_size' mangled-name='skk_candidate_list_get_size' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_get_size' hash='30e54588d1505648'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='750' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='skk_candidate_list_get_page_start' mangled-name='skk_candidate_list_get_page_start' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='788' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_get_page_start' hash='674f8758110fc30c'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='788' column='1'/>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='skk_candidate_list_set_page_start' mangled-name='skk_candidate_list_set_page_start' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='807' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_set_page_start' hash='16bb1bc8e49e45a2'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='807' column='1'/>
      <parameter type-id='type-id-187' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='808' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_candidate_list_get_page_size' mangled-name='skk_candidate_list_get_page_size' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='824' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_get_page_size' hash='674f8758110fc30c'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='788' column='1'/>
      <return type-id='type-id-187'/>
    </function-decl>
    <function-decl name='skk_candidate_list_set_page_size' mangled-name='skk_candidate_list_set_page_size' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_set_page_size' hash='16bb1bc8e49e45a2'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='807' column='1'/>
      <parameter type-id='type-id-187' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='808' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_candidate_list_get_page_visible' mangled-name='skk_candidate_list_get_page_visible' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='860' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_get_page_visible' hash='30e54588d1505648'>
      <parameter type-id='type-id-73' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='384' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_candidate_list_get_type' mangled-name='skk_candidate_list_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate-list.c' line='978' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_list_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_candidate_to_string' mangled-name='skk_candidate_to_string' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_to_string' hash='7d0283c5befa0300'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='88' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='skk_candidate_construct' mangled-name='skk_candidate_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_construct' hash='ee3c47a46be80439'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='151' column='1'/>
      <parameter type-id='type-id-140' name='midasi' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='152' column='1'/>
      <parameter type-id='type-id-167' name='okuri' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='153' column='1'/>
      <parameter type-id='type-id-140' name='text' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='154' column='1'/>
      <parameter type-id='type-id-140' name='annotation' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='155' column='1'/>
      <parameter type-id='type-id-140' name='output' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='156' column='1'/>
      <return type-id='type-id-328'/>
    </function-decl>
    <function-decl name='skk_candidate_new' mangled-name='skk_candidate_new' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_new' hash='2d8b6000a8a9f0d6'>
      <parameter type-id='type-id-140' name='midasi' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='192' column='1'/>
      <parameter type-id='type-id-167' name='okuri' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='193' column='1'/>
      <parameter type-id='type-id-140' name='text' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='194' column='1'/>
      <parameter type-id='type-id-140' name='annotation' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='195' column='1'/>
      <parameter type-id='type-id-140' name='output' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='196' column='1'/>
      <return type-id='type-id-328'/>
    </function-decl>
    <function-decl name='skk_candidate_get_midasi' mangled-name='skk_candidate_get_midasi' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_get_midasi' hash='5f2576a6b1ba8ebc'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='359' column='1'/>
      <return type-id='type-id-140'/>
    </function-decl>
    <function-decl name='skk_candidate_get_okuri' mangled-name='skk_candidate_get_okuri' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_get_okuri' hash='f73e1214e7c55b79'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='245' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_candidate_get_text' mangled-name='skk_candidate_get_text' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_get_text' hash='5f2576a6b1ba8ebc'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='359' column='1'/>
      <return type-id='type-id-140'/>
    </function-decl>
    <function-decl name='skk_candidate_set_text' mangled-name='skk_candidate_set_text' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_set_text' hash='963c6a6aafef9320'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='375' column='1'/>
      <parameter type-id='type-id-140' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='376' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_candidate_get_annotation' mangled-name='skk_candidate_get_annotation' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_get_annotation' hash='5f2576a6b1ba8ebc'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='359' column='1'/>
      <return type-id='type-id-140'/>
    </function-decl>
    <function-decl name='skk_candidate_set_annotation' mangled-name='skk_candidate_set_annotation' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_set_annotation' hash='963c6a6aafef9320'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='375' column='1'/>
      <parameter type-id='type-id-140' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='376' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_candidate_get_output' mangled-name='skk_candidate_get_output' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_get_output' hash='5f2576a6b1ba8ebc'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='359' column='1'/>
      <return type-id='type-id-140'/>
    </function-decl>
    <function-decl name='skk_candidate_set_output' mangled-name='skk_candidate_set_output' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_set_output' hash='963c6a6aafef9320'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='375' column='1'/>
      <parameter type-id='type-id-140' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='376' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_candidate_get_type' mangled-name='skk_candidate_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/candidate.c' line='492' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_candidate_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_init' mangled-name='skk_init' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_init' hash='7f32ffea222edbe7'>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_input_mode_get_type' mangled-name='skk_input_mode_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_input_mode_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='skk_context_add_dictionary' mangled-name='skk_context_add_dictionary' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_add_dictionary' hash='cb891f3d4e9a848f'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='443' column='1'/>
      <parameter type-id='type-id-331' name='dict' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='444' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_remove_dictionary' mangled-name='skk_context_remove_dictionary' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_remove_dictionary' hash='cb891f3d4e9a848f'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='443' column='1'/>
      <parameter type-id='type-id-331' name='dict' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='444' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_construct' mangled-name='skk_context_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_construct' hash='b2c4600474fd1054'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='605' column='1'/>
      <parameter type-id='type-id-456' name='dictionaries' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='606' column='1'/>
      <parameter type-id='type-id-40' name='dictionaries_length1' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='607' column='1'/>
      <return type-id='type-id-455'/>
    </function-decl>
    <function-decl name='skk_context_new' mangled-name='skk_context_new' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='748' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_new' hash='3efc21a066e7275f'>
      <parameter type-id='type-id-456' name='dictionaries' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='748' column='1'/>
      <parameter type-id='type-id-40' name='dictionaries_length1' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='749' column='1'/>
      <return type-id='type-id-455'/>
    </function-decl>
    <function-decl name='skk_context_process_key_events' mangled-name='skk_context_process_key_events' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='1721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_process_key_events' hash='40a7ca87e33179ad'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='1721' column='1'/>
      <parameter type-id='type-id-140' name='keyseq' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='1722' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_context_process_key_event' mangled-name='skk_context_process_key_event' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_process_key_event' hash='a0a5b1e9e7e4b195'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2222' column='1'/>
      <parameter type-id='type-id-334' name='key' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2223' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_context_reset' mangled-name='skk_context_reset' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_reset' hash='b507bfd023e2693e'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2581' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_get_output' mangled-name='skk_context_get_output' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_output' hash='be0c0f3f189268bd'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2538' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='skk_context_peek_output' mangled-name='skk_context_peek_output' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2538' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_peek_output' hash='be0c0f3f189268bd'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2538' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='skk_context_poll_output' mangled-name='skk_context_poll_output' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_poll_output' hash='be0c0f3f189268bd'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2538' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='skk_context_clear_output' mangled-name='skk_context_clear_output' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_clear_output' hash='b507bfd023e2693e'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2581' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_get_preedit_underline' mangled-name='skk_context_get_preedit_underline' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2930' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_preedit_underline' hash='461f149ce37d6082'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2930' column='1'/>
      <parameter type-id='type-id-462' name='offset' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2931' column='1'/>
      <parameter type-id='type-id-462' name='nchars' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2932' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_save_dictionaries' mangled-name='skk_context_save_dictionaries' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2960' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_save_dictionaries' hash='e6373d00d809a06e'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2960' column='1'/>
      <parameter type-id='type-id-142' name='error' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='2961' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_get_dictionaries' mangled-name='skk_context_get_dictionaries' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3042' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_dictionaries' hash='26e6cab3853189c2'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3042' column='1'/>
      <parameter type-id='type-id-143' name='result_length1' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3043' column='1'/>
      <return type-id='type-id-456'/>
    </function-decl>
    <function-decl name='skk_context_set_dictionaries' mangled-name='skk_context_set_dictionaries' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3075' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_set_dictionaries' hash='3efc21a066e7275f'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3075' column='1'/>
      <parameter type-id='type-id-456' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3076' column='1'/>
      <parameter type-id='type-id-40' name='value_length1' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3077' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_get_candidates' mangled-name='skk_context_get_candidates' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_candidates' hash='34cdde2e6d7d51a3'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3124' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='skk_context_get_input_mode' mangled-name='skk_context_get_input_mode' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_input_mode' hash='d268ecfefbb70897'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3140' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='skk_context_set_input_mode' mangled-name='skk_context_set_input_mode' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_set_input_mode' hash='c10e9c2e39081ceb'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3173' column='1'/>
      <parameter type-id='type-id-6' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3174' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_get_auto_start_henkan_keywords' mangled-name='skk_context_get_auto_start_henkan_keywords' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_auto_start_henkan_keywords' hash='b5df3e6c97b9d02a'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3197' column='1'/>
      <parameter type-id='type-id-143' name='result_length1' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3198' column='1'/>
      <return type-id='type-id-347'/>
    </function-decl>
    <function-decl name='skk_context_set_auto_start_henkan_keywords' mangled-name='skk_context_set_auto_start_henkan_keywords' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_set_auto_start_henkan_keywords' hash='4a641aace332e1c9'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3276' column='1'/>
      <parameter type-id='type-id-347' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3277' column='1'/>
      <parameter type-id='type-id-40' name='value_length1' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3278' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_get_egg_like_newline' mangled-name='skk_context_get_egg_like_newline' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_egg_like_newline' hash='c577f9a36df3f2ca'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3313' column='1'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='skk_context_set_egg_like_newline' mangled-name='skk_context_set_egg_like_newline' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_set_egg_like_newline' hash='1d38a2664a5526b9'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3340' column='1'/>
      <parameter type-id='type-id-167' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3341' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_get_period_style' mangled-name='skk_context_get_period_style' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_period_style' hash='2c9f9d149913eddc'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3364' column='1'/>
      <return type-id='type-id-133'/>
    </function-decl>
    <function-decl name='skk_context_set_period_style' mangled-name='skk_context_set_period_style' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_set_period_style' hash='68aeecdd92e5d122'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3397' column='1'/>
      <parameter type-id='type-id-133' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3398' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_get_typing_rule' mangled-name='skk_context_get_typing_rule' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_typing_rule' hash='60d2d2af689a50ba'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3421' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='skk_context_set_typing_rule' mangled-name='skk_context_set_typing_rule' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_set_typing_rule' hash='69eee361176d6261'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3464' column='1'/>
      <parameter type-id='type-id-47' name='value' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3465' column='1'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='skk_context_get_key_event_filter' mangled-name='skk_context_get_key_event_filter' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_key_event_filter' hash='07519c60b7d22c15'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3523' column='1'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='skk_context_get_preedit' mangled-name='skk_context_get_preedit' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_preedit' hash='b7d155f3411486b8'>
      <parameter type-id='type-id-455' name='self' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3559' column='1'/>
      <return type-id='type-id-140'/>
    </function-decl>
    <function-decl name='skk_context_get_type' mangled-name='skk_context_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='3841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_context_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <typedef-decl name='SkkStateHandlerPrivate' type-id='type-id-472' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/state.c' line='197' column='1' id='type-id-469'/>
    <function-type size-in-bits='64' hash='cbc7d8889754444d' id='type-id-463'>
      <parameter type-id='type-id-452'/>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-343'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-141'/>
    </function-type>
    <function-type size-in-bits='64' hash='485dbe5a902b1524' id='type-id-464'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-452'/>
      <return type-id='type-id-141'/>
    </function-type>
    <function-type size-in-bits='64' hash='fe8357e11df9e46f' id='type-id-473'>
      <parameter type-id='type-id-343'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-4bbfe' comp-dir-path='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-474' size-in-bits='192' hash='9904ddbe9e0e1da6' id='type-id-475'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-146' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-476'/>
    </array-type-def>
    <enum-decl name='GTypeFlags' naming-typedef-id='type-id-477' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1088' column='1' hash='083256a7c37501b7' id='type-id-478'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='G_TYPE_FLAG_NONE' value='0'/>
      <enumerator name='G_TYPE_FLAG_ABSTRACT' value='16'/>
      <enumerator name='G_TYPE_FLAG_VALUE_ABSTRACT' value='32'/>
      <enumerator name='G_TYPE_FLAG_FINAL' value='64'/>
      <enumerator name='G_TYPE_FLAG_DEPRECATED' value='128'/>
    </enum-decl>
    <enum-decl name='GTypeFundamentalFlags' naming-typedef-id='type-id-479' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1063' column='1' hash='0159675e42a0ff60' id='type-id-480'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='G_TYPE_FLAG_CLASSED' value='1'/>
      <enumerator name='G_TYPE_FLAG_INSTANTIATABLE' value='2'/>
      <enumerator name='G_TYPE_FLAG_DERIVABLE' value='4'/>
      <enumerator name='G_TYPE_FLAG_DEEP_DERIVABLE' value='8'/>
    </enum-decl>
    <class-decl name='_GTypeFundamentalInfo' is-struct='yes' visibility='default' size-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1154' column='1' hash='6eb447d07b1c58bd' id='type-id-481'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type_flags' type-id='type-id-479' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeInfo' is-struct='yes' visibility='default' size-in-bits='576' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1126' column='1' hash='eb88b801d41d7715' id='type-id-482'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_size' type-id='type-id-265' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='base_init' type-id='type-id-483' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='base_finalize' type-id='type-id-484' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='class_init' type-id='type-id-485' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='class_finalize' type-id='type-id-486' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='class_data' type-id='type-id-422' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='instance_size' type-id='type-id-265' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='n_preallocs' type-id='type-id-265' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='instance_init' type-id='type-id-487' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='value_table' type-id='type-id-488' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1145' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeValueTable' is-struct='yes' visibility='default' size-in-bits='512' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1445' column='1' hash='caf77f98d276893f' id='type-id-489'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value_init' type-id='type-id-490' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value_free' type-id='type-id-491' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value_copy' type-id='type-id-492' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='value_peek_pointer' type-id='type-id-493' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='collect_format' type-id='type-id-140' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='collect_value' type-id='type-id-494' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lcopy_format' type-id='type-id-140' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lcopy_value' type-id='type-id-495' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1456' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkNicolaKeyEventFilter' is-struct='yes' visibility='default' size-in-bits='832' filepath='../libskk/libskk.h' line='2515' column='1' hash='dfb448e32e2574b1' id='type-id-496'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-294' visibility='default' filepath='../libskk/libskk.h' line='2516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-497' visibility='default' filepath='../libskk/libskk.h' line='2517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='get_time_func' type-id='type-id-498' visibility='default' filepath='../libskk/libskk.h' line='2518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_time_func_target' type-id='type-id-9' visibility='default' filepath='../libskk/libskk.h' line='2519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_time_func_target_destroy_notify' type-id='type-id-271' visibility='default' filepath='../libskk/libskk.h' line='2520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='timeout' type-id='type-id-309' visibility='default' filepath='../libskk/libskk.h' line='2521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='overlap' type-id='type-id-309' visibility='default' filepath='../libskk/libskk.h' line='2522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='maxwait' type-id='type-id-309' visibility='default' filepath='../libskk/libskk.h' line='2523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='special_doubles' type-id='type-id-347' visibility='default' filepath='../libskk/libskk.h' line='2524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='special_doubles_length1' type-id='type-id-40' visibility='default' filepath='../libskk/libskk.h' line='2525' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_SkkNicolaKeyEventFilterPrivate' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/nicola.c' line='59' column='1' hash='f17288f7627c4809' id='type-id-499'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pending' type-id='type-id-22' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/nicola.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='timeout_id' type-id='type-id-187' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/nicola.c' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' is-struct='yes' visibility='default' size-in-bits='1152' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' hash='4f24305487cf2e09' id='type-id-500'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-501' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-502' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-503' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-504' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-505' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-506' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-172' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-501' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-507' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-508' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-509' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-510' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-510' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-510' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-475' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' hash='7451f9a3207df4f1' id='type-id-510'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-511' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-474' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GBaseFinalizeFunc' type-id='type-id-54' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='843' column='1' hash='fd7a63c0c6c822c4' id='type-id-484'/>
    <typedef-decl name='GBaseInitFunc' type-id='type-id-54' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='829' column='1' hash='fd7a63c0c6c822c4' id='type-id-483'/>
    <typedef-decl name='GClassFinalizeFunc' type-id='type-id-512' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='964' column='1' hash='fd7a63c0c6c822c4' id='type-id-486'/>
    <typedef-decl name='GClassInitFunc' type-id='type-id-512' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='947' column='1' hash='fd7a63c0c6c822c4' id='type-id-485'/>
    <typedef-decl name='GInstanceInitFunc' type-id='type-id-513' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='986' column='1' hash='fd7a63c0c6c822c4' id='type-id-487'/>
    <typedef-decl name='GSourceFunc' type-id='type-id-514' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gmain.h' line='200' column='1' hash='fd7a63c0c6c822c4' id='type-id-515'/>
    <typedef-decl name='GTypeCValue' type-id='type-id-516' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='432' column='1' id='type-id-517'/>
    <typedef-decl name='GTypeFlags' type-id='type-id-478' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1094' column='1' hash='083256a7c37501b7' id='type-id-477'/>
    <typedef-decl name='GTypeFundamentalFlags' type-id='type-id-480' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1070' column='1' hash='0159675e42a0ff60' id='type-id-479'/>
    <typedef-decl name='GTypeFundamentalInfo' type-id='type-id-481' size-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='438' column='1' id='type-id-518'/>
    <typedef-decl name='GTypeInfo' type-id='type-id-482' size-in-bits='576' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='437' column='1' id='type-id-519'/>
    <typedef-decl name='GTypeValueCollectFunc' type-id='type-id-520' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1345' column='1' hash='fd7a63c0c6c822c4' id='type-id-494'/>
    <typedef-decl name='GTypeValueCopyFunc' type-id='type-id-521' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1237' column='1' hash='fd7a63c0c6c822c4' id='type-id-492'/>
    <typedef-decl name='GTypeValueFreeFunc' type-id='type-id-522' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1214' column='1' hash='fd7a63c0c6c822c4' id='type-id-491'/>
    <typedef-decl name='GTypeValueInitFunc' type-id='type-id-522' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1193' column='1' hash='fd7a63c0c6c822c4' id='type-id-490'/>
    <typedef-decl name='GTypeValueLCopyFunc' type-id='type-id-523' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1407' column='1' hash='fd7a63c0c6c822c4' id='type-id-495'/>
    <typedef-decl name='GTypeValuePeekPointerFunc' type-id='type-id-524' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1258' column='1' hash='fd7a63c0c6c822c4' id='type-id-493'/>
    <typedef-decl name='GTypeValueTable' type-id='type-id-489' size-in-bits='512' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='440' column='1' id='type-id-525'/>
    <typedef-decl name='SkkGetTime' type-id='type-id-526' size-in-bits='64' filepath='../libskk/libskk.h' line='2334' column='1' hash='fd7a63c0c6c822c4' id='type-id-498'/>
    <typedef-decl name='SkkNicolaKeyEventFilter' type-id='type-id-496' size-in-bits='832' filepath='../libskk/libskk.h' line='2343' column='1' id='type-id-527'/>
    <typedef-decl name='SkkNicolaKeyEventFilterPrivate' type-id='type-id-499' size-in-bits='128' filepath='../libskk/libskk.h' line='2345' column='1' id='type-id-528'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-173' size-in-bits='64' filepath='/usr/include/bits/types.h' line='180' column='1' hash='b119fe0931d2ee10' id='type-id-509'/>
    <typedef-decl name='__blksize_t' type-id='type-id-173' size-in-bits='64' filepath='/usr/include/bits/types.h' line='175' column='1' hash='b119fe0931d2ee10' id='type-id-508'/>
    <typedef-decl name='__dev_t' type-id='type-id-146' size-in-bits='64' filepath='/usr/include/bits/types.h' line='145' column='1' hash='8fdc5eea2983a729' id='type-id-501'/>
    <typedef-decl name='__gid_t' type-id='type-id-311' size-in-bits='32' filepath='/usr/include/bits/types.h' line='147' column='1' hash='e66b43f97c38e87a' id='type-id-506'/>
    <typedef-decl name='__ino_t' type-id='type-id-146' size-in-bits='64' filepath='/usr/include/bits/types.h' line='148' column='1' hash='8fdc5eea2983a729' id='type-id-502'/>
    <typedef-decl name='__mode_t' type-id='type-id-311' size-in-bits='32' filepath='/usr/include/bits/types.h' line='150' column='1' hash='e66b43f97c38e87a' id='type-id-504'/>
    <typedef-decl name='__nlink_t' type-id='type-id-146' size-in-bits='64' filepath='/usr/include/bits/types.h' line='151' column='1' hash='8fdc5eea2983a729' id='type-id-503'/>
    <typedef-decl name='__off_t' type-id='type-id-173' size-in-bits='64' filepath='/usr/include/bits/types.h' line='152' column='1' hash='b119fe0931d2ee10' id='type-id-507'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-173' size-in-bits='64' filepath='/usr/include/bits/types.h' line='197' column='1' hash='b119fe0931d2ee10' id='type-id-474'/>
    <typedef-decl name='__time_t' type-id='type-id-173' size-in-bits='64' filepath='/usr/include/bits/types.h' line='160' column='1' hash='b119fe0931d2ee10' id='type-id-511'/>
    <typedef-decl name='__uid_t' type-id='type-id-311' size-in-bits='32' filepath='/usr/include/bits/types.h' line='146' column='1' hash='e66b43f97c38e87a' id='type-id-505'/>
    <typedef-decl name='size_t' type-id='type-id-146' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='type-id-529'/>
    <union-decl name='_GTypeCValue' visibility='default' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gvaluecollector.h' line='56' column='1' hash='32e87354264e4cd2' id='type-id-516'>
      <data-member access='public'>
        <var-decl name='v_int' type-id='type-id-40' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvaluecollector.h' line='58' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_long' type-id='type-id-243' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvaluecollector.h' line='59' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_int64' type-id='type-id-309' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvaluecollector.h' line='60' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_double' type-id='type-id-307' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvaluecollector.h' line='61' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_pointer' type-id='type-id-9' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvaluecollector.h' line='62' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-517' size-in-bits='64' hash='5ceda879f9891f57' id='type-id-530'/>
    <pointer-type-def type-id='type-id-527' size-in-bits='64' hash='0776ed668c545a53' id='type-id-531'/>
    <pointer-type-def type-id='type-id-528' size-in-bits='64' hash='b9415bd7c87f5035' id='type-id-497'/>
    <qualified-type-def type-id='type-id-518' const='yes' hash='54527153392add81' id='type-id-532'/>
    <pointer-type-def type-id='type-id-532' size-in-bits='64' hash='28a40e73aff8f5ea' id='type-id-533'/>
    <qualified-type-def type-id='type-id-519' const='yes' hash='6329185c1bf5479b' id='type-id-534'/>
    <pointer-type-def type-id='type-id-534' size-in-bits='64' hash='8ff10a39020ad6df' id='type-id-535'/>
    <qualified-type-def type-id='type-id-525' const='yes' hash='db70ebe3579923fe' id='type-id-536'/>
    <pointer-type-def type-id='type-id-536' size-in-bits='64' hash='828bb897f156952b' id='type-id-488'/>
    <qualified-type-def type-id='type-id-61' const='yes' hash='90737b3c9f8ca40d' id='type-id-537'/>
    <pointer-type-def type-id='type-id-537' size-in-bits='64' hash='c28f06d1015cd193' id='type-id-538'/>
    <pointer-type-def type-id='type-id-539' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-514'/>
    <pointer-type-def type-id='type-id-540' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-520'/>
    <pointer-type-def type-id='type-id-541' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-523'/>
    <pointer-type-def type-id='type-id-542' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-526'/>
    <pointer-type-def type-id='type-id-473' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-524'/>
    <pointer-type-def type-id='type-id-500' size-in-bits='64' hash='925ad1338878bb49' id='type-id-543'/>
    <pointer-type-def type-id='type-id-544' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-513'/>
    <pointer-type-def type-id='type-id-545' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-522'/>
    <pointer-type-def type-id='type-id-546' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-521'/>
    <pointer-type-def type-id='type-id-547' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-512'/>
    <function-decl name='skk_nicola_key_event_filter_construct' mangled-name='skk_nicola_key_event_filter_construct' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/nicola.c' line='1776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_nicola_key_event_filter_construct' hash='7ac466369d322eb1'>
      <parameter type-id='type-id-137' name='object_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/nicola.c' line='1776' column='1'/>
      <return type-id='type-id-531'/>
    </function-decl>
    <function-decl name='skk_nicola_key_event_filter_new' mangled-name='skk_nicola_key_event_filter_new' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/nicola.c' line='1787' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_nicola_key_event_filter_new' hash='a4a4b26a092bbc7b'>
      <return type-id='type-id-531'/>
    </function-decl>
    <function-decl name='skk_nicola_key_event_filter_get_type' mangled-name='skk_nicola_key_event_filter_get_type' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/nicola.c' line='2284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='skk_nicola_key_event_filter_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-539'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-167'/>
    </function-type>
    <function-type size-in-bits='64' hash='ac964ef40c753eac' id='type-id-540'>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-530'/>
      <parameter type-id='type-id-187'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' hash='6bcaacf75120d942' id='type-id-541'>
      <parameter type-id='type-id-343'/>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-530'/>
      <parameter type-id='type-id-187'/>
      <return type-id='type-id-23'/>
    </function-type>
    <function-type size-in-bits='64' hash='52c0efb08d2aa513' id='type-id-542'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-309'/>
    </function-type>
    <function-type size-in-bits='64' hash='2911603b4030dcc0' id='type-id-544'>
      <parameter type-id='type-id-71'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-141'/>
    </function-type>
    <function-type size-in-bits='64' hash='e7a9fd9868345a8f' id='type-id-545'>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-141'/>
    </function-type>
    <function-type size-in-bits='64' hash='1a25e8acfe50e042' id='type-id-546'>
      <parameter type-id='type-id-343'/>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-141'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-547'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-141'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='candidate-list.c' comp-dir-path='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk' language='LANG_C11'>
    <function-decl name='gee_abstract_list_get' filepath='/usr/include/gee-0.8/gee.h' line='1508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_abstract_list_get' hash='465ce8bf049aa2c9'>
      <parameter type-id='type-id-326'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gee_collection_clear' filepath='/usr/include/gee-0.8/gee.h' line='1736' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_clear' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-373'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='g_cclosure_marshal_VOID__VOID' filepath='/usr/include/glib-2.0/gobject/gmarshal.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_cclosure_marshal_VOID__VOID' hash='cbc7d8889754444d'>
      <parameter type-id='type-id-452'/>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-343'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-141'/>
    </function-decl>
    <function-decl name='g_param_spec_int' filepath='/usr/include/glib-2.0/gobject/gparamspecs.h' line='1012' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_int' hash='a76d693025079d4b'>
      <parameter type-id='type-id-140'/>
      <parameter type-id='type-id-140'/>
      <parameter type-id='type-id-140'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-323'/>
    </function-decl>
    <function-decl name='g_value_set_int' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_int' hash='2091532fb37e4a85'>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-141'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='context.c' comp-dir-path='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk' language='LANG_C11'>
    <class-decl name='_SkkState' is-struct='yes' visibility='default' size-in-bits='1344' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='187' column='1' hash='caecf517cd7c4d0b' id='type-id-548'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-82' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='handler_type' type-id='type-id-137' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dictionaries' type-id='type-id-377' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='candidates' type-id='type-id-73' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='rom_kana_converter' type-id='type-id-335' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='okuri_rom_kana_converter' type-id='type-id-335' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='okuri' type-id='type-id-167' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='midasi' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='output' type-id='type-id-134' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='abbrev' type-id='type-id-134' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='kuten' type-id='type-id-134' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='completion_iterator' type-id='type-id-98' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='auto_start_henkan_keywords' type-id='type-id-347' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='auto_start_henkan_keywords_length1' type-id='type-id-40' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='_auto_start_henkan_keywords_size_' type-id='type-id-40' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='auto_start_henkan_keyword' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='egg_like_newline' type-id='type-id-167' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='surrounding_text' type-id='type-id-84' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='surrounding_end' type-id='type-id-187' visibility='default' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='207' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='SkkKutenStateHandler' type-id='type-id-434' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='141' column='1' id='type-id-458'/>
    <typedef-decl name='SkkState' type-id='type-id-548' size-in-bits='1344' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='66' column='1' id='type-id-79'/>
    <typedef-decl name='SkkStateHandler' type-id='type-id-441' size-in-bits='256' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='76' column='1' id='type-id-435'/>
    <typedef-decl name='SkkStatePrivate' type-id='type-id-45' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='143' column='1' id='type-id-81'/>
    <typedef-decl name='SkkUnicodeString' type-id='type-id-49' size-in-bits='320' filepath='/usr/src/debug/libskk-1.0.4-18.fc43.x86_64/libskk/context.c' line='152' column='1' id='type-id-83'/>
    <pointer-type-def type-id='type-id-549' size-in-bits='64' id='type-id-550'/>
    <pointer-type-def type-id='type-id-551' size-in-bits='64' id='type-id-552'/>
    <pointer-type-def type-id='type-id-553' size-in-bits='64' id='type-id-554'/>
    <pointer-type-def type-id='type-id-555' size-in-bits='64' id='type-id-556'/>
    <class-decl name='_SkkAbbrevStateHandler' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-557'/>
    <class-decl name='_SkkNoneStateHandler' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-558'/>
    <class-decl name='_SkkSelectStateHandler' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-559'/>
    <class-decl name='_SkkStartStateHandler' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-560'/>
    <function-decl name='gee_bidir_iterator_has_previous' filepath='/usr/include/gee-0.8/gee.h' line='1706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_iterator_has_previous' hash='388da3fa973fde78'>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='gee_collection_remove' filepath='/usr/include/gee-0.8/gee.h' line='1734' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_remove' hash='388da3fa973fde78'>
      <parameter type-id='type-id-373'/>
      <parameter type-id='type-id-422'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='gee_collection_get_is_empty' filepath='/usr/include/gee-0.8/gee.h' line='1766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_get_is_empty' hash='388da3fa973fde78'>
      <parameter type-id='type-id-373'/>
      <return type-id='type-id-167'/>
    </function-decl>
    <function-decl name='gee_deque_peek_head' filepath='/usr/include/gee-0.8/gee.h' line='1809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_deque_peek_head' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-466'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gee_deque_poll_head' filepath='/usr/include/gee-0.8/gee.h' line='1810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_deque_poll_head' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-466'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_strv_length' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strv_length' hash='9589b6fb56513afa'>
