<abi-corpus version='2.4' architecture='elf-amd-x86_64' soname='libgio-2.0.so.0'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libgmodule-2.0.so.0'/>
    <dependency name='libz.so.1'/>
    <dependency name='libmount.so.1'/>
    <dependency name='libselinux.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='g_action_activate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_action_change_state' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_action_get_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_action_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_action_get_parameter_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_action_get_state' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_action_get_state_hint' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='strrchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strstr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='symlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='syscall' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='sysinfo' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ungetc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uselocale' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='usleep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='utimensat' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__lsan_disable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__lsan_enable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__lsan_ignore_object' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_ascii_table' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_utf8_skip' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='in6addr_any' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='in6addr_loopback' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdout' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='../gio/gaction.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_variant_print_string' filepath='../glib/gvariant.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_print_string' hash='e4c35f0b51755a70'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_variant_parse_error_quark' filepath='../glib/gvariant.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_parse_error_quark' hash='2bb88322482ae81c'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gactionmap.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_variant_type_string_is_valid' filepath='../glib/gvarianttype.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_string_is_valid' hash='d731989df7e70156'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' hash='d731989df7e70156' id='type-id-6'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gappinfo.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_environ_unsetenv' filepath='../glib/genviron.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_environ_unsetenv' hash='6daea153d45c7e52'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='g_cclosure_marshal_VOID__VOID' filepath='../gobject/gmarshal.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_cclosure_marshal_VOID__VOID' hash='cbc7d8889754444d'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gapplication.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_get_current_dir' filepath='../glib/gfileutils.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_current_dir' hash='a0e4fd26be68a7ef'>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_main_context_default' filepath='../glib/gmain.h' line='498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_main_context_default' hash='7f32ffea222edbe7'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='g_timeout_add' filepath='../glib/gmain.h' line='934' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_timeout_add' hash='f89c41ccab2bdc0d'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_option_context_new' filepath='../glib/goption.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_context_new' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='g_option_context_set_summary' filepath='../glib/goption.h' line='335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_context_set_summary' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_option_context_set_description' filepath='../glib/goption.h' line='340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_context_set_description' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_option_context_free' filepath='../glib/goption.h' line='345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_context_free' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_option_context_set_help_enabled' filepath='../glib/goption.h' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_context_set_help_enabled' hash='388da3fa973fde78'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_option_context_set_ignore_unknown_options' filepath='../glib/goption.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_context_set_ignore_unknown_options' hash='388da3fa973fde78'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_option_context_parse_strv' filepath='../glib/goption.h' line='373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_context_parse_strv' hash='4e1b6ec35edd21f8'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_option_context_add_group' filepath='../glib/goption.h' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_context_add_group' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_option_context_set_main_group' filepath='../glib/goption.h' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_context_set_main_group' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_option_group_new' filepath='../glib/goption.h' line='399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_group_new' hash='e65775ebdc189351'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='g_option_group_unref' filepath='../glib/goption.h' line='416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_group_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_option_group_add_entries' filepath='../glib/goption.h' line='418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_group_add_entries' hash='9d0d364a9026b1dc'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_option_group_set_translation_domain' filepath='../glib/goption.h' line='426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_group_set_translation_domain' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_slice_copy' filepath='../glib/gslice.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slice_copy' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='g_get_prgname' filepath='../glib/gutils.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_prgname' hash='3f7921bdb568b75e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_variant_new_bytestring_array' filepath='../glib/gvariant.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_bytestring_array' hash='a3534bfbe5d8ea4c'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_variant_builder_new' filepath='../glib/gvariant.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_builder_new' hash='36a10355c5c0bf0c'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='g_variant_builder_unref' filepath='../glib/gvariant.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_builder_unref' hash='36a10355c5c0bf0c'>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_variant_dict_insert_value' filepath='../glib/gvariant.h' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dict_insert_value' hash='371402aec9b52124'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_variant_dict_end' filepath='../glib/gvariant.h' line='570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dict_end' hash='1d11135c4b993cb4'>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_variant_dict_get_type' filepath='../gobject/glib-types.h' line='410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dict_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_signal_new' filepath='../gobject/gsignal.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_new' hash='b3ff5559dba7a929'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-10'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_signal_handler_find' filepath='../gobject/gsignal.h' line='453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_handler_find' hash='62b7f7d4595d3f6a'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='g_signal_accumulator_true_handled' filepath='../gobject/gsignal.h' line='679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_accumulator_true_handled' hash='ba26ecee52f28ef6'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_signal_accumulator_first_wins' filepath='../gobject/gsignal.h' line='685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_accumulator_first_wins' hash='ba26ecee52f28ef6'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-37'>
      <return type-id='type-id-15'/>
    </function-type>
    <function-type size-in-bits='64' hash='ba26ecee52f28ef6' id='type-id-38'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-39'>
      <return type-id='type-id-13'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gapplicationcommandline.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_variant_dup_bytestring' filepath='../glib/gvariant.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dup_bytestring' hash='00e829ff5030f643'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_variant_dup_bytestring_array' filepath='../glib/gvariant.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dup_bytestring_array' hash='c1467cbc3289598c'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gapplicationimpl-dbus.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GDBusActionGroup' is-struct='yes' visibility='default' size-in-bits='576' filepath='../gio/gdbusactiongroup.c' line='41' column='1' hash='a11a178b5b809b33' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-42' visibility='default' filepath='../gio/gdbusactiongroup.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='connection' type-id='type-id-43' visibility='default' filepath='../gio/gdbusactiongroup.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bus_name' type-id='type-id-14' visibility='default' filepath='../gio/gdbusactiongroup.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='object_path' type-id='type-id-14' visibility='default' filepath='../gio/gdbusactiongroup.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='subscription_id' type-id='type-id-10' visibility='default' filepath='../gio/gdbusactiongroup.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='actions' type-id='type-id-44' visibility='default' filepath='../gio/gdbusactiongroup.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='strict' type-id='type-id-3' visibility='default' filepath='../gio/gdbusactiongroup.c' line='65' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_variant_iter_n_children' filepath='../glib/gvariant.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_iter_n_children' hash='610dc91671c67e84'>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gbufferedoutputstream.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gbytesicon.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_bytes_hash' filepath='../glib/gbytes.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_hash' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_bytes_equal' filepath='../glib/gbytes.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_equal' hash='388da3fa973fde78'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_variant_new_from_bytes' filepath='../glib/gvariant.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_from_bytes' hash='388da3fa973fde78'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_bytes_get_type' filepath='../gobject/glib-types.h' line='390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-47'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='type-id-48'>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-10'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gcancellable.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_source_set_dispose_function' filepath='../glib/gmain.h' line='700' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_set_dispose_function' hash='35c280b9ebe7fa1f'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_source_ref' filepath='../glib/gmain.h' line='705' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_ref' hash='75986bd48626a515'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='g_cond_broadcast' filepath='../glib/gthread.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_cond_broadcast' hash='d2c3b7cb56cbe605'>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gcharsetconverter.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_iconv_open' filepath='../glib/gconvert.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_iconv_open' hash='2931cb4d7a0438af'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-decl name='g_iconv' filepath='../glib/gconvert.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_iconv' hash='be78efc5f736fd4c'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='g_iconv_close' filepath='../glib/gconvert.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_iconv_close' hash='388da3fa973fde78'>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-53'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gcontenttype-fdo.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_get_language_names' filepath='../glib/gcharset.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_language_names' hash='db937e60971a127f'>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_steal' filepath='../glib/ghash.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_iter_steal' hash='759a12ea55ad239b'>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_list_last' filepath='../glib/glist.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_last' hash='b832210b99ef58b3'>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='g_utf8_casefold' filepath='../glib/gunicode.h' line='941' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_utf8_casefold' hash='949ac7249a0a08c7'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_utf8_collate_key' filepath='../glib/gunicode.h' line='988' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_utf8_collate_key' hash='949ac7249a0a08c7'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_utf8_make_valid' filepath='../glib/gunicode.h' line='995' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_utf8_make_valid' hash='949ac7249a0a08c7'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_get_user_data_dir' filepath='../glib/gutils.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_user_data_dir' hash='3f7921bdb568b75e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_get_system_data_dirs' filepath='../glib/gutils.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_system_data_dirs' hash='db937e60971a127f'>
      <return type-id='type-id-25'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gcontenttype.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_type_check_instance_is_a' filepath='../gobject/gtype.h' line='2630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_instance_is_a' hash='c163f18f9c9ace88'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gcontextspecificgroup.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_queue_init' filepath='../glib/gqueue.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_init' hash='5f0a15fbed3be6b7'>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_queue_clear' filepath='../glib/gqueue.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_clear' hash='5f0a15fbed3be6b7'>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_queue_is_empty' filepath='../glib/gqueue.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_is_empty' hash='8ee9cbc60d0f1e66'>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_queue_remove' filepath='../glib/gqueue.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_remove' hash='8ee9cbc60d0f1e66'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gconverter.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gcredentials.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='getegid' filepath='/usr/include/unistd.h' line='706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getegid' hash='2bb88322482ae81c'>
      <return type-id='type-id-58'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdatainputstream.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_convert_error_quark' filepath='../glib/gconvert.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_convert_error_quark' hash='2bb88322482ae81c'>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusactiongroup.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_variant_type_copy' filepath='../glib/gvarianttype.h' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_copy' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-59'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusaddress.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GSocketClientPrivate' is-struct='yes' visibility='default' size-in-bits='448' filepath='../gio/gsocketclient.c' line='111' column='1' hash='48345b24be495d52' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='family' type-id='type-id-61' visibility='default' filepath='../gio/gsocketclient.c' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='type' type-id='type-id-62' visibility='default' filepath='../gio/gsocketclient.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='protocol' type-id='type-id-63' visibility='default' filepath='../gio/gsocketclient.c' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='local_address' type-id='type-id-64' visibility='default' filepath='../gio/gsocketclient.c' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='timeout' type-id='type-id-10' visibility='default' filepath='../gio/gsocketclient.c' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='enable_proxy' type-id='type-id-3' visibility='default' filepath='../gio/gsocketclient.c' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='app_proxies' type-id='type-id-44' visibility='default' filepath='../gio/gsocketclient.c' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tls' type-id='type-id-3' visibility='default' filepath='../gio/gsocketclient.c' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tls_validation_flags' type-id='type-id-65' visibility='default' filepath='../gio/gsocketclient.c' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='proxy_resolver' type-id='type-id-66' visibility='default' filepath='../gio/gsocketclient.c' line='122' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_spawn_command_line_sync' filepath='../glib/gspawn.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_spawn_command_line_sync' hash='6b39d47f4e344397'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_string_insert' filepath='../glib/gstring.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_insert' hash='2734f3d2ed09e735'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_uri_unescape_segment' filepath='../glib/guri.h' line='393' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_uri_unescape_segment' hash='393ed0732132e1c5'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='g_get_user_runtime_dir' filepath='../glib/gutils.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_user_runtime_dir' hash='3f7921bdb568b75e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' hash='393ed0732132e1c5' id='type-id-70'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-69'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-71'>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='bc8e5288a2c0a887' id='type-id-72'>
      <parameter type-id='type-id-73'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-74'/>
      <return type-id='type-id-13'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusauth.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GDBusAuthMechanismPrivate' is-struct='yes' visibility='default' size-in-bits='128' filepath='../gio/gdbusauthmechanism.c' line='35' column='1' hash='889ef72ff7a6e128' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stream' type-id='type-id-76' visibility='default' filepath='../gio/gdbusauthmechanism.c' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='credentials' type-id='type-id-77' visibility='default' filepath='../gio/gdbusauthmechanism.c' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GDataInputStreamPrivate' is-struct='yes' visibility='default' size-in-bits='64' filepath='../gio/gdatainputstream.c' line='42' column='1' hash='1e19a82f0ef1953a' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='byte_order' type-id='type-id-79' visibility='default' filepath='../gio/gdatainputstream.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='newline_type' type-id='type-id-80' visibility='default' filepath='../gio/gdatainputstream.c' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GDataOutputStreamPrivate' is-struct='yes' visibility='default' size-in-bits='32' filepath='../gio/gdataoutputstream.c' line='40' column='1' hash='5dd1ad1333fe5ead' id='type-id-81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='byte_order' type-id='type-id-79' visibility='default' filepath='../gio/gdataoutputstream.c' line='41' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_strjoinv' filepath='../glib/gstrfuncs.h' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strjoinv' hash='22584f97846c1445'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_string_set_size' filepath='../glib/gstring.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_set_size' hash='b6029970ace9781b'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusauthmechanismexternal.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_ascii_strtoll' filepath='../glib/gstrfuncs.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ascii_strtoll' hash='388990d2ecc16183'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-82'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusauthmechanismsha1.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_compute_checksum_for_string' filepath='../glib/gchecksum.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_compute_checksum_for_string' hash='6ccd534188630be4'>
      <parameter type-id='type-id-83'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_get_real_time' filepath='../glib/gmain.h' line='834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_real_time' hash='52c0efb08d2aa513'>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='g_usleep' filepath='../glib/gtimer.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_usleep' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_get_home_dir' filepath='../glib/gutils.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_home_dir' hash='3f7921bdb568b75e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusconnection.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_ptr_array_remove_index' filepath='../glib/garray.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_remove_index' hash='c2f4fddf0cb60960'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='g_ptr_array_remove_index_fast' filepath='../glib/garray.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_remove_index_fast' hash='c2f4fddf0cb60960'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='g_ptr_array_remove' filepath='../glib/garray.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_remove' hash='3bddd45464bba36c'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_hash_table_steal_all_keys' filepath='../glib/ghash.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_steal_all_keys' hash='c5e864ee2f1b6438'>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_hash_table_foreach_remove' filepath='../glib/ghash.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_foreach_remove' hash='61a201e3cde13f2f'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-85'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_strjoin' filepath='../glib/gstrfuncs.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strjoin' hash='e43aee0eb551322a'>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_string_prepend_c' filepath='../glib/gstring.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_prepend_c' hash='60fc1437fdf4eff2'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_assertion_message' filepath='../glib/gtestutils.h' line='619' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_assertion_message' hash='98a042068e710221'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_thread_self' filepath='../glib/gthread.h' line='160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_thread_self' hash='33f5698e77fbca29'>
      <return type-id='type-id-88'/>
    </function-decl>
    <function-decl name='g_mutex_trylock' filepath='../glib/gthread.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mutex_trylock' hash='650848c0d7d12292'>
      <parameter type-id='type-id-89'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_error_get_type' filepath='../gobject/glib-types.h' line='398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_value_take_object' filepath='../gobject/gobject.h' line='657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_take_object' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='raise' filepath='/usr/include/signal.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='raise' hash='d628501fd2223339'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-type size-in-bits='64' hash='a5ab6856601c35e6' id='type-id-90'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-92'/>
    </function-type>
    <function-type size-in-bits='64' hash='9138eb3e3c001eb8' id='type-id-93'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-type>
    <function-type size-in-bits='64' hash='8b790ed2ea192d90' id='type-id-94'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-95'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusdaemon.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-97'/>
    <class-decl name='_GDBusServer' is-struct='yes' visibility='default' size-in-bits='1024' filepath='../gio/gdbusserver.c' line='91' column='1' hash='66f3f40c40a3ba9c' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-42' visibility='default' filepath='../gio/gdbusserver.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-99' visibility='default' filepath='../gio/gdbusserver.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='address' type-id='type-id-14' visibility='default' filepath='../gio/gdbusserver.c' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='guid' type-id='type-id-14' visibility='default' filepath='../gio/gdbusserver.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nonce' type-id='type-id-100' visibility='default' filepath='../gio/gdbusserver.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nonce_file' type-id='type-id-14' visibility='default' filepath='../gio/gdbusserver.c' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='client_address' type-id='type-id-14' visibility='default' filepath='../gio/gdbusserver.c' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='unix_socket_path' type-id='type-id-14' visibility='default' filepath='../gio/gdbusserver.c' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='listener' type-id='type-id-101' visibility='default' filepath='../gio/gdbusserver.c' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='is_using_listener' type-id='type-id-3' visibility='default' filepath='../gio/gdbusserver.c' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='run_signal_handler_id' type-id='type-id-35' visibility='default' filepath='../gio/gdbusserver.c' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='main_context_at_construction' type-id='type-id-15' visibility='default' filepath='../gio/gdbusserver.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='active' type-id='type-id-3' visibility='default' filepath='../gio/gdbusserver.c' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='authentication_observer' type-id='type-id-102' visibility='default' filepath='../gio/gdbusserver.c' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__GFreedesktopDBus' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-103'/>
    <function-decl name='g_dir_make_tmp' filepath='../glib/gfileutils.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dir_make_tmp' hash='78659feb0f875243'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_hash_table_get_values_as_ptr_array' filepath='../glib/ghash.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_get_values_as_ptr_array' hash='c5e864ee2f1b6438'>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <typedef-decl name='_GFreedesktopDBus' type-id='type-id-103' filepath='gio/gdbus-daemon-generated.h' line='26' column='1' id='type-id-96'/>
    <function-type size-in-bits='64' hash='7c5458656f64e45b' id='type-id-104'>
      <parameter type-id='type-id-43'/>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-92'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbuserror.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_int_hash' filepath='../glib/ghash.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_int_hash' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusinterface.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_type_name_from_instance' filepath='../gobject/gtype.h' line='2655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_name_from_instance' hash='828efa8f6e345afa'>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusintrospection.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_ptr_array_foreach' filepath='../glib/garray.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_foreach' hash='0f162f59b58c17c1'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_markup_error_quark' filepath='../glib/gmarkup.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_markup_error_quark' hash='2bb88322482ae81c'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_markup_parse_context_end_parse' filepath='../glib/gmarkup.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_markup_parse_context_end_parse' hash='1b2fa29b6bd87bb5'>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_markup_parse_context_get_element_stack' filepath='../glib/gmarkup.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_markup_parse_context_get_element_stack' hash='fdc00e6def4ba780'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='g_markup_parse_context_get_position' filepath='../glib/gmarkup.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_markup_parse_context_get_position' hash='74bde81202a07b45'>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_markup_printf_escaped' filepath='../glib/gmarkup.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_markup_printf_escaped' hash='97139c88969d8147'>
      <parameter type-id='type-id-68'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_markup_collect_attributes' filepath='../glib/gmarkup.h' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_markup_collect_attributes' hash='4f1fe6dabccc02e7'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_slist_free' filepath='../glib/gslist.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_free' hash='ebbf473d6dca81f0'>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_slist_length' filepath='../glib/gslist.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_length' hash='1693892e04bac5ff'>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusmenumodel.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_variant_new_parsed' filepath='../glib/gvariant.h' line='471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_parsed' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusmessage.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_array_sized_new' filepath='../glib/garray.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_sized_new' hash='02dc69fb5b929609'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-111'/>
    </function-decl>
    <function-decl name='g_hash_table_get_keys' filepath='../glib/ghash.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_get_keys' hash='c884abd86095e20d'>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='g_variant_is_signature' filepath='../glib/gvariant.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_is_signature' hash='d731989df7e70156'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_variant_new_variant' filepath='../glib/gvariant.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_variant' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_variant_new_fixed_array' filepath='../glib/gvariant.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_fixed_array' hash='91495cdf6321a116'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_variant_new_dict_entry' filepath='../glib/gvariant.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_dict_entry' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_variant_get_data' filepath='../glib/gvariant.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_data' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='g_variant_type_new' filepath='../glib/gvarianttype.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_new' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_type_is_tuple' filepath='../glib/gvarianttype.h' line='339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_is_tuple' hash='388da3fa973fde78'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_variant_type_is_dict_entry' filepath='../glib/gvarianttype.h' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_is_dict_entry' hash='388da3fa973fde78'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_variant_type_is_variant' filepath='../glib/gvarianttype.h' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_is_variant' hash='388da3fa973fde78'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_variant_type_element' filepath='../glib/gvarianttype.h' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_element' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_variant_type_first' filepath='../glib/gvarianttype.h' line='361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_first' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_variant_type_next' filepath='../glib/gvarianttype.h' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_next' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_variant_type_key' filepath='../glib/gvarianttype.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_key' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_variant_type_value' filepath='../glib/gvarianttype.h' line='369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_value' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_variant_type_string_get_depth_' filepath='../glib/gvarianttype.h' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_string_get_depth_' hash='5ae21ed5468382fc'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusmethodinvocation.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_variant_new_tuple' filepath='../glib/gvariant.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_tuple' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusobjectmanagerclient.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GDBusObjectProxyPrivate' is-struct='yes' visibility='default' size-in-bits='256' filepath='../gio/gdbusobjectproxy.c' line='45' column='1' hash='be80742c6533ae0a' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-114' visibility='default' filepath='../gio/gdbusobjectproxy.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='map_name_to_iface' type-id='type-id-44' visibility='default' filepath='../gio/gdbusobjectproxy.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='object_path' type-id='type-id-14' visibility='default' filepath='../gio/gdbusobjectproxy.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='connection' type-id='type-id-43' visibility='default' filepath='../gio/gdbusobjectproxy.c' line='50' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_hash_table_steal_all_values' filepath='../glib/ghash.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_steal_all_values' hash='c5e864ee2f1b6438'>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusobjectmanagerserver.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_ptr_array_new' filepath='../glib/garray.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_new' hash='c5e864ee2f1b6438'>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusobjectskeleton.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_ptr_array_set_free_func' filepath='../glib/garray.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_set_free_func' hash='0f162f59b58c17c1'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusprivate.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_queue_new' filepath='../glib/gqueue.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_new' hash='5f0a15fbed3be6b7'>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='g_queue_free_full' filepath='../glib/gqueue.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_free_full' hash='4f92c44d2e0d8361'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_queue_get_length' filepath='../glib/gqueue.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_get_length' hash='c2d4fb6b5557b642'>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_thread_new' filepath='../glib/gthread.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_thread_new' hash='f58d67c7118f4ddd'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-88'/>
    </function-decl>
    <function-decl name='g_parse_debug_string' filepath='../glib/gutils.h' line='275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_parse_debug_string' hash='98f3533b4114c91f'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_variant_type_new_tuple' filepath='../glib/gvarianttype.h' line='377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_new_tuple' hash='388da3fa973fde78'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-59'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusproxy.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_ptr_array_free' filepath='../glib/garray.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_free' hash='842ac225838bed66'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-118'/>
    </function-decl>
    <function-decl name='g_ptr_array_sort_values' filepath='../glib/garray.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_sort_values' hash='0f162f59b58c17c1'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusserver.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GUnixSocketAddressPrivate' is-struct='yes' visibility='default' size-in-bits='1024' filepath='../gio/gunixsocketaddress.c' line='74' column='1' hash='5ce212ebdefd9be3' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='path' type-id='type-id-121' visibility='default' filepath='../gio/gunixsocketaddress.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='path_len' type-id='type-id-23' visibility='default' filepath='../gio/gunixsocketaddress.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='address_type' type-id='type-id-122' visibility='default' filepath='../gio/gunixsocketaddress.c' line='80' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdbusutils.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_random_int' filepath='../glib/grand.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_random_int' hash='2bb88322482ae81c'>
      <return type-id='type-id-123'/>
    </function-decl>
    <function-decl name='g_string_new' filepath='../glib/gstring.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_new' hash='9c88f7857a1005cc'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_string_free' filepath='../glib/gstring.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_free' hash='9d1d8d666afba838'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_string_free_and_steal' filepath='../glib/gstring.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_free_and_steal' hash='7b9942aa0c7675a4'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_string_insert_c' filepath='../glib/gstring.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_insert_c' hash='cf108d93e4424c15'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_string_append_printf' filepath='../glib/gstring.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_append_printf' hash='9c88f7857a1005cc'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_variant_is_floating' filepath='../glib/gvariant.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_is_floating' hash='388da3fa973fde78'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_variant_classify' filepath='../glib/gvariant.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_classify' hash='18289293a52fad10'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-124'/>
    </function-decl>
    <function-decl name='g_variant_new_objv' filepath='../glib/gvariant.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_objv' hash='a3534bfbe5d8ea4c'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_variant_dup_objv' filepath='../glib/gvariant.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dup_objv' hash='c1467cbc3289598c'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='g_variant_get_bytestring' filepath='../glib/gvariant.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_bytestring' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_variant_get_normal_form' filepath='../glib/gvariant.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_normal_form' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_variant_new_from_data' filepath='../glib/gvariant.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_from_data' hash='e6d8da382e2fe7c3'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_value_take_boxed' filepath='../gobject/gboxed.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_take_boxed' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_boxed' filepath='../gobject/gboxed.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_boxed' hash='fe8357e11df9e46f'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='g_value_init' filepath='../gobject/gvalue.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_init' hash='d8be554399b10fe2'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_value_set_uchar' filepath='../gobject/gvaluetypes.h' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_uchar' hash='a49debf7d5ddde35'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-125'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_uchar' filepath='../gobject/gvaluetypes.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_uchar' hash='df143114213e6408'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-125'/>
    </function-decl>
    <function-decl name='g_value_set_boolean' filepath='../gobject/gvaluetypes.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_boolean' hash='2091532fb37e4a85'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_boolean' filepath='../gobject/gvaluetypes.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_boolean' hash='d48515f4487a3a65'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_value_set_int' filepath='../gobject/gvaluetypes.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_int' hash='2091532fb37e4a85'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_int' filepath='../gobject/gvaluetypes.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_int' hash='d48515f4487a3a65'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='g_value_set_uint' filepath='../gobject/gvaluetypes.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_uint' hash='fcba35f21ce0bc87'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_uint' filepath='../gobject/gvaluetypes.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_uint' hash='1eda092763b4b34d'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_value_set_int64' filepath='../gobject/gvaluetypes.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_int64' hash='b9bf98018187ae1d'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_int64' filepath='../gobject/gvaluetypes.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_int64' hash='a30ed65382b66e58'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='g_value_set_uint64' filepath='../gobject/gvaluetypes.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_uint64' hash='72278557255e4da3'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-126'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_uint64' filepath='../gobject/gvaluetypes.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_uint64' hash='1a03f2de32aa5984'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='g_value_set_double' filepath='../gobject/gvaluetypes.h' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_double' hash='ddccc094f16b64e0'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-127'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_double' filepath='../gobject/gvaluetypes.h' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_double' hash='dba2db4551c46e02'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-127'/>
    </function-decl>
    <function-decl name='g_value_set_string' filepath='../gobject/gvaluetypes.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_string' hash='6d57be31fbefa0f8'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_string' filepath='../gobject/gvaluetypes.h' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_string' hash='c356c4405f017bde'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_set_variant' filepath='../gobject/gvaluetypes.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_variant' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_dup_variant' filepath='../gobject/gvaluetypes.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_dup_variant' hash='fe8357e11df9e46f'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdebugcontrollerdbus.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_log_set_debug_enabled' filepath='../glib/gmessages.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_log_set_debug_enabled' hash='388da3fa973fde78'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_thread_yield' filepath='../glib/gthread.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_thread_yield' hash='7f32ffea222edbe7'>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdelayedsettingsbackend.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GPermission' is-struct='yes' visibility='default' size-in-bits='256' filepath='../gio/gpermission.h' line='48' column='1' hash='2b82cc27cd4baecf' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-42' visibility='default' filepath='../gio/gpermission.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-129' visibility='default' filepath='../gio/gpermission.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_tree_lookup_extended' filepath='../glib/gtree.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_tree_lookup_extended' hash='cdadaf8beea904f1'>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdesktopappinfo.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <typedef-decl name='GFileMonitorCallback' type-id='type-id-131' size-in-bits='64' filepath='../gio/glocalfilemonitor.h' line='81' column='1' hash='fd7a63c0c6c822c4' id='type-id-132'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-131'/>
    <function-decl name='g_ptr_array_steal' filepath='../glib/garray.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_steal' hash='0780a089a581f14c'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-118'/>
    </function-decl>
    <function-decl name='g_ptr_array_new_full' filepath='../glib/garray.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_new_full' hash='a44f9218510d1af1'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_ptr_array_set_size' filepath='../glib/garray.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_set_size' hash='9488051409510324'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_file_read_link' filepath='../glib/gfileutils.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_read_link' hash='78659feb0f875243'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_mkstemp' filepath='../glib/gfileutils.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mkstemp' hash='d820a8cc11584215'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='g_key_file_ref' filepath='../glib/gkeyfile.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-134'/>
    </function-decl>
    <function-decl name='g_key_file_get_start_group' filepath='../glib/gkeyfile.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_get_start_group' hash='a0e4fd26be68a7ef'>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_key_file_has_group' filepath='../glib/gkeyfile.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_has_group' hash='d731989df7e70156'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_key_file_has_key' filepath='../glib/gkeyfile.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_has_key' hash='b113f73245eb2a87'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_key_file_set_string' filepath='../glib/gkeyfile.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_set_string' hash='374a40393f8853c8'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_key_file_get_locale_string' filepath='../glib/gkeyfile.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_get_locale_string' hash='61e7500a206d1762'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_key_file_get_boolean' filepath='../glib/gkeyfile.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_get_boolean' hash='b113f73245eb2a87'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_key_file_set_boolean' filepath='../glib/gkeyfile.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_set_boolean' hash='ad7f630f3bea4615'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_key_file_set_string_list' filepath='../glib/gkeyfile.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_set_string_list' hash='da59fb1687ab25d4'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_key_file_get_locale_string_list' filepath='../glib/gkeyfile.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_get_locale_string_list' hash='392ffe8a4db51a34'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='g_child_watch_add' filepath='../glib/gmain.h' line='962' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_child_watch_add' hash='afc5b0f0bf35731b'>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-136'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_realloc_n' filepath='../glib/gmem.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_realloc_n' hash='91495cdf6321a116'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='g_atomic_ref_count_init' filepath='../glib/grefcount.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_atomic_ref_count_init' hash='b71e60c2b842540b'>
      <parameter type-id='type-id-137'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_shell_quote' filepath='../glib/gshell.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_shell_quote' hash='e43aee0eb551322a'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_shell_parse_argv' filepath='../glib/gshell.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_shell_parse_argv' hash='82d96d35de986b21'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_spawn_error_quark' filepath='../glib/gspawn.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_spawn_error_quark' hash='2bb88322482ae81c'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_spawn_async' filepath='../glib/gspawn.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_spawn_async' hash='dd7a31a89aa41c2f'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-138'/>
      <parameter type-id='type-id-139'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-140'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_spawn_async_with_fds' filepath='../glib/gspawn.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_spawn_async_with_fds' hash='043f318aea0b5813'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-138'/>
      <parameter type-id='type-id-139'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-140'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_ascii_tolower' filepath='../glib/gstrfuncs.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ascii_tolower' hash='56dd342c078f2c0e'>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='g_ascii_strdown' filepath='../glib/gstrfuncs.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ascii_strdown' hash='949ac7249a0a08c7'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_str_tokenize_and_fold' filepath='../glib/gstrfuncs.h' line='382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_str_tokenize_and_fold' hash='21bda52414aa9fa4'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='g_get_system_config_dirs' filepath='../glib/gutils.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_system_config_dirs' hash='db937e60971a127f'>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='g_variant_dict_init' filepath='../glib/gvariant.h' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dict_init' hash='1d11135c4b993cb4'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_variant_dict_lookup' filepath='../glib/gvariant.h' line='544' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dict_lookup' hash='87572e1b15418b6e'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_variant_dict_clear' filepath='../glib/gvariant.h' line='568' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dict_clear' hash='1d11135c4b993cb4'>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-type size-in-bits='64' hash='ec7401e19678d483' id='type-id-133'>
      <parameter type-id='type-id-141'/>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-142'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdocumentportal.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-145'/>
    <class-decl name='_GXdpDocuments' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-146'/>
    <function-decl name='g_filename_from_uri' filepath='../glib/gconvert.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_filename_from_uri' hash='ef0d749ccc66e2df'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <typedef-decl name='GXdpDocuments' type-id='type-id-146' filepath='gio/xdp-dbus.h' line='26' column='1' id='type-id-144'/>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gdummyfile.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gemblem.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gfdonotificationbackend.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GThemedIcon' is-struct='yes' visibility='default' size-in-bits='384' filepath='../gio/gthemedicon.c' line='49' column='1' hash='3ecc800b97c12ee9' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-42' visibility='default' filepath='../gio/gthemedicon.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_names' type-id='type-id-148' visibility='default' filepath='../gio/gthemedicon.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='names' type-id='type-id-148' visibility='default' filepath='../gio/gthemedicon.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='use_default_fallbacks' type-id='type-id-3' visibility='default' filepath='../gio/gthemedicon.c' line='55' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_get_application_name' filepath='../glib/gutils.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_application_name' hash='3f7921bdb568b75e'>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gfile.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <typedef-decl name='GLocalFile' type-id='type-id-149' size-in-bits='256' filepath='../gio/glocalfile.h' line='37' column='1' id='type-id-150'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' hash='6bd61e112b9d803c' id='type-id-151'/>
    <class-decl name='_GLocalFile' is-struct='yes' visibility='default' size-in-bits='256' filepath='../gio/glocalfile.c' line='110' column='1' hash='3bbba14daa569bbc' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-42' visibility='default' filepath='../gio/glocalfile.c' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='filename' type-id='type-id-69' visibility='default' filepath='../gio/glocalfile.c' line='114' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_build_filenamev' filepath='../glib/gfileutils.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_build_filenamev' hash='437921a6c18ce184'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_build_filename_valist' filepath='../glib/gfileutils.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_build_filename_valist' hash='a8b02ce1656c936b'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_unix_open_pipe' filepath='../glib/glib-unix.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unix_open_pipe' hash='b6c9dd8f56617c0e'>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_closure_ref' filepath='../gobject/gclosure.h' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_closure_ref' hash='560a7ae97e6fd4ae'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='g_closure_sink' filepath='../gobject/gclosure.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_closure_sink' hash='485dbe5a902b1524'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_closure_unref' filepath='../gobject/gclosure.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_closure_unref' hash='485dbe5a902b1524'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_closure_set_marshal' filepath='../gobject/gclosure.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_closure_set_marshal' hash='65b29a2e25e3a41f'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_closure_invoke' filepath='../gobject/gclosure.h' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_closure_invoke' hash='cbc7d8889754444d'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_cclosure_marshal_generic' filepath='../gobject/gclosure.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_cclosure_marshal_generic' hash='cbc7d8889754444d'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_object_get_qdata' filepath='../gobject/gobject.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_get_qdata' hash='5b485c2f0e37ac45'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='g_object_replace_qdata' filepath='../gobject/gobject.h' line='586' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_replace_qdata' hash='b27da1044d1d9119'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-155'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_value_set_object' filepath='../gobject/gobject.h' line='636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_object' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_unset' filepath='../gobject/gvalue.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_unset' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='splice' filepath='/usr/include/bits/fcntl-linux.h' line='414' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='splice' hash='2e759afd3423327b'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-159'/>
    </function-decl>
    <function-decl name='copy_file_range' filepath='/usr/include/unistd.h' line='1142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='copy_file_range' hash='2e759afd3423327b'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-160'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gfileattribute.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gfileicon.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GFileInputStream' is-struct='yes' visibility='default' size-in-bits='320' filepath='../gio/gfileinputstream.h' line='44' column='1' hash='20916050f763a0f4' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-162' visibility='default' filepath='../gio/gfileinputstream.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-163' visibility='default' filepath='../gio/gfileinputstream.h' line='49' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gfileinfo.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_array_sort' filepath='../glib/garray.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_sort' hash='ec840c511a4000f1'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_date_time_unref' filepath='../glib/gdatetime.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_date_time_new_from_unix_utc' filepath='../glib/gdatetime.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_from_unix_utc' hash='52c0efb08d2aa513'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-164'/>
    </function-decl>
    <function-decl name='g_date_time_new_from_iso8601' filepath='../glib/gdatetime.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_from_iso8601' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-164'/>
    </function-decl>
    <function-decl name='g_date_time_add' filepath='../glib/gdatetime.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_add' hash='52c0efb08d2aa513'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-166'/>
      <return type-id='type-id-164'/>
    </function-decl>
    <function-decl name='g_date_time_get_microsecond' filepath='../glib/gdatetime.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_microsecond' hash='388da3fa973fde78'>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='g_date_time_to_unix' filepath='../glib/gdatetime.h' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_to_unix' hash='52c0efb08d2aa513'>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='g_time_zone_new_local' filepath='../glib/gtimezone.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_time_zone_new_local' hash='7f32ffea222edbe7'>
      <return type-id='type-id-165'/>
    </function-decl>
    <function-decl name='g_time_zone_unref' filepath='../glib/gtimezone.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_time_zone_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gfilenamecompleter.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <var-decl name='g_utf8_skip' type-id='type-id-167' visibility='default' filepath='../glib/gunicode.h' line='807' column='1' elf-symbol-id='g_utf8_skip'/>
    <function-decl name='g_utf8_get_char' filepath='../glib/gunicode.h' line='828' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_utf8_get_char' hash='d231a90e2f39449c'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-168'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/ghttpproxy.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_base64_encode' filepath='../glib/gbase64.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_base64_encode' hash='d9e29c277cfaf3f6'>
      <parameter type-id='type-id-169'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gicon.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GEmblemedIconPrivate' is-struct='yes' visibility='default' size-in-bits='128' filepath='../gio/gemblemedicon.c' line='51' column='1' hash='4e72d94b6bbe326f' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='icon' type-id='type-id-171' visibility='default' filepath='../gio/gemblemedicon.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='emblems' type-id='type-id-55' visibility='default' filepath='../gio/gemblemedicon.c' line='53' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_variant_get_strv' filepath='../glib/gvariant.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_strv' hash='2e3e0e880fe5d96e'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='g_variant_get_data_as_bytes' filepath='../glib/gvariant.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_data_as_bytes' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='g_enum_get_value_by_nick' filepath='../gobject/genums.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_enum_get_value_by_nick' hash='931966e9772e61f5'>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-173'/>
    </function-decl>
    <function-decl name='g_type_from_name' filepath='../gobject/gtype.h' line='747' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_from_name' hash='5ae21ed5468382fc'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/ginetaddress.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <qualified-type-def type-id='type-id-174' const='yes' hash='9ec79b905bc92d3c' id='type-id-175'/>
    <function-decl name='__inet_ntop_alias' mangled-name='inet_ntop' filepath='/usr/include/bits/inet-fortified-decl.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inet_ntop' hash='3d19e4eca7de79f0'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-176'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='__inet_pton_alias' mangled-name='inet_pton' filepath='/usr/include/bits/inet-fortified-decl.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inet_pton' hash='e4623ae51caf7651'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <var-decl name='in6addr_any' type-id='type-id-175' visibility='default' filepath='/usr/include/netinet/in.h' line='239' column='1' elf-symbol-id='in6addr_any'/>
    <var-decl name='in6addr_loopback' type-id='type-id-175' visibility='default' filepath='/usr/include/netinet/in.h' line='240' column='1' elf-symbol-id='in6addr_loopback'/>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/ginetsocketaddress.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_string_prepend' filepath='../glib/gstring.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_prepend' hash='1b1b6ef97adf94be'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gioerror.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_file_error_from_errno' filepath='../glib/gfileutils.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_error_from_errno' hash='08a35e70420bc673'>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-178'/>
    </function-decl>
    <function-decl name='g_log' filepath='../glib/gmessages.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_log' hash='cf52f5f30d546882'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-179'/>
      <parameter type-id='type-id-5'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_quark_from_static_string' filepath='../glib/gquark.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_quark_from_static_string' hash='d231a90e2f39449c'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/giomodule.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_module_supported' filepath='../gmodule/gmodule.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_module_supported' hash='388da3fa973fde78'>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_module_open_full' filepath='../gmodule/gmodule.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_module_open_full' hash='0719c958701cd539'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-181'/>
    </function-decl>
    <function-decl name='g_module_close' filepath='../gmodule/gmodule.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_module_close' hash='388da3fa973fde78'>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_module_error' filepath='../gmodule/gmodule.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_module_error' hash='3f7921bdb568b75e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_module_symbol' filepath='../gmodule/gmodule.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_module_symbol' hash='a9ba7ce9462c712a'>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_type_module_get_type' filepath='../gobject/gtypemodule.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_module_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_type_module_use' filepath='../gobject/gtypemodule.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_module_use' hash='17fa0e4845d97be6'>
      <parameter type-id='type-id-182'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_type_module_unuse' filepath='../gobject/gtypemodule.h' line='269' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_module_unuse' hash='61b908fd37f83c4b'>
      <parameter type-id='type-id-182'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-183'>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-13'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/giounix-private.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='epoll_create1' filepath='/usr/include/sys/epoll.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='epoll_create1' hash='d628501fd2223339'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='epoll_ctl' filepath='/usr/include/sys/epoll.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='epoll_ctl' hash='d66ccc8a0bcb2bfc'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-184'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gkeyfilesettingsbackend.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_checksum_get_digest' filepath='../glib/gchecksum.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_get_digest' hash='c30771daac64eaa3'>
      <parameter type-id='type-id-185'/>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_key_file_load_from_data' filepath='../glib/gkeyfile.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_load_from_data' hash='50be1174bf8d3b3c'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_key_file_get_groups' filepath='../glib/gkeyfile.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_get_groups' hash='c1467cbc3289598c'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='g_key_file_get_value' filepath='../glib/gkeyfile.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_get_value' hash='f115b873d35da554'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_key_file_set_value' filepath='../glib/gkeyfile.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_set_value' hash='374a40393f8853c8'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_key_file_remove_group' filepath='../glib/gkeyfile.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_remove_group' hash='9e4ebdcf41c3fc05'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gliststore.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_sequence_get_end_iter' filepath='../glib/gsequence.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_sequence_get_end_iter' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-188'/>
      <return type-id='type-id-189'/>
    </function-decl>
    <function-decl name='g_sequence_append' filepath='../glib/gsequence.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_sequence_append' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-188'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-189'/>
    </function-decl>
    <function-decl name='g_sequence_iter_next' filepath='../glib/gsequence.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_sequence_iter_next' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-189'/>
    </function-decl>
    <function-decl name='g_sequence_iter_prev' filepath='../glib/gsequence.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_sequence_iter_prev' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-189'/>
    </function-decl>
    <function-decl name='g_sequence_iter_get_position' filepath='../glib/gsequence.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_sequence_iter_get_position' hash='388da3fa973fde78'>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='g_sequence_iter_move' filepath='../glib/gsequence.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_sequence_iter_move' hash='388da3fa973fde78'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-189'/>
    </function-decl>
    <function-decl name='g_param_spec_gtype' filepath='../gobject/gparamspecs.h' line='1134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_gtype' hash='6d0441d7d6a9df59'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-191'/>
    </function-decl>
    <function-decl name='g_value_set_gtype' filepath='../gobject/gvaluetypes.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_gtype' hash='72278557255e4da3'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_gtype' filepath='../gobject/gvaluetypes.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_gtype' hash='1a03f2de32aa5984'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/glocalfile.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-192'/>
    <function-decl name='g_convert' filepath='../glib/gconvert.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_convert' hash='4e9257d98cd2fa44'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_get_filename_charsets' filepath='../glib/gconvert.h' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_filename_charsets' hash='ac17b442d17d2a6f'>
      <parameter type-id='type-id-193'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_time_new_now_local' filepath='../glib/gdatetime.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_now_local' hash='7f32ffea222edbe7'>
      <return type-id='type-id-164'/>
    </function-decl>
    <function-decl name='g_date_time_format' filepath='../glib/gdatetime.h' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_format' hash='e43aee0eb551322a'>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_path_skip_root' filepath='../glib/gfileutils.h' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_path_skip_root' hash='2931cb4d7a0438af'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_canonicalize_filename' filepath='../glib/gfileutils.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_canonicalize_filename' hash='58a789ef00ad4f55'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_type_default_interface_peek' filepath='../gobject/gtype.h' line='785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_default_interface_peek' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='__openat_alias' mangled-name='openat64' filepath='/usr/include/bits/fcntl2.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openat64' hash='54d4a9aa53d4bded'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-87'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='fdopendir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fdopendir' hash='388da3fa973fde78'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-194'/>
    </function-decl>
    <function-decl name='statfs' mangled-name='statfs64' filepath='/usr/include/sys/statfs.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='statfs64' hash='3aef3aa4b3baa20d'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-195'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='faccessat' filepath='/usr/include/unistd.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='faccessat' hash='6d9036587be9cce7'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/glocalfileinfo.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_checksum_get_string' filepath='../glib/gchecksum.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_get_string' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-185'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_filename_display_basename' filepath='../glib/gconvert.h' line='172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_filename_display_basename' hash='e43aee0eb551322a'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_remove' filepath='../glib/ghash.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_iter_remove' hash='759a12ea55ad239b'>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_utf8_validate_len' filepath='../glib/gunicode.h' line='930' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_utf8_validate_len' hash='76909a2130ba5b3c'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_get_user_cache_dir' filepath='../glib/gutils.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_user_cache_dir' hash='3f7921bdb568b75e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_get_user_special_dir' filepath='../glib/gutils.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_user_special_dir' hash='ee5b9e45921aa4af'>
      <parameter type-id='type-id-196'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='getgrgid_r' filepath='/usr/include/grp.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getgrgid_r' hash='b11a34a2e9609dfc'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-197'/>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-199'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='is_selinux_enabled' filepath='/usr/include/selinux/selinux.h' line='14' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_selinux_enabled' hash='388da3fa973fde78'>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='freecon' filepath='/usr/include/selinux/selinux.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='freecon' hash='02a096d257a5e00d'>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='getfilecon_raw' filepath='/usr/include/selinux/selinux.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getfilecon_raw' hash='49ba10033ab23189'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='lgetfilecon_raw' filepath='/usr/include/selinux/selinux.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lgetfilecon_raw' hash='49ba10033ab23189'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='fgetfilecon_raw' filepath='/usr/include/selinux/selinux.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fgetfilecon_raw' hash='98c8271a447e5c5c'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='setfilecon_raw' filepath='/usr/include/selinux/selinux.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setfilecon_raw' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='lchmod' filepath='/usr/include/sys/stat.h' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lchmod' hash='7632efc1596daaa3'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='utimensat' filepath='/usr/include/sys/stat.h' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='utimensat' hash='38088643f63af91e'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='setxattr' filepath='/usr/include/sys/xattr.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setxattr' hash='6e23d2dad9b93aeb'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-176'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='getxattr' filepath='/usr/include/sys/xattr.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getxattr' hash='4096d0998fb5a435'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-176'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='lgetxattr' filepath='/usr/include/sys/xattr.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lgetxattr' hash='4096d0998fb5a435'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-176'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='fgetxattr' filepath='/usr/include/sys/xattr.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fgetxattr' hash='af144bf9a14e9d98'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-176'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='listxattr' filepath='/usr/include/sys/xattr.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='listxattr' hash='c7ec0fa0257f58ec'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='llistxattr' filepath='/usr/include/sys/xattr.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='llistxattr' hash='c7ec0fa0257f58ec'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='flistxattr' filepath='/usr/include/sys/xattr.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='flistxattr' hash='2b1a3f7a62191a73'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='removexattr' filepath='/usr/include/sys/xattr.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='removexattr' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='chown' filepath='/usr/include/unistd.h' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chown' hash='37db1e76c98a7dbc'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='lchown' filepath='/usr/include/unistd.h' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lchown' hash='37db1e76c98a7dbc'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/glocalfileiostream.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GLocalFileInputStream' is-struct='yes' visibility='default' size-in-bits='384' filepath='../gio/glocalfileinputstream.h' line='41' column='1' hash='0af34c50fa9f9aa4' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-204' visibility='default' filepath='../gio/glocalfileinputstream.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priv' type-id='type-id-205' visibility='default' filepath='../gio/glocalfileinputstream.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GLocalFileInputStream' type-id='type-id-203' size-in-bits='384' filepath='../gio/glocalfileinputstream.h' line='37' column='1' id='type-id-206'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' hash='a984bdcc687a1eb3' id='type-id-207'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-205'/>
    <class-decl name='_GLocalFileInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-209'/>
    <typedef-decl name='GLocalFileInputStreamPrivate' type-id='type-id-209' filepath='../gio/glocalfileinputstream.h' line='39' column='1' id='type-id-208'/>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/glocalfilemonitor.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_sequence_sort_changed' filepath='../glib/gsequence.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_sequence_sort_changed' hash='5695f5ce05a4c55f'>
      <parameter type-id='type-id-189'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/glocalfileoutputstream.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_mkstemp_full' filepath='../glib/gfileutils.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mkstemp_full' hash='037066e9e63e7a7d'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='fchown' filepath='/usr/include/unistd.h' line='498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchown' hash='2ea9e5686db6170b'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='link' filepath='/usr/include/unistd.h' line='819' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='link' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/glocalvfs.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_unix_get_passwd_entry' filepath='../glib/glib-unix.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unix_get_passwd_entry' hash='aef4957d46c13176'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='g_ascii_strncasecmp' filepath='../glib/gstrfuncs.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ascii_strncasecmp' hash='26a1a614d66403fd'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-53'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gmarshal-internal.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_boxed_copy' filepath='../gobject/gboxed.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_boxed_copy' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='g_boxed_free' filepath='../gobject/gboxed.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_boxed_free' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gmemorymonitorbase.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='sysinfo' filepath='/usr/include/sys/sysinfo.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sysinfo' hash='312ed8e68bbc05a1'>
      <parameter type-id='type-id-212'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gmemorymonitorpoll.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_param_spec_double' filepath='../gobject/gparamspecs.h' line='1088' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_double' hash='e308860955abd5ef'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-191'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gmemoryoutputstream.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_param_spec_ulong' filepath='../gobject/gparamspecs.h' line='1036' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_ulong' hash='7693ee3149b0fcc1'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-191'/>
    </function-decl>
    <function-decl name='g_value_set_ulong' filepath='../gobject/gvaluetypes.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_ulong' hash='72278557255e4da3'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_ulong' filepath='../gobject/gvaluetypes.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_ulong' hash='1a03f2de32aa5984'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-35'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gmenu.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_variant_check_format_string' filepath='../glib/gvariant.h' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_check_format_string' hash='fd10421ff30a0411'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gmenumodel.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gmount.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_object_set_data_full' filepath='../gobject/gobject.h' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_set_data_full' hash='31e84a64329ff553'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gmountoperation.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_idle_add_full' filepath='../glib/gmain.h' line='969' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_idle_add_full' hash='d5a703c3eedcd6b7'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_array_get_type' filepath='../gobject/glib-types.h' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gnetworkaddress.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GResolverPrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='../gio/gresolver.c' line='82' column='1' hash='f7b64055c4aff0f0' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='timeout_ms' type-id='type-id-158' visibility='default' filepath='../gio/gresolver.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mutex' type-id='type-id-114' visibility='default' filepath='../gio/gresolver.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='resolv_conf_timestamp' type-id='type-id-214' visibility='default' filepath='../gio/gresolver.c' line='87' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_list_concat' filepath='../glib/glist.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_concat' hash='56d000fabe52c38f'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-55'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gnetworking.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='getservbyname_r' filepath='/usr/include/netdb.h' line='310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getservbyname_r' hash='619bb6029b23b8e3'>
      <parameter type-id='type-id-215'/>
      <parameter type-id='type-id-215'/>
      <parameter type-id='type-id-216'/>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gnetworkmonitorbase.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_main_current_source' filepath='../glib/gmain.h' line='570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_main_current_source' hash='09b40bdb5c9eca2e'>
      <return type-id='type-id-49'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gnetworkmonitornetlink.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GNetworkMonitorBasePrivate' is-struct='yes' visibility='default' size-in-bits='384' filepath='../gio/gnetworkmonitorbase.c' line='48' column='1' hash='c92f8b722330281a' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='networks' type-id='type-id-44' visibility='default' filepath='../gio/gnetworkmonitorbase.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='have_ipv4_default_route' type-id='type-id-3' visibility='default' filepath='../gio/gnetworkmonitorbase.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='have_ipv6_default_route' type-id='type-id-3' visibility='default' filepath='../gio/gnetworkmonitorbase.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='is_available' type-id='type-id-3' visibility='default' filepath='../gio/gnetworkmonitorbase.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='context' type-id='type-id-15' visibility='default' filepath='../gio/gnetworkmonitorbase.c' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='network_changed_source' type-id='type-id-49' visibility='default' filepath='../gio/gnetworkmonitorbase.c' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='initializing' type-id='type-id-3' visibility='default' filepath='../gio/gnetworkmonitorbase.c' line='57' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='bind' filepath='/usr/include/sys/socket.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bind' hash='87b255596f349675'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gnetworkmonitorportal.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GNetworkAddressPrivate' is-struct='yes' visibility='default' size-in-bits='320' filepath='../gio/gnetworkaddress.c' line='63' column='1' hash='f2d44f77706c5e96' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hostname' type-id='type-id-14' visibility='default' filepath='../gio/gnetworkaddress.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port' type-id='type-id-221' visibility='default' filepath='../gio/gnetworkaddress.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cached_sockaddrs' type-id='type-id-55' visibility='default' filepath='../gio/gnetworkaddress.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scheme' type-id='type-id-14' visibility='default' filepath='../gio/gnetworkaddress.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='resolver_serial' type-id='type-id-82' visibility='default' filepath='../gio/gnetworkaddress.c' line='69' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gnetworkservice.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GSrvTarget' is-struct='yes' visibility='default' size-in-bits='128' filepath='../gio/gsrvtarget.c' line='54' column='1' hash='fbe4c631dad38819' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hostname' type-id='type-id-14' visibility='default' filepath='../gio/gsrvtarget.c' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='port' type-id='type-id-221' visibility='default' filepath='../gio/gsrvtarget.c' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='priority' type-id='type-id-221' visibility='default' filepath='../gio/gsrvtarget.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='weight' type-id='type-id-221' visibility='default' filepath='../gio/gsrvtarget.c' line='59' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gnotification.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gopenuriportal.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' id='type-id-224'/>
    <class-decl name='_GXdpOpenURI' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-225'/>
    <function-decl name='g_free_sized' filepath='../glib/gmem.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_free_sized' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <typedef-decl name='GXdpOpenURI' type-id='type-id-225' filepath='gio/xdp-dbus.h' line='567' column='1' id='type-id-223'/>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gportalsupport.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <enum-decl name='GSandboxType' naming-typedef-id='type-id-226' size-in-bits='32' alignment-in-bits='32' filepath='../gio/gsandbox.h' line='37' column='1' hash='a821e8ee2d13b88e' id='type-id-227'>
      <underlying-type type-id='type-id-228'/>
      <enumerator name='G_SANDBOX_TYPE_UNKNOWN' value='0'/>
      <enumerator name='G_SANDBOX_TYPE_FLATPAK' value='1'/>
      <enumerator name='G_SANDBOX_TYPE_SNAP' value='2'/>
    </enum-decl>
    <typedef-decl name='GSandboxType' type-id='type-id-227' size-in-bits='32' alignment-in-bits='32' filepath='../gio/gsandbox.h' line='41' column='1' hash='a821e8ee2d13b88e' id='type-id-226'/>
    <function-decl name='g_key_file_load_from_file' filepath='../glib/gkeyfile.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_load_from_file' hash='316b78cf828b4eeb'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_spawn_sync' filepath='../glib/gspawn.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_spawn_sync' hash='c5a983c15ada329f'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-138'/>
      <parameter type-id='type-id-139'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gpropertyaction.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_type_fundamental' filepath='../gobject/gtype.h' line='2597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_fundamental' hash='91495cdf6321a116'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gproxy.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GIOExtension' is-struct='yes' visibility='default' size-in-bits='192' filepath='../gio/giomodule.c' line='264' column='1' hash='ac9aa33ee1b7640d' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-69' visibility='default' filepath='../gio/giomodule.c' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-30' visibility='default' filepath='../gio/giomodule.c' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='priority' type-id='type-id-53' visibility='default' filepath='../gio/giomodule.c' line='267' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GIOExtensionPoint' is-struct='yes' visibility='default' size-in-bits='256' filepath='../gio/giomodule.c' line='270' column='1' hash='82f7a0298b6d8988' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='required_type' type-id='type-id-30' visibility='default' filepath='../gio/giomodule.c' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-69' visibility='default' filepath='../gio/giomodule.c' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='extensions' type-id='type-id-55' visibility='default' filepath='../gio/giomodule.c' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lazy_load_modules' type-id='type-id-55' visibility='default' filepath='../gio/giomodule.c' line='274' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gproxyaddressenumerator.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_uri_split_with_user' filepath='../glib/guri.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_uri_split_with_user' hash='dfc5a236ee5b5ac1'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gproxyresolver.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_uri_is_valid' filepath='../glib/guri.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_uri_is_valid' hash='2ca0c52f2bd0b372'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gproxyresolverportal.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-233'/>
    <class-decl name='_GXdpProxyResolver' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-234'/>
    <typedef-decl name='GXdpProxyResolver' type-id='type-id-234' filepath='gio/xdp-dbus.h' line='829' column='1' id='type-id-232'/>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gresolver.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_hostname_is_non_ascii' filepath='../glib/ghostutils.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hostname_is_non_ascii' hash='d731989df7e70156'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='inet_aton' filepath='/usr/include/arpa/inet.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inet_aton' hash='d75579a00c5bce92'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-235'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gresource.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GZlibDecompressor' is-struct='yes' visibility='default' size-in-bits='1216' filepath='../gio/gzlibdecompressor.c' line='59' column='1' hash='8c2a8fbb2fac4156' id='type-id-236'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-42' visibility='default' filepath='../gio/gzlibdecompressor.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='format' type-id='type-id-237' visibility='default' filepath='../gio/gzlibdecompressor.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zstream' type-id='type-id-238' visibility='default' filepath='../gio/gzlibdecompressor.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='header_data' type-id='type-id-239' visibility='default' filepath='../gio/gzlibdecompressor.c' line='65' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_bytes_new' filepath='../glib/gbytes.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_new' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-46'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gresourcefile.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsandbox.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_file_test' filepath='../glib/gfileutils.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_test' hash='513f18dc0e7fed52'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-240'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsettings-mapping.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_flags_get_value_by_nick' filepath='../gobject/genums.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_flags_get_value_by_nick' hash='83922b83e0b9d423'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-242'/>
    </function-decl>
    <function-decl name='g_type_check_value_holds' filepath='../gobject/gtype.h' line='2646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_value_holds' hash='26083f2199cfb26d'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_value_set_schar' filepath='../gobject/gvaluetypes.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_schar' hash='43e74e789d7b93ad'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_value_get_schar' filepath='../gobject/gvaluetypes.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_schar' hash='6c090601708a3857'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-243'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsettings.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GDelayedSettingsBackendPrivate' is-struct='yes' visibility='default' size-in-bits='320' filepath='../gio/gdelayedsettingsbackend.c' line='30' column='1' hash='125940912ec858bc' id='type-id-244'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='backend' type-id='type-id-245' visibility='default' filepath='../gio/gdelayedsettingsbackend.c' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lock' type-id='type-id-114' visibility='default' filepath='../gio/gdelayedsettingsbackend.c' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='delayed' type-id='type-id-130' visibility='default' filepath='../gio/gdelayedsettingsbackend.c' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='owner_context' type-id='type-id-15' visibility='default' filepath='../gio/gdelayedsettingsbackend.c' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='owner' type-id='type-id-12' visibility='default' filepath='../gio/gdelayedsettingsbackend.c' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSettingsSchemaSource' is-struct='yes' visibility='default' size-in-bits='320' filepath='../gio/gsettingsschema.c' line='184' column='1' hash='47c8ae54a40f64e0' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='type-id-247' visibility='default' filepath='../gio/gsettingsschema.c' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='directory' type-id='type-id-14' visibility='default' filepath='../gio/gsettingsschema.c' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='table' type-id='type-id-248' visibility='default' filepath='../gio/gsettingsschema.c' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='text_tables' type-id='type-id-249' visibility='default' filepath='../gio/gsettingsschema.c' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ref_count' type-id='type-id-53' visibility='default' filepath='../gio/gsettingsschema.c' line='191' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_variant_dup_string' filepath='../glib/gvariant.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dup_string' hash='00e829ff5030f643'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_value_get_type' filepath='../gobject/gboxed.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_object_set_qdata' filepath='../gobject/gobject.h' line='568' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_set_qdata' hash='5b485c2f0e37ac45'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_signal_handler_is_connected' filepath='../gobject/gsignal.h' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_handler_is_connected' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsettingsbackend.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_object_weak_unref' filepath='../gobject/gobject.h' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_weak_unref' hash='15371e00e40a3f79'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-250'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsettingsschema.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_regex_new' filepath='../glib/gregex.h' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_regex_new' hash='c094bd5861cd89d8'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-251'/>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-253'/>
    </function-decl>
    <function-decl name='g_regex_split' filepath='../glib/gregex.h' line='523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_regex_split' hash='9dba362a55be271a'>
      <parameter type-id='type-id-254'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-252'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='g_regex_replace_literal' filepath='../glib/gregex.h' line='545' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_regex_replace_literal' hash='143aece910b33897'>
      <parameter type-id='type-id-254'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_variant_is_container' filepath='../glib/gvariant.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_is_container' hash='388da3fa973fde78'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_variant_new_array' filepath='../glib/gvariant.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_array' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-255'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_variant_lookup_value' filepath='../glib/gvariant.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_lookup_value' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_variant_get_fixed_array' filepath='../glib/gvariant.h' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_fixed_array' hash='2b4b47e2dfa95f1d'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='g_variant_iter_new' filepath='../glib/gvariant.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_iter_new' hash='a7d3612404a81fbe'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='g_variant_compare' filepath='../glib/gvariant.h' line='482' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_compare' hash='388da3fa973fde78'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='freelocale' filepath='/usr/include/locale.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='freelocale' hash='57fde9cd2efb571f'>
      <parameter type-id='type-id-256'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-257'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-53'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsimpleasyncresult.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GIOSchedulerJob' is-struct='yes' visibility='default' size-in-bits='512' filepath='../gio/gioscheduler.c' line='29' column='1' hash='fc95be0e3492ed98' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='active_link' type-id='type-id-55' visibility='default' filepath='../gio/gioscheduler.c' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='task' type-id='type-id-73' visibility='default' filepath='../gio/gioscheduler.c' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='job_func' type-id='type-id-259' visibility='default' filepath='../gio/gioscheduler.c' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='data' type-id='type-id-12' visibility='default' filepath='../gio/gioscheduler.c' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='destroy_notify' type-id='type-id-21' visibility='default' filepath='../gio/gioscheduler.c' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cancellable' type-id='type-id-74' visibility='default' filepath='../gio/gioscheduler.c' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cancellable_id' type-id='type-id-35' visibility='default' filepath='../gio/gioscheduler.c' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='context' type-id='type-id-15' visibility='default' filepath='../gio/gioscheduler.c' line='39' column='1'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='64' hash='73805a4e77b8ff13' id='type-id-260'>
      <parameter type-id='type-id-261'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsimpleproxyresolver.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_array_new' filepath='../glib/garray.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_new' hash='85342590edca6c7d'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-111'/>
    </function-decl>
    <function-decl name='g_array_free' filepath='../glib/garray.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_free' hash='9c71f9f61c11a46a'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_array_append_vals' filepath='../glib/garray.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_append_vals' hash='ed37041a4b02081a'>
      <parameter type-id='type-id-111'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-111'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsocket.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_bytes_new_from_bytes' filepath='../glib/gbytes.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_new_from_bytes' hash='91495cdf6321a116'>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='g_source_get_ready_time' filepath='../glib/gmain.h' line='761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_get_ready_time' hash='af8d0f658b9eadbb'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='g_source_remove_unix_fd' filepath='../glib/gmain.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_remove_unix_fd' hash='09b40bdb5c9eca2e'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_poll' filepath='../glib/gpoll.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_poll' hash='a781c32b2dac265e'>
      <parameter type-id='type-id-262'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='g_io_condition_get_type' filepath='../gobject/glib-types.h' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_condition_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='__recv_alias' mangled-name='recv' filepath='/usr/include/bits/socket2.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='recv' hash='5f976df3c3f79d18'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-176'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='if_nametoindex' filepath='/usr/include/net/if.h' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='if_nametoindex' hash='ec91193723d6e288'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='getsockname' filepath='/usr/include/sys/socket.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getsockname' hash='07cad36a24080d52'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-264'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='connect' filepath='/usr/include/sys/socket.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='connect' hash='87b255596f349675'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='getpeername' filepath='/usr/include/sys/socket.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpeername' hash='07cad36a24080d52'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-264'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='send' filepath='/usr/include/sys/socket.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='send' hash='5f976df3c3f79d18'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-176'/>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='sendmmsg' filepath='/usr/include/sys/socket.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sendmmsg' hash='09cb90ef10c3d5e0'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-265'/>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='recvmsg' filepath='/usr/include/sys/socket.h' line='216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='recvmsg' hash='ce283f5d5f1e25e2'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-266'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='recvmmsg' filepath='/usr/include/sys/socket.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='recvmmsg' hash='2737cffd7ab01e48'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-265'/>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-267'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='getsockopt' filepath='/usr/include/sys/socket.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getsockopt' hash='7a4ce5788f663ac4'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-268'/>
      <parameter type-id='type-id-264'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='listen' filepath='/usr/include/sys/socket.h' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='listen' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='accept' filepath='/usr/include/sys/socket.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='accept' hash='07cad36a24080d52'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-264'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='accept4' filepath='/usr/include/sys/socket.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='accept4' hash='39fdc3e3807a5356'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-264'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsocketclient.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-270'/>
    <class-decl name='_GNetworkServicePrivate' is-struct='yes' visibility='default' size-in-bits='320' filepath='../gio/gnetworkservice.c' line='59' column='1' hash='741da1195526f5c9' id='type-id-271'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='service' type-id='type-id-14' visibility='default' filepath='../gio/gnetworkservice.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='protocol' type-id='type-id-14' visibility='default' filepath='../gio/gnetworkservice.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='domain' type-id='type-id-14' visibility='default' filepath='../gio/gnetworkservice.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='scheme' type-id='type-id-14' visibility='default' filepath='../gio/gnetworkservice.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='targets' type-id='type-id-55' visibility='default' filepath='../gio/gnetworkservice.c' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GProxyAddressPrivate' is-struct='yes' visibility='default' size-in-bits='448' filepath='../gio/gproxyaddress.c' line='60' column='1' hash='fee5765e74f0ec32' id='type-id-272'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uri' type-id='type-id-14' visibility='default' filepath='../gio/gproxyaddress.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='protocol' type-id='type-id-14' visibility='default' filepath='../gio/gproxyaddress.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='username' type-id='type-id-14' visibility='default' filepath='../gio/gproxyaddress.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='password' type-id='type-id-14' visibility='default' filepath='../gio/gproxyaddress.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dest_protocol' type-id='type-id-14' visibility='default' filepath='../gio/gproxyaddress.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dest_hostname' type-id='type-id-14' visibility='default' filepath='../gio/gproxyaddress.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dest_port' type-id='type-id-221' visibility='default' filepath='../gio/gproxyaddress.c' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTlsClientConnection' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-273'/>
    <typedef-decl name='GTlsClientConnection' type-id='type-id-273' filepath='../gio/giotypes.h' line='154' column='1' id='type-id-269'/>
    <function-decl name='g_slist_find' filepath='../glib/gslist.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_find' hash='d25cb34cbff9f8c9'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-110'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsocketconnection.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GSocketInputStream' is-struct='yes' visibility='default' size-in-bits='320' filepath='../gio/gsocketinputstream.h' line='49' column='1' hash='3a7fc6bb0eee7e3f' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-162' visibility='default' filepath='../gio/gsocketinputstream.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-275' visibility='default' filepath='../gio/gsocketinputstream.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSocketOutputStream' is-struct='yes' visibility='default' size-in-bits='320' filepath='../gio/gsocketoutputstream.h' line='49' column='1' hash='043bbac681c4a648' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-277' visibility='default' filepath='../gio/gsocketoutputstream.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-278' visibility='default' filepath='../gio/gsocketoutputstream.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GSocketInputStream' type-id='type-id-274' size-in-bits='320' filepath='../gio/gsocketinputstream.h' line='42' column='1' id='type-id-279'/>
    <typedef-decl name='GSocketOutputStream' type-id='type-id-276' size-in-bits='320' filepath='../gio/gsocketoutputstream.h' line='42' column='1' id='type-id-280'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' hash='691cc8af72cf4cbe' id='type-id-281'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' hash='f64b78a1ca3ca891' id='type-id-282'/>
    <pointer-type-def type-id='type-id-283' size-in-bits='64' id='type-id-275'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-278'/>
    <class-decl name='_GSocketInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-285'/>
    <class-decl name='_GSocketOutputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-286'/>
    <typedef-decl name='GSocketInputStreamPrivate' type-id='type-id-285' filepath='../gio/gsocketinputstream.h' line='40' column='1' id='type-id-283'/>
    <typedef-decl name='GSocketOutputStreamPrivate' type-id='type-id-286' filepath='../gio/gsocketoutputstream.h' line='40' column='1' id='type-id-284'/>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsocketcontrolmessage.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_type_children' filepath='../gobject/gtype.h' line='791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_children' hash='8b0c65002997e720'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-287'/>
      <return type-id='type-id-288'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsocketlistener.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsocks4aproxy.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_hostname_is_ip_address' filepath='../glib/ghostutils.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hostname_is_ip_address' hash='d731989df7e70156'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsocks5proxy.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsrvtarget.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_list_remove_link' filepath='../glib/glist.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_remove_link' hash='56d000fabe52c38f'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-55'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsubprocess.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GMemoryOutputStreamPrivate' is-struct='yes' visibility='default' size-in-bits='384' filepath='../gio/gmemoryoutputstream.c' line='58' column='1' hash='367696a321820080' id='type-id-289'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-12' visibility='default' filepath='../gio/gmemoryoutputstream.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-23' visibility='default' filepath='../gio/gmemoryoutputstream.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='valid_len' type-id='type-id-23' visibility='default' filepath='../gio/gmemoryoutputstream.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pos' type-id='type-id-23' visibility='default' filepath='../gio/gmemoryoutputstream.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='realloc_fn' type-id='type-id-290' visibility='default' filepath='../gio/gmemoryoutputstream.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='destroy' type-id='type-id-21' visibility='default' filepath='../gio/gmemoryoutputstream.c' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GUnixOutputStreamPrivate' is-struct='yes' visibility='default' size-in-bits='64' filepath='../gio/gunixoutputstream.c' line='63' column='1' hash='8aa74fd58b1d21f2' id='type-id-291'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-87' visibility='default' filepath='../gio/gunixoutputstream.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='close_fd' type-id='type-id-10' visibility='default' filepath='../gio/gunixoutputstream.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33'>
        <var-decl name='can_poll' type-id='type-id-10' visibility='default' filepath='../gio/gunixoutputstream.c' line='66' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_child_watch_source_new' filepath='../glib/gmain.h' line='818' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_child_watch_source_new' hash='bbac02e3cd5d3861'>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='g_slist_free_1' filepath='../glib/gslist.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_free_1' hash='ebbf473d6dca81f0'>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gsubprocesslauncher.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_array_unref' filepath='../glib/garray.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_unref' hash='e89cece792c3957b'>
      <parameter type-id='type-id-111'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_object_class_install_property' filepath='../gobject/gobject.h' line='401' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_class_install_property' hash='e4d36d63f373476c'>
      <parameter type-id='type-id-292'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-191'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_param_spec_flags' filepath='../gobject/gparamspecs.h' line='1073' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_flags' hash='7912bed6fc7be1bd'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-191'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gtask.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_prefix_error_literal' filepath='../glib/gerror.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_prefix_error_literal' hash='59c27cd619b3bf25'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_source_get_name' filepath='../glib/gmain.h' line='752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_get_name' hash='bf2bde197b395712'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='g_thread_pool_unprocessed' filepath='../glib/gthreadpool.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_thread_pool_unprocessed' hash='067a498525b367fa'>
      <parameter type-id='type-id-293'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_thread_pool_set_sort_function' filepath='../glib/gthreadpool.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_thread_pool_set_sort_function' hash='9e3b258c3f9209e4'>
      <parameter type-id='type-id-293'/>
      <parameter type-id='type-id-210'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_thread_pool_move_to_front' filepath='../glib/gthreadpool.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_thread_pool_move_to_front' hash='d7b9c85bc8838153'>
      <parameter type-id='type-id-293'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_thread_pool_set_max_threads' filepath='../glib/gthreadpool.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_thread_pool_set_max_threads' hash='0489e69c05079e2e'>
      <parameter type-id='type-id-293'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gtcpwrapperconnection.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gtestdbus.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_io_channel_shutdown' filepath='../glib/giochannel.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_channel_shutdown' hash='ddbf253e6df2abab'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-295'/>
    </function-decl>
    <function-decl name='g_io_channel_set_close_on_unref' filepath='../glib/giochannel.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_channel_set_close_on_unref' hash='9d7545f70eabaab8'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_io_channel_flush' filepath='../glib/giochannel.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_channel_flush' hash='d1fd1874ebc79635'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-295'/>
    </function-decl>
    <function-decl name='g_io_channel_read_line' filepath='../glib/giochannel.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_channel_read_line' hash='0c310d505bc1f934'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-295'/>
    </function-decl>
    <function-decl name='g_io_channel_write_chars' filepath='../glib/giochannel.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_channel_write_chars' hash='b6e9a2e75df8ba57'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-295'/>
    </function-decl>
    <function-decl name='g_timeout_add_seconds_once' filepath='../glib/gmain.h' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_timeout_add_seconds_once' hash='f89c41ccab2bdc0d'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-296'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_idle_add' filepath='../glib/gmain.h' line='966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_idle_add' hash='61a201e3cde13f2f'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_spawn_command_line_async' filepath='../glib/gspawn.h' line='307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_spawn_command_line_async' hash='9e4ebdcf41c3fc05'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-type size-in-bits='64' hash='d1fd1874ebc79635' id='type-id-297'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-295'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gthemedicon.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_list_find_custom' filepath='../glib/glist.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_find_custom' hash='b3a0a58c4702cd99'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-119'/>
      <return type-id='type-id-55'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gthreadedresolver.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_byte_array_new' filepath='../glib/garray.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_new' hash='357ac0abb41ad6dc'>
      <return type-id='type-id-298'/>
    </function-decl>
    <function-decl name='g_byte_array_free' filepath='../glib/garray.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_free' hash='0b25f338c82b4514'>
      <parameter type-id='type-id-298'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-186'/>
    </function-decl>
    <function-decl name='g_byte_array_set_size' filepath='../glib/garray.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_set_size' hash='dc4f3da7d92b9ea3'>
      <parameter type-id='type-id-298'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-298'/>
    </function-decl>
    <function-decl name='g_thread_pool_new_full' filepath='../glib/gthreadpool.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_thread_pool_new_full' hash='ec5e70f2d845ffc7'>
      <parameter type-id='type-id-105'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='g_thread_pool_free' filepath='../glib/gthreadpool.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_thread_pool_free' hash='f7c5b0e219351980'>
      <parameter type-id='type-id-293'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='getifaddrs' filepath='/usr/include/ifaddrs.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getifaddrs' hash='eb2096ebb44c86df'>
      <parameter type-id='type-id-299'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='freeifaddrs' filepath='/usr/include/ifaddrs.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='freeifaddrs' hash='1188b7a73efd44d5'>
      <parameter type-id='type-id-300'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='__h_errno_location' filepath='/usr/include/netdb.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__h_errno_location' hash='c0e4f5f42afc96e0'>
      <return type-id='type-id-301'/>
    </function-decl>
    <function-decl name='getnameinfo' filepath='/usr/include/netdb.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getnameinfo' hash='51d62da82fc932b6'>
      <parameter type-id='type-id-302'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='dn_expand' filepath='/usr/include/resolv.h' line='275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dn_expand' hash='4aa3f19d2b807a58'>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-303'/>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='__res_ninit' filepath='/usr/include/resolv.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__res_ninit' hash='b7a880ef063e91be'>
      <parameter type-id='type-id-304'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='res_nquery' filepath='/usr/include/resolv.h' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='res_nquery' hash='a29d8562fdb33164'>
      <parameter type-id='type-id-304'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-305'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='__res_nclose' filepath='/usr/include/resolv.h' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__res_nclose' hash='8294b09bdc9244ab'>
      <parameter type-id='type-id-304'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gthreadedsocketservice.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gtlscertificate.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_byte_array_unref' filepath='../glib/garray.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_unref' hash='357ac0abb41ad6dc'>
      <parameter type-id='type-id-298'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_byte_array_append' filepath='../glib/garray.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_append' hash='8092d6fe2fe7d806'>
      <parameter type-id='type-id-298'/>
      <parameter type-id='type-id-306'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-298'/>
    </function-decl>
    <function-decl name='g_slist_concat' filepath='../glib/gslist.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_concat' hash='a9ba48f4e8b988bd'>
      <parameter type-id='type-id-110'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-110'/>
    </function-decl>
    <function-decl name='g_slist_last' filepath='../glib/gslist.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_last' hash='d25cb34cbff9f8c9'>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-110'/>
    </function-decl>
    <function-decl name='g_strstr_len' filepath='../glib/gstrfuncs.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strstr_len' hash='810a07c8232412e5'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_strrstr_len' filepath='../glib/gstrfuncs.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strrstr_len' hash='810a07c8232412e5'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_byte_array_get_type' filepath='../gobject/glib-types.h' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_ptr_array_get_type' filepath='../gobject/glib-types.h' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_date_time_get_type' filepath='../gobject/glib-types.h' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_value_set_static_string' filepath='../gobject/gvaluetypes.h' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_static_string' hash='6d57be31fbefa0f8'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gtlsdatabase.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_byte_array_ref' filepath='../glib/garray.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_ref' hash='595da72c17c602b2'>
      <parameter type-id='type-id-298'/>
      <return type-id='type-id-298'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gtlsfiledatabase.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_param_spec_string' filepath='../gobject/gparamspecs.h' line='1096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_string' hash='f3e836d26e5379e6'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-191'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gtrashportal.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-307' size-in-bits='64' id='type-id-308'/>
    <class-decl name='_GXdpTrash' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-309'/>
    <typedef-decl name='GXdpTrash' type-id='type-id-309' filepath='gio/xdp-dbus.h' line='1001' column='1' id='type-id-307'/>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gunionvolumemonitor.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_once_impl' filepath='../glib/gthread.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_once_impl' hash='2894e17cc0e9edcb'>
      <parameter type-id='type-id-310'/>
      <parameter type-id='type-id-115'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='g_object_run_dispose' filepath='../gobject/gobject.h' line='653' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_run_dispose' hash='6fe16b214fd52931'>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-type size-in-bits='64' hash='6fe16b214fd52931' id='type-id-311'>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-13'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gunixconnection.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GUnixCredentialsMessagePrivate' is-struct='yes' visibility='default' size-in-bits='64' filepath='../gio/gunixcredentialsmessage.c' line='62' column='1' hash='74bbf2823eb06683' id='type-id-312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='credentials' type-id='type-id-77' visibility='default' filepath='../gio/gunixcredentialsmessage.c' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GUnixFDMessagePrivate' is-struct='yes' visibility='default' size-in-bits='64' filepath='../gio/gunixfdmessage.c' line='47' column='1' hash='e0a6b5f2ce108936' id='type-id-313'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='list' type-id='type-id-314' visibility='default' filepath='../gio/gunixfdmessage.c' line='49' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gunixcredentialsmessage.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gunixfdmessage.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_param_spec_object' filepath='../gobject/gparamspecs.h' line='1125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_object' hash='6d0441d7d6a9df59'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-190'/>
      <return type-id='type-id-191'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gunixmounts.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='libmnt_optmap' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/libmount/libmount.h' line='78' column='1' hash='3633d1ec5f68664c' id='type-id-315'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-68' visibility='default' filepath='/usr/include/libmount/libmount.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-87' visibility='default' filepath='/usr/include/libmount/libmount.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='mask' type-id='type-id-87' visibility='default' filepath='/usr/include/libmount/libmount.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-315' const='yes' hash='2761e6733ccb35fb' id='type-id-316'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' hash='b52a59de47683a3d' id='type-id-317'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' hash='d9e2f19705735211' id='type-id-319'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-321'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-323'/>
    <class-decl name='libmnt_iter' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-322'/>
    <function-decl name='g_ptr_array_new_null_terminated' filepath='../glib/garray.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_new_null_terminated' hash='63eb884da593fa5d'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_io_create_watch' filepath='../glib/giochannel.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_create_watch' hash='140552f56530c0f0'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-324'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='g_io_channel_new_file' filepath='../glib/giochannel.h' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_channel_new_file' hash='851e0a9e8cdb64a9'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-294'/>
    </function-decl>
    <function-decl name='g_get_user_name' filepath='../glib/gutils.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_user_name' hash='3f7921bdb568b75e'>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_signal_connect_data' filepath='../gobject/gsignal.h' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_connect_data' hash='b39f1645e57ded98'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-326'/>
      <parameter type-id='type-id-327'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='mnt_get_fstab_path' filepath='/usr/include/libmount/libmount.h' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_get_fstab_path' hash='53885bde0aa65efe'>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='mnt_has_regular_mtab' filepath='/usr/include/libmount/libmount.h' line='373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_has_regular_mtab' hash='beff37cb34aca987'>
      <parameter type-id='type-id-328'/>
      <parameter type-id='type-id-301'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='mnt_optstr_get_flags' filepath='/usr/include/libmount/libmount.h' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_optstr_get_flags' hash='b1f76ab72f94182c'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-319'/>
      <parameter type-id='type-id-317'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='mnt_new_iter' filepath='/usr/include/libmount/libmount.h' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_new_iter' hash='388da3fa973fde78'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-323'/>
    </function-decl>
    <function-decl name='mnt_free_iter' filepath='/usr/include/libmount/libmount.h' line='453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_free_iter' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-323'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='mnt_get_builtin_optmap' filepath='/usr/include/libmount/libmount.h' line='465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_get_builtin_optmap' hash='6189b787d0901b5b'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-317'/>
    </function-decl>
    <function-decl name='mnt_fs_get_source' filepath='/usr/include/libmount/libmount.h' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_fs_get_source' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='mnt_fs_get_target' filepath='/usr/include/libmount/libmount.h' line='498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_fs_get_target' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='mnt_fs_get_fstype' filepath='/usr/include/libmount/libmount.h' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_fs_get_fstype' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='mnt_fs_strdup_options' filepath='/usr/include/libmount/libmount.h' line='508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_fs_strdup_options' hash='02a096d257a5e00d'>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='mnt_fs_get_options' filepath='/usr/include/libmount/libmount.h' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_fs_get_options' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='mnt_fs_get_root' filepath='/usr/include/libmount/libmount.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_fs_get_root' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-320'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='mnt_table_parse_fstab' filepath='/usr/include/libmount/libmount.h' line='605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_table_parse_fstab' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-329'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='mnt_table_parse_mtab' filepath='/usr/include/libmount/libmount.h' line='607' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_table_parse_mtab' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-329'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='mnt_new_table' filepath='/usr/include/libmount/libmount.h' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_new_table' hash='7f32ffea222edbe7'>
      <return type-id='type-id-329'/>
    </function-decl>
    <function-decl name='mnt_free_table' filepath='/usr/include/libmount/libmount.h' line='614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_free_table' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-329'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='mnt_table_next_fs' filepath='/usr/include/libmount/libmount.h' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_table_next_fs' hash='388da3fa973fde78'>
      <parameter type-id='type-id-329'/>
      <parameter type-id='type-id-323'/>
      <parameter type-id='type-id-321'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='mnt_new_monitor' filepath='/usr/include/libmount/libmount.h' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_new_monitor' hash='7f32ffea222edbe7'>
      <return type-id='type-id-330'/>
    </function-decl>
    <function-decl name='mnt_unref_monitor' filepath='/usr/include/libmount/libmount.h' line='751' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_unref_monitor' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='mnt_monitor_enable_kernel' filepath='/usr/include/libmount/libmount.h' line='753' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_monitor_enable_kernel' hash='d628501fd2223339'>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='mnt_monitor_enable_userspace' filepath='/usr/include/libmount/libmount.h' line='754' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_monitor_enable_userspace' hash='e4623ae51caf7651'>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='mnt_monitor_veil_kernel' filepath='/usr/include/libmount/libmount.h' line='757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_monitor_veil_kernel' hash='d628501fd2223339'>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='mnt_monitor_get_fd' filepath='/usr/include/libmount/libmount.h' line='759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_monitor_get_fd' hash='388da3fa973fde78'>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='mnt_monitor_next_change' filepath='/usr/include/libmount/libmount.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_monitor_next_change' hash='beff37cb34aca987'>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-328'/>
      <parameter type-id='type-id-301'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='mnt_monitor_event_cleanup' filepath='/usr/include/libmount/libmount.h' line='765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mnt_monitor_event_cleanup' hash='388da3fa973fde78'>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='getmntent_r' filepath='/usr/include/mntent.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getmntent_r' hash='fb77c438130339cb'>
      <parameter type-id='type-id-331'/>
      <parameter type-id='type-id-332'/>
      <parameter type-id='type-id-198'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-333'/>
    </function-decl>
    <function-decl name='endmntent' filepath='/usr/include/mntent.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='endmntent' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-334'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-type size-in-bits='64' hash='140552f56530c0f0' id='type-id-335'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-324'/>
      <return type-id='type-id-49'/>
    </function-type>
    <function-type size-in-bits='64' hash='485dbe5a902b1524' id='type-id-336'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-13'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gunixoutputstream.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='writev' filepath='/usr/include/sys/uio.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='writev' hash='76dcd21084089e04'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-160'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gunixsocketaddress.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_byte_array_sized_new' filepath='../glib/garray.h' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_sized_new' hash='6f4f8de921aeecc9'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-298'/>
    </function-decl>
    <function-decl name='g_strlcpy' filepath='../glib/gstrfuncs.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strlcpy' hash='6ec2602bf87f459d'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gunixvolume.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GUnixVolume' is-struct='yes' visibility='default' size-in-bits='832' filepath='../gio/gunixvolume.c' line='46' column='1' hash='b4fc12698930a0c1' id='type-id-338'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='type-id-42' visibility='default' filepath='../gio/gunixvolume.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='volume_monitor' type-id='type-id-339' visibility='default' filepath='../gio/gunixvolume.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mount' type-id='type-id-340' visibility='default' filepath='../gio/gunixvolume.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='device_path' type-id='type-id-69' visibility='default' filepath='../gio/gunixvolume.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='mount_path' type-id='type-id-69' visibility='default' filepath='../gio/gunixvolume.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='can_eject' type-id='type-id-3' visibility='default' filepath='../gio/gunixvolume.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='identifier' type-id='type-id-69' visibility='default' filepath='../gio/gunixvolume.c' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='identifier_type' type-id='type-id-69' visibility='default' filepath='../gio/gunixvolume.c' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='name' type-id='type-id-69' visibility='default' filepath='../gio/gunixvolume.c' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='icon' type-id='type-id-171' visibility='default' filepath='../gio/gunixvolume.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='symbolic_icon' type-id='type-id-171' visibility='default' filepath='../gio/gunixvolume.c' line='61' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' id='type-id-342'/>
    <class-decl name='_GUnixMount' is-struct='yes' visibility='default' size-in-bits='704' filepath='../gio/gunixmount.c' line='50' column='1' hash='5d04b7273aecb281' id='type-id-343'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='type-id-42' visibility='default' filepath='../gio/gunixmount.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='volume_monitor' type-id='type-id-339' visibility='default' filepath='../gio/gunixmount.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='volume' type-id='type-id-344' visibility='default' filepath='../gio/gunixmount.c' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='type-id-69' visibility='default' filepath='../gio/gunixmount.c' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='icon' type-id='type-id-171' visibility='default' filepath='../gio/gunixmount.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='symbolic_icon' type-id='type-id-171' visibility='default' filepath='../gio/gunixmount.c' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='device_path' type-id='type-id-69' visibility='default' filepath='../gio/gunixmount.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='mount_path' type-id='type-id-69' visibility='default' filepath='../gio/gunixmount.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='can_eject' type-id='type-id-3' visibility='default' filepath='../gio/gunixmount.c' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GUnixMountPoint' is-struct='yes' visibility='default' size-in-bits='384' filepath='../gio/gunixmounts.c' line='137' column='1' hash='ecb17ffde9418747' id='type-id-345'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mount_path' type-id='type-id-69' visibility='default' filepath='../gio/gunixmounts.c' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_path' type-id='type-id-69' visibility='default' filepath='../gio/gunixmounts.c' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='filesystem_type' type-id='type-id-69' visibility='default' filepath='../gio/gunixmounts.c' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='options' type-id='type-id-69' visibility='default' filepath='../gio/gunixmounts.c' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='is_read_only' type-id='type-id-3' visibility='default' filepath='../gio/gunixmounts.c' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='is_user_mountable' type-id='type-id-3' visibility='default' filepath='../gio/gunixmounts.c' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='is_loopback' type-id='type-id-3' visibility='default' filepath='../gio/gunixmounts.c' line='144' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GUnixVolumeMonitor' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-346'/>
    <typedef-decl name='GUnixVolumeMonitor' type-id='type-id-346' filepath='../gio/gunixvolumemonitor.h' line='37' column='1' id='type-id-341'/>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gunixvolumemonitor.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GUnixMountMonitor' is-struct='yes' visibility='default' size-in-bits='256' filepath='../gio/gunixmounts.c' line='2273' column='1' hash='8921062bca83c45c' id='type-id-347'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='type-id-42' visibility='default' filepath='../gio/gunixmounts.c' line='2274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='context' type-id='type-id-15' visibility='default' filepath='../gio/gunixmounts.c' line='2276' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gzlibcompressor.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='deflate' filepath='/usr/include/zlib.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflate' hash='f0b6f2c352fd51d7'>
      <parameter type-id='type-id-348'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='deflateEnd' filepath='/usr/include/zlib.h' line='374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateEnd' hash='6d5f8ad1d7de0337'>
      <parameter type-id='type-id-348'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='deflateReset' filepath='/usr/include/zlib.h' line='703' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateReset' hash='6d5f8ad1d7de0337'>
      <parameter type-id='type-id-348'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='deflateSetHeader' filepath='/usr/include/zlib.h' line='805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateSetHeader@@ZLIB_1.2.2' hash='eecf64a2c8bd4f11'>
      <parameter type-id='type-id-348'/>
      <parameter type-id='type-id-349'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='deflateInit_' filepath='/usr/include/zlib.h' line='1759' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateInit_' hash='b53ec549310563fe'>
      <parameter type-id='type-id-348'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='deflateInit2_' filepath='/usr/include/zlib.h' line='1761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='deflateInit2_' hash='73cca24bda9900bc'>
      <parameter type-id='type-id-348'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/gzlibdecompressor.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='inflate' filepath='/usr/include/zlib.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflate' hash='f0b6f2c352fd51d7'>
      <parameter type-id='type-id-348'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='inflateEnd' filepath='/usr/include/zlib.h' line='532' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateEnd' hash='6d5f8ad1d7de0337'>
      <parameter type-id='type-id-348'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='inflateReset' filepath='/usr/include/zlib.h' line='951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateReset' hash='6d5f8ad1d7de0337'>
      <parameter type-id='type-id-348'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='inflateGetHeader' filepath='/usr/include/zlib.h' line='1022' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateGetHeader@@ZLIB_1.2.2' hash='eecf64a2c8bd4f11'>
      <parameter type-id='type-id-348'/>
      <parameter type-id='type-id-349'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='inflateInit_' filepath='/usr/include/zlib.h' line='1760' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateInit_' hash='f6d5ae7d908b4300'>
      <parameter type-id='type-id-348'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='inflateInit2_' filepath='/usr/include/zlib.h' line='1763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inflateInit2_' hash='b53ec549310563fe'>
      <parameter type-id='type-id-348'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/inotify/inotify-helper.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GFileMonitorSource' is-struct='yes' visibility='default' size-in-bits='1536' filepath='../gio/glocalfilemonitor.c' line='47' column='1' hash='df95931e418a25c4' id='type-id-350'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='source' type-id='type-id-351' visibility='default' filepath='../gio/glocalfilemonitor.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='lock' type-id='type-id-114' visibility='default' filepath='../gio/glocalfilemonitor.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='instance_ref' type-id='type-id-352' visibility='default' filepath='../gio/glocalfilemonitor.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='flags' type-id='type-id-353' visibility='default' filepath='../gio/glocalfilemonitor.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dirname' type-id='type-id-14' visibility='default' filepath='../gio/glocalfilemonitor.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='basename' type-id='type-id-14' visibility='default' filepath='../gio/glocalfilemonitor.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='filename' type-id='type-id-14' visibility='default' filepath='../gio/glocalfilemonitor.c' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='pending_changes' type-id='type-id-188' visibility='default' filepath='../gio/glocalfilemonitor.c' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='pending_changes_table' type-id='type-id-44' visibility='default' filepath='../gio/glocalfilemonitor.c' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='event_queue' type-id='type-id-354' visibility='default' filepath='../gio/glocalfilemonitor.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='rate_limit' type-id='type-id-82' visibility='default' filepath='../gio/glocalfilemonitor.c' line='59' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/inotify/inotify-kernel.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_hash_table_steal_extended' filepath='../glib/ghash.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_steal_extended' hash='cdadaf8beea904f1'>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_source_modify_unix_fd' filepath='../glib/gmain.h' line='769' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_modify_unix_fd' hash='f8a8c2f5292a9035'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-324'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_queue_peek_head' filepath='../glib/gqueue.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_peek_head' hash='5f0a15fbed3be6b7'>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='inotify_init' filepath='/usr/include/sys/inotify.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inotify_init' hash='388da3fa973fde78'>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='inotify_init1' filepath='/usr/include/sys/inotify.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inotify_init1' hash='d628501fd2223339'>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='inotify_add_watch' filepath='/usr/include/sys/inotify.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inotify_add_watch' hash='e8a92975e79b661a'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-355'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='inotify_rm_watch' filepath='/usr/include/sys/inotify.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inotify_rm_watch' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/inotify/inotify-missing.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_list_free_1' filepath='../glib/glist.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_free_1' hash='c884abd86095e20d'>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-13'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/inotify/inotify-path.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-357'/>
    <function-type size-in-bits='64' hash='9024e518cad04055' id='type-id-356'>
      <parameter type-id='type-id-358'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/thumbnail-verify.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_mapped_file_new' filepath='../glib/gmappedfile.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mapped_file_new' hash='4381d67cbdde95ae'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-359'/>
    </function-decl>
    <function-decl name='g_mapped_file_get_length' filepath='../glib/gmappedfile.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mapped_file_get_length' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-359'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='g_mapped_file_get_contents' filepath='../glib/gmappedfile.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mapped_file_get_contents' hash='a0e4fd26be68a7ef'>
      <parameter type-id='type-id-359'/>
      <return type-id='type-id-14'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/xdgmime/xdgmime.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-360' size-in-bits='unknown' hash='a192c284cd51148a' id='type-id-361'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-362'/>
    </array-type-def>
    <typedef-decl name='XdgMimeCache' type-id='type-id-363' size-in-bits='192' filepath='../gio/xdgmime/xdgmimecache.h' line='16' column='1' id='type-id-364'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' hash='e0148b01ddb3962e' id='type-id-365'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' hash='d76da0e8545d5990' id='type-id-366'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' id='type-id-368'/>
    <class-decl name='XdgAliasList' is-struct='yes' visibility='default' size-in-bits='128' filepath='../gio/xdgmime/xdgmimealias.c' line='40' column='1' hash='9b22b27f19effac6' id='type-id-369'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aliases' type-id='type-id-370' visibility='default' filepath='../gio/xdgmime/xdgmimealias.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_aliases' type-id='type-id-87' visibility='default' filepath='../gio/xdgmime/xdgmimealias.c' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='XdgGlobHash' is-struct='yes' visibility='default' size-in-bits='192' filepath='../gio/xdgmime/xdgmimeglob.c' line='57' column='1' hash='f0c6b09b9f34047c' id='type-id-371'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='literal_list' type-id='type-id-372' visibility='default' filepath='../gio/xdgmime/xdgmimeglob.c' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='simple_node' type-id='type-id-373' visibility='default' filepath='../gio/xdgmime/xdgmimeglob.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='full_list' type-id='type-id-372' visibility='default' filepath='../gio/xdgmime/xdgmimeglob.c' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='XdgIconList' is-struct='yes' visibility='default' size-in-bits='128' filepath='../gio/xdgmime/xdgmimeicon.c' line='39' column='1' hash='03cd3ddc0a154789' id='type-id-374'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='icons' type-id='type-id-375' visibility='default' filepath='../gio/xdgmime/xdgmimeicon.c' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_icons' type-id='type-id-87' visibility='default' filepath='../gio/xdgmime/xdgmimeicon.c' line='42' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='XdgMimeMagic' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-376'/>
    <class-decl name='XdgParentList' is-struct='yes' visibility='default' size-in-bits='128' filepath='../gio/xdgmime/xdgmimeparent.c' line='41' column='1' hash='b4dda093f8e28608' id='type-id-377'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parents' type-id='type-id-378' visibility='default' filepath='../gio/xdgmime/xdgmimeparent.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='n_mimes' type-id='type-id-87' visibility='default' filepath='../gio/xdgmime/xdgmimeparent.c' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_XdgMimeCache' is-struct='yes' visibility='default' size-in-bits='192' filepath='../gio/xdgmime/xdgmimecache.c' line='67' column='1' hash='a8f1f6360c7f9af8' id='type-id-363'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-87' visibility='default' filepath='../gio/xdgmime/xdgmimecache.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='minor' type-id='type-id-87' visibility='default' filepath='../gio/xdgmime/xdgmimecache.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-157' visibility='default' filepath='../gio/xdgmime/xdgmimecache.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer' type-id='type-id-69' visibility='default' filepath='../gio/xdgmime/xdgmimecache.c' line='73' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='XdgMimeMagic' type-id='type-id-376' filepath='../gio/xdgmime/xdgmimemagic.h' line='17' column='1' id='type-id-367'/>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/xdgmime/xdgmimecache.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='fnmatch' filepath='/usr/include/fnmatch.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnmatch' hash='5e8eff0065f8d4dd'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/xdgmime/xdgmimeglob.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-379' size-in-bits='64' hash='e71bfe8e42018f6a' id='type-id-380'/>
  </abi-instr>
  <abi-instr address-size='64' path='../gio/xdgmime/xdgmimemagic.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_b_loc' hash='2d54aef0745cb1f9'>
      <return type-id='type-id-381'/>
    </function-decl>
    <function-decl name='__uflow' filepath='/usr/include/stdio.h' line='949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__uflow' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-334'/>
      <return type-id='type-id-87'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gtrace.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../subprojects/gvdb/gvdb/gvdb-builder.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../subprojects/gvdb/gvdb/gvdb-reader.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_variant_get_variant' filepath='../glib/gvariant.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_variant' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-1091d4' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-382' size-in-bits='864' hash='f04b2d0666a0a274' id='type-id-121'>
      <subrange length='108' lower-bound='0' upper-bound='107' type-id='type-id-318' size-in-bits='64' is-anonymous='yes' hash='dd90b41895efe02d' id='type-id-383'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-382' size-in-bits='256' hash='3e9fefcb964ef6b4' id='type-id-384'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-318' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-385'/>
    </array-type-def>
    <enum-decl name='GOnceStatus' naming-typedef-id='type-id-386' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gthread.h' line='98' column='1' hash='2ccca139fb6bd1d2' id='type-id-387'>
      <underlying-type type-id='type-id-228'/>
      <enumerator name='G_ONCE_STATUS_NOTCALLED' value='0'/>
      <enumerator name='G_ONCE_STATUS_PROGRESS' value='1'/>
      <enumerator name='G_ONCE_STATUS_READY' value='2'/>
    </enum-decl>
    <class-decl name='_GListStore' is-struct='yes' visibility='default' size-in-bits='512' filepath='../gio/gliststore.c' line='40' column='1' hash='ca9fdfb03479fafa' id='type-id-388'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-42' visibility='default' filepath='../gio/gliststore.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='item_type' type-id='type-id-30' visibility='default' filepath='../gio/gliststore.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='items' type-id='type-id-188' visibility='default' filepath='../gio/gliststore.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='last_position' type-id='type-id-10' visibility='default' filepath='../gio/gliststore.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_iter' type-id='type-id-189' visibility='default' filepath='../gio/gliststore.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='last_position_valid' type-id='type-id-3' visibility='default' filepath='../gio/gliststore.c' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GOnce' is-struct='yes' visibility='default' size-in-bits='128' filepath='../glib/gthread.h' line='105' column='1' hash='e93b1d31e487a2d5' id='type-id-389'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-390' visibility='default' filepath='../glib/gthread.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='retval' type-id='type-id-391' visibility='default' filepath='../glib/gthread.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GUnixConnection' is-struct='yes' visibility='default' size-in-bits='384' filepath='../gio/gunixconnection.h' line='53' column='1' hash='060ad2cbd42ff62e' id='type-id-392'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-393' visibility='default' filepath='../gio/gunixconnection.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priv' type-id='type-id-394' visibility='default' filepath='../gio/gunixconnection.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GUnixCredentialsMessage' is-struct='yes' visibility='default' size-in-bits='320' filepath='../gio/gunixcredentialsmessage.h' line='61' column='1' hash='8219877069607a9a' id='type-id-395'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-396' visibility='default' filepath='../gio/gunixcredentialsmessage.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-397' visibility='default' filepath='../gio/gunixcredentialsmessage.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GUnixFDMessage' is-struct='yes' visibility='default' size-in-bits='320' filepath='../gio/gunixfdmessage.h' line='60' column='1' hash='1f420e48f629503d' id='type-id-398'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-396' visibility='default' filepath='../gio/gunixfdmessage.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-399' visibility='default' filepath='../gio/gunixfdmessage.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GUnixMountEntry' is-struct='yes' visibility='default' size-in-bits='384' filepath='../gio/gunixmounts.c' line='125' column='1' hash='6a99a6f3af7ff04f' id='type-id-400'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mount_path' type-id='type-id-69' visibility='default' filepath='../gio/gunixmounts.c' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='device_path' type-id='type-id-69' visibility='default' filepath='../gio/gunixmounts.c' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='root_path' type-id='type-id-69' visibility='default' filepath='../gio/gunixmounts.c' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='filesystem_type' type-id='type-id-69' visibility='default' filepath='../gio/gunixmounts.c' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='options' type-id='type-id-69' visibility='default' filepath='../gio/gunixmounts.c' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='is_read_only' type-id='type-id-3' visibility='default' filepath='../gio/gunixmounts.c' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='is_system_internal' type-id='type-id-3' visibility='default' filepath='../gio/gunixmounts.c' line='132' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GUnixSocketAddress' is-struct='yes' visibility='default' size-in-bits='256' filepath='../gio/gunixsocketaddress.h' line='44' column='1' hash='58aae4e81428c19b' id='type-id-401'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-402' visibility='default' filepath='../gio/gunixsocketaddress.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-403' visibility='default' filepath='../gio/gunixsocketaddress.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GZlibCompressor' is-struct='yes' visibility='default' size-in-bits='1920' filepath='../gio/gzlibcompressor.c' line='55' column='1' hash='8236bb720ae0b148' id='type-id-404'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-42' visibility='default' filepath='../gio/gzlibcompressor.c' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='format' type-id='type-id-237' visibility='default' filepath='../gio/gzlibcompressor.c' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='level' type-id='type-id-87' visibility='default' filepath='../gio/gzlibcompressor.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zstream' type-id='type-id-238' visibility='default' filepath='../gio/gzlibcompressor.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='gzheader' type-id='type-id-405' visibility='default' filepath='../gio/gzlibcompressor.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='file_info' type-id='type-id-406' visibility='default' filepath='../gio/gzlibcompressor.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='os' type-id='type-id-87' visibility='default' filepath='../gio/gzlibcompressor.c' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='epoll_event' is-struct='yes' visibility='default' size-in-bits='96' filepath='/usr/include/sys/epoll.h' line='85' column='1' hash='ff86c5f5aa86b0c8' id='type-id-407'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='events' type-id='type-id-355' visibility='default' filepath='/usr/include/sys/epoll.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='data' type-id='type-id-408' visibility='default' filepath='/usr/include/sys/epoll.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GEqualFuncFull' type-id='type-id-409' size-in-bits='64' filepath='../glib/gtypes.h' line='136' column='1' hash='fd7a63c0c6c822c4' id='type-id-410'/>
    <typedef-decl name='GListStore' type-id='type-id-388' size-in-bits='512' filepath='../gio/gliststore.h' line='38' column='1' id='type-id-411'/>
    <typedef-decl name='GOnce' type-id='type-id-389' size-in-bits='128' filepath='../glib/gthread.h' line='58' column='1' id='type-id-412'/>
    <typedef-decl name='GOnceStatus' type-id='type-id-387' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gthread.h' line='102' column='1' hash='2ccca139fb6bd1d2' id='type-id-386'/>
    <typedef-decl name='GThreadFunc' type-id='type-id-413' size-in-bits='64' filepath='../glib/gthread.h' line='49' column='1' hash='fd7a63c0c6c822c4' id='type-id-115'/>
    <typedef-decl name='GUnixConnection' type-id='type-id-392' size-in-bits='384' filepath='../gio/gunixconnection.h' line='42' column='1' id='type-id-414'/>
    <typedef-decl name='GUnixCredentialsMessage' type-id='type-id-395' size-in-bits='320' filepath='../gio/giotypes.h' line='465' column='1' id='type-id-415'/>
    <typedef-decl name='GUnixCredentialsMessagePrivate' type-id='type-id-312' size-in-bits='64' filepath='../gio/gunixcredentialsmessage.h' line='38' column='1' id='type-id-416'/>
    <typedef-decl name='GUnixFDMessage' type-id='type-id-398' size-in-bits='320' filepath='../gio/gunixfdmessage.h' line='45' column='1' id='type-id-417'/>
    <typedef-decl name='GUnixFDMessagePrivate' type-id='type-id-313' size-in-bits='64' filepath='../gio/gunixfdmessage.h' line='43' column='1' id='type-id-418'/>
    <typedef-decl name='GUnixMount' type-id='type-id-343' size-in-bits='704' filepath='../gio/gunixvolumemonitor.h' line='47' column='1' id='type-id-419'/>
    <typedef-decl name='GUnixMountEntry' type-id='type-id-400' size-in-bits='384' filepath='../gio/gunixmounts.h' line='37' column='1' id='type-id-420'/>
    <typedef-decl name='GUnixSocketAddress' type-id='type-id-401' size-in-bits='256' filepath='../gio/gunixsocketaddress.h' line='38' column='1' id='type-id-421'/>
    <typedef-decl name='GUnixSocketAddressPrivate' type-id='type-id-120' size-in-bits='1024' filepath='../gio/gunixsocketaddress.h' line='40' column='1' id='type-id-422'/>
    <typedef-decl name='GUnixVolume' type-id='type-id-338' size-in-bits='832' filepath='../gio/gunixvolumemonitor.h' line='48' column='1' id='type-id-423'/>
    <typedef-decl name='GVfsFileLookupFunc' type-id='type-id-424' size-in-bits='64' filepath='../gio/gvfs.h' line='59' column='1' hash='fd7a63c0c6c822c4' id='type-id-425'/>
    <typedef-decl name='GZlibCompressor' type-id='type-id-404' size-in-bits='1920' filepath='../gio/giotypes.h' line='48' column='1' id='type-id-426'/>
    <typedef-decl name='__uint64_t' type-id='type-id-318' size-in-bits='64' filepath='/usr/include/bits/types.h' line='45' column='1' hash='8fdc5eea2983a729' id='type-id-427'/>
    <typedef-decl name='epoll_data_t' type-id='type-id-428' size-in-bits='64' filepath='/usr/include/sys/epoll.h' line='83' column='1' id='type-id-408'/>
    <typedef-decl name='gz_headerp' type-id='type-id-429' size-in-bits='64' filepath='/usr/include/zlib.h' line='151' column='1' hash='fc98dbd99db8446a' id='type-id-349'/>
    <typedef-decl name='uint64_t' type-id='type-id-427' size-in-bits='64' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='type-id-430'/>
    <union-decl name='epoll_data' visibility='default' size-in-bits='64' filepath='/usr/include/sys/epoll.h' line='77' column='1' hash='b7b019b718d186c4' id='type-id-428'>
      <data-member access='public'>
        <var-decl name='ptr' type-id='type-id-176' visibility='default' filepath='/usr/include/sys/epoll.h' line='79' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fd' type-id='type-id-87' visibility='default' filepath='/usr/include/sys/epoll.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u32' type-id='type-id-355' visibility='default' filepath='/usr/include/sys/epoll.h' line='81' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u64' type-id='type-id-430' visibility='default' filepath='/usr/include/sys/epoll.h' line='82' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-431' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-424'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' hash='63f4f9a9d05037ec' id='type-id-432'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' hash='71af1ac198b3540c' id='type-id-310'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' hash='55f7bec67319fdc8' id='type-id-433'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' hash='490a64f0f2835ef6' id='type-id-434'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' hash='33c7d9c6bf7ad421' id='type-id-397'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' hash='dbe96344ec73f85d' id='type-id-435'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' hash='d0842e4c71b1cb56' id='type-id-399'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' hash='cdd2e5b2dfcfb8e7' id='type-id-340'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' hash='1180a46790b5433e' id='type-id-436'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' hash='fd45bda23a893e60' id='type-id-437'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' hash='8da7e52e02cc1dae' id='type-id-403'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' hash='0da5c99033f8d041' id='type-id-344'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' hash='8b83ae9229a74556' id='type-id-438'/>
    <qualified-type-def type-id='type-id-439' const='yes' hash='1041e969aed0e546' id='type-id-440'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' hash='2ee82a443dea4fdc' id='type-id-441'/>
    <pointer-type-def type-id='type-id-407' size-in-bits='64' hash='7c23e53f6891bab3' id='type-id-184'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-409'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' hash='fc98dbd99db8446a' id='type-id-429'/>
    <qualified-type-def type-id='type-id-386' volatile='yes' hash='7627f8e1154a202b' id='type-id-390'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' hash='677c6916f622c854' id='type-id-348'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' id='type-id-444'/>
    <pointer-type-def type-id='type-id-445' size-in-bits='64' id='type-id-188'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' id='type-id-394'/>
    <function-decl name='__builtin_strcpy' mangled-name='strcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-13'/>
    </function-decl>
    <pointer-type-def type-id='type-id-448' size-in-bits='64' id='type-id-320'/>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' id='type-id-329'/>
    <class-decl name='_GListModel' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-450'/>
    <class-decl name='_GSequence' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-451'/>
    <class-decl name='_GSequenceNode' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-452'/>
    <class-decl name='_GUnixConnectionPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-453'/>
    <class-decl name='libmnt_fs' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-448'/>
    <class-decl name='libmnt_table' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-449'/>
    <qualified-type-def type-id='type-id-12' volatile='yes' id='type-id-391'/>
    <function-decl name='g_file_descriptor_based_get_type' mangled-name='g_file_descriptor_based_get_type' filepath='../gio/gfiledescriptorbased.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_descriptor_based_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_file_descriptor_based_get_fd' mangled-name='g_file_descriptor_based_get_fd' filepath='../gio/gfiledescriptorbased.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_descriptor_based_get_fd' hash='388da3fa973fde78'>
      <parameter type-id='type-id-454'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='g_list_model_get_type' mangled-name='g_list_model_get_type' filepath='../gio/glistmodel.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_model_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_list_model_get_item_type' mangled-name='g_list_model_get_item_type' filepath='../gio/glistmodel.c' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_model_get_item_type' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-444' name='list' filepath='../gio/glistmodel.c' line='184' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_list_model_get_n_items' mangled-name='g_list_model_get_n_items' filepath='../gio/glistmodel.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_model_get_n_items' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-444' name='list' filepath='../gio/glistmodel.c' line='206' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_list_model_get_item' mangled-name='g_list_model_get_item' filepath='../gio/glistmodel.c' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_model_get_item' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-444' name='list' filepath='../gio/glistmodel.c' line='233' column='1'/>
      <parameter type-id='type-id-10' name='position' filepath='../gio/glistmodel.c' line='234' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='g_list_model_get_object' mangled-name='g_list_model_get_object' filepath='../gio/glistmodel.c' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_model_get_object' hash='5b485c2f0e37ac45'>
      <parameter type-id='type-id-444' name='list' filepath='../gio/glistmodel.c' line='264' column='1'/>
      <parameter type-id='type-id-10' name='position' filepath='../gio/glistmodel.c' line='265' column='1'/>
      <return type-id='type-id-154'/>
    </function-decl>
    <function-decl name='g_list_model_items_changed' mangled-name='g_list_model_items_changed' filepath='../gio/glistmodel.c' line='307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_model_items_changed' hash='19ccd98d8b73e7a0'>
      <parameter type-id='type-id-444'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <typedef-decl name='GListModel' type-id='type-id-450' filepath='../gio/glistmodel.h' line='38' column='1' id='type-id-443'/>
    <function-decl name='g_list_store_get_type' mangled-name='g_list_store_get_type' filepath='../gio/gliststore.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_list_store_new' mangled-name='g_list_store_new' filepath='../gio/gliststore.c' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_new' hash='8b959d22542aeffc'>
      <parameter type-id='type-id-30' name='item_type' filepath='../gio/gliststore.c' line='248' column='1'/>
      <return type-id='type-id-432'/>
    </function-decl>
    <function-decl name='g_list_store_insert' mangled-name='g_list_store_insert' filepath='../gio/gliststore.c' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_insert' hash='26d7a79c93049c34'>
      <parameter type-id='type-id-432' name='store' filepath='../gio/gliststore.c' line='278' column='1'/>
      <parameter type-id='type-id-10' name='position' filepath='../gio/gliststore.c' line='279' column='1'/>
      <parameter type-id='type-id-12' name='item' filepath='../gio/gliststore.c' line='280' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_list_store_insert_sorted' mangled-name='g_list_store_insert_sorted' filepath='../gio/gliststore.c' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_insert_sorted' hash='66f83e3d99a0c134'>
      <parameter type-id='type-id-432' name='store' filepath='../gio/gliststore.c' line='315' column='1'/>
      <parameter type-id='type-id-12' name='item' filepath='../gio/gliststore.c' line='316' column='1'/>
      <parameter type-id='type-id-210' name='compare_func' filepath='../gio/gliststore.c' line='317' column='1'/>
      <parameter type-id='type-id-12' name='user_data' filepath='../gio/gliststore.c' line='318' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='g_list_store_sort' mangled-name='g_list_store_sort' filepath='../gio/gliststore.c' line='346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_sort' hash='d5c246cf7180818a'>
      <parameter type-id='type-id-432' name='store' filepath='../gio/gliststore.c' line='346' column='1'/>
      <parameter type-id='type-id-210' name='compare_func' filepath='../gio/gliststore.c' line='347' column='1'/>
      <parameter type-id='type-id-12' name='user_data' filepath='../gio/gliststore.c' line='348' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_list_store_append' mangled-name='g_list_store_append' filepath='../gio/gliststore.c' line='376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_append' hash='63c805aa44f5c42d'>
      <parameter type-id='type-id-432' name='store' filepath='../gio/gliststore.c' line='376' column='1'/>
      <parameter type-id='type-id-12' name='item' filepath='../gio/gliststore.c' line='377' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_list_store_remove' mangled-name='g_list_store_remove' filepath='../gio/gliststore.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_remove' hash='26d7a79c93049c34'>
      <parameter type-id='type-id-432' name='store' filepath='../gio/gliststore.c' line='404' column='1'/>
      <parameter type-id='type-id-10' name='position' filepath='../gio/gliststore.c' line='405' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_list_store_remove_all' mangled-name='g_list_store_remove_all' filepath='../gio/gliststore.c' line='427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_remove_all' hash='63c805aa44f5c42d'>
      <parameter type-id='type-id-432' name='store' filepath='../gio/gliststore.c' line='427' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_list_store_splice' mangled-name='g_list_store_splice' filepath='../gio/gliststore.c' line='465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_splice' hash='50c733641310c056'>
      <parameter type-id='type-id-432' name='store' filepath='../gio/gliststore.c' line='465' column='1'/>
      <parameter type-id='type-id-10' name='position' filepath='../gio/gliststore.c' line='466' column='1'/>
      <parameter type-id='type-id-10' name='n_removals' filepath='../gio/gliststore.c' line='467' column='1'/>
      <parameter type-id='type-id-118' name='additions' filepath='../gio/gliststore.c' line='468' column='1'/>
      <parameter type-id='type-id-10' name='n_additions' filepath='../gio/gliststore.c' line='469' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_list_store_find_with_equal_func' mangled-name='g_list_store_find_with_equal_func' filepath='../gio/gliststore.c' line='542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_find_with_equal_func' hash='7131d1016ebbc5cf'>
      <parameter type-id='type-id-432' name='store' filepath='../gio/gliststore.c' line='542' column='1'/>
      <parameter type-id='type-id-12' name='item' filepath='../gio/gliststore.c' line='543' column='1'/>
      <parameter type-id='type-id-455' name='equal_func' filepath='../gio/gliststore.c' line='544' column='1'/>
      <parameter type-id='type-id-287' name='position' filepath='../gio/gliststore.c' line='545' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_list_store_find_with_equal_func_full' mangled-name='g_list_store_find_with_equal_func_full' filepath='../gio/gliststore.c' line='574' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_find_with_equal_func_full' hash='7131d1016ebbc5cf'>
      <parameter type-id='type-id-432' name='store' filepath='../gio/gliststore.c' line='574' column='1'/>
      <parameter type-id='type-id-12' name='item' filepath='../gio/gliststore.c' line='575' column='1'/>
      <parameter type-id='type-id-410' name='equal_func' filepath='../gio/gliststore.c' line='576' column='1'/>
      <parameter type-id='type-id-12' name='user_data' filepath='../gio/gliststore.c' line='577' column='1'/>
      <parameter type-id='type-id-287' name='position' filepath='../gio/gliststore.c' line='578' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_list_store_find' mangled-name='g_list_store_find' filepath='../gio/gliststore.c' line='630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_store_find' hash='95743393c881ce32'>
      <parameter type-id='type-id-432' name='store' filepath='../gio/gliststore.c' line='630' column='1'/>
      <parameter type-id='type-id-12' name='item' filepath='../gio/gliststore.c' line='631' column='1'/>
      <parameter type-id='type-id-287' name='position' filepath='../gio/gliststore.c' line='632' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_volume_monitor_get' mangled-name='g_volume_monitor_get' filepath='../gio/gunionvolumemonitor.c' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_volume_monitor_get' hash='9d5ebef65eeb64d4'>
      <return type-id='type-id-339'/>
    </function-decl>
    <function-decl name='g_volume_monitor_adopt_orphan_mount' mangled-name='g_volume_monitor_adopt_orphan_mount' filepath='../gio/gunionvolumemonitor.c' line='605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_volume_monitor_adopt_orphan_mount' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-456' name='mount' filepath='../gio/gunionvolumemonitor.c' line='605' column='1'/>
      <return type-id='type-id-457'/>
    </function-decl>
    <function-decl name='g_unix_connection_get_type' mangled-name='g_unix_connection_get_type' filepath='../gio/gunixconnection.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unix_connection_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='g_unix_connection_send_fd' mangled-name='g_unix_connection_send_fd' filepath='../gio/gunixconnection.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unix_connection_send_fd' hash='2369d3b66189a7fb'>
      <parameter type-id='type-id-433' name='connection' filepath='../gio/gunixconnection.c' line='80' column='1'/>
      <parameter type-id='type-id-53' name='fd' filepath='../gio/gunixconnection.c' line='81' column='1'/>
      <parameter type-id='type-id-74' name='cancellable' filepath='../gio/gunixconnection.c' line='82' column='1'/>
      <parameter type-id='type-id-19' name='error' filepath='../gio/gunixconnection.c' line='83' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_unix_connection_receive_fd' mangled-name='g_unix_connection_receive_fd' filepath='../gio/gunixconnection.c' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unix_connection_receive_fd' hash='1763190b3f0b4b7f'>
      <parameter type-id='type-id-433' name='connection' filepath='../gio/gunixconnection.c' line='140' column='1'/>
      <parameter type-id='type-id-74' name='cancellable' filepath='../gio/gunixconnection.c' line='141' column='1'/>
      <parameter type-id='type-id-19' name='error' filepath='../gio/gunixconnection.c' line='142' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='g_unix_connection_send_credentials' mangled-name='g_unix_connection_send_credentials' filepath='../gio/gunixconnection.c' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unix_connection_send_credentials' hash='1763190b3f0b4b7f'>
      <parameter type-id='type-id-433'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_unix_connection_send_credentials_async' mangled-name='g_unix_connection_send_credentials_async' filepath='../gio/gunixconnection.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unix_connection_send_credentials_async' hash='6f0fd03889d175bc'>
      <parameter type-id='type-id-433' name='connection' filepath='../gio/gunixconnection.c' line='423' column='1'/>
      <parameter type-id='type-id-74' name='cancellable' filepath='../gio/gunixconnection.c' line='424' column='1'/>
      <parameter type-id='type-id-458' name='callback' filepath='../gio/gunixconnection.c' line='425' column='1'/>
      <parameter type-id='type-id-12' name='user_data' filepath='../gio/gunixconnection.c' line='426' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='g_unix_connection_send_credentials_finish' mangled-name='g_unix_connection_send_credentials_finish' filepath='../gio/gunixconnection.c' line='449' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unix_connection_send_credentials_finish' hash='017846e81d81208a'>
      <parameter type-id='type-id-433' name='connection' filepath='../gio/gunixconnection.c' line='449' column='1'/>
      <parameter type-id='type-id-459' name='result' filepath='../gio/gunixconnection.c' line='450' column='1'/>
      <parameter type-id='type-id-19' name='error' filepath='../gio/gunixconnection.c' line='451' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_unix_connection_receive_credentials' mangled-name='g_unix_connection_receive_credentials' filepath='../gio/gunixconnection.c' line='489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unix_connection_receive_credentials' hash='bf7f13ac41711699'>
      <parameter type-id='type-id-433'/>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-77'/>
    </function-decl>
