<abi-corpus version='2.4' architecture='elf-amd-x86_64' soname='libgee-0.8.so.2'>
  <elf-needed>
    <dependency name='libgio-2.0.so.0'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='gee_abstract_bidir_list_bidir_list_iterator' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gee_abstract_bidir_list_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gee_abstract_bidir_list_get_read_only_view' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gee_abstract_bidir_list_get_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gee_abstract_bidir_sorted_map_bidir_map_iterator' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gee_abstract_bidir_sorted_map_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='gee_abstract_bidir_sorted_map_get_read_only_view' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='g_type_interface_peek_parent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_type_is_a' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_type_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_type_register_fundamental' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_type_register_static' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_usleep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_value_get_gtype' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_value_get_object' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_value_get_pointer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_value_set_boolean' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_value_set_boxed' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_value_set_gtype' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_value_set_int' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_value_set_object' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_value_set_pointer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_value_take_object' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_value_type_compatible' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_warn_message' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_weak_ref_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_weak_ref_get' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_weak_ref_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_weak_ref_set' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memmove' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_param_spec_types' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='&lt;artificial&gt;-1e834' comp-dir-path='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee' language='LANG_C11'>
    <enum-decl name='GeeHazardPointerPolicy' naming-typedef-id='type-id-1' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='488' column='1' hash='a573b039fe2d2433' id='type-id-2'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='GEE_HAZARD_POINTER_POLICY_DEFAULT' value='0'/>
      <enumerator name='GEE_HAZARD_POINTER_POLICY_THREAD_EXIT' value='1'/>
      <enumerator name='GEE_HAZARD_POINTER_POLICY_TRY_FREE' value='2'/>
      <enumerator name='GEE_HAZARD_POINTER_POLICY_FREE' value='3'/>
      <enumerator name='GEE_HAZARD_POINTER_POLICY_TRY_RELEASE' value='4'/>
      <enumerator name='GEE_HAZARD_POINTER_POLICY_RELEASE' value='5'/>
    </enum-decl>
    <enum-decl name='GeeTreeMapNodeColor' naming-typedef-id='type-id-4' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='89' column='1' hash='0d4cd463f5d2e849' id='type-id-5'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='GEE_TREE_MAP_NODE_COLOR_RED' value='0'/>
      <enumerator name='GEE_TREE_MAP_NODE_COLOR_BLACK' value='1'/>
    </enum-decl>
    <enum-decl name='GeeTreeSetNodeColor' naming-typedef-id='type-id-6' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='71' column='1' hash='c6e75df9fddffd5b' id='type-id-7'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='GEE_TREE_SET_NODE_COLOR_RED' value='0'/>
      <enumerator name='GEE_TREE_SET_NODE_COLOR_BLACK' value='1'/>
    </enum-decl>
    <class-decl name='_GEnumValue' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/genums.h' line='196' column='1' hash='ba03c9b134934c59' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-9' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value_name' type-id='type-id-10' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value_nick' type-id='type-id-10' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='200' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeArrayQueue' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1207' column='1' hash='c115d39d739236a2' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-12' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priv' type-id='type-id-13' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1209' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeArrayQueuePrivate' is-struct='yes' visibility='default' size-in-bits='640' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='81' column='1' hash='b478b18b55a7b01b' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_equal_func' type-id='type-id-18' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_equal_func_target' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_equal_func_target_destroy_notify' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_items' type-id='type-id-20' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_items_length1' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='__items_size_' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_start' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='_length' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_stamp' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeConcurrentList' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1221' column='1' hash='d2f374beec428e31' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-22' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priv' type-id='type-id-23' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1223' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeConcurrentListNode' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='153' column='1' hash='03dc4ae6a853ac9c' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-25' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-26' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='priv' type-id='type-id-27' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_succ' type-id='type-id-28' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_backlink' type-id='type-id-28' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_data' type-id='type-id-29' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='159' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeConcurrentListNodePrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='167' column='1' hash='866e7c8c31cfde1b' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeConcurrentListPrivate' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='111' column='1' hash='dc1d30f5b4b6292a' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_head' type-id='type-id-28' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_tail' type-id='type-id-28' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_equal_func' type-id='type-id-32' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='117' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeFunctionsCompareDataFuncClosure' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemultimap.c' line='73' column='1' hash='0232c3eadd90233b' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-25' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-26' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='priv' type-id='type-id-34' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='func' type-id='type-id-35' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='func_target' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='func_target_destroy_notify' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='188' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeFunctionsHashDataFuncClosure' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='86' column='1' hash='8e365f4820fa8077' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-25' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-26' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='priv' type-id='type-id-37' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='func' type-id='type-id-38' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='func_target' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='func_target_destroy_notify' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHashSet' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1297' column='1' hash='e43375288a7a3fd6' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-40' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priv' type-id='type-id-41' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1299' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHashSetNode' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='121' column='1' hash='795cc8753e2d6d45' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-43' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key_hash' type-id='type-id-44' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='124' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHashSetPrivate' is-struct='yes' visibility='default' size-in-bits='576' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='107' column='1' hash='f6dc111c9dc8bd68' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_array_size' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='_nnodes' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_nodes' type-id='type-id-46' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_nodes_length1' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='__nodes_size_' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_hash_func' type-id='type-id-47' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_equal_func' type-id='type-id-32' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_stamp' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHazardPointerContext' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1310' column='1' hash='982dd37a041ffe9c' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_parent' type-id='type-id-49' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_to_free' type-id='type-id-50' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_policy' type-id='type-id-51' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1313' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeMapEntry' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1336' column='1' hash='c785b040fa12078b' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-53' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-54' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1338' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeTreeMap' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1369' column='1' hash='17a3e03e45e2de72' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-56' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='priv' type-id='type-id-57' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1371' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeTreeMapNode' is-struct='yes' visibility='default' size-in-bits='512' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='571' column='1' hash='8ff9e9d3775183b8' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='color' type-id='type-id-4' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='left' type-id='type-id-59' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='right' type-id='type-id-59' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='prev' type-id='type-id-59' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='next' type-id='type-id-59' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='entry' type-id='type-id-60' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='579' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeTreeMapPrivate' is-struct='yes' visibility='default' size-in-bits='1024' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='552' column='1' hash='be4308711e02c27a' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='k_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='k_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='k_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='v_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='v_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='v_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_size' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_keys' type-id='type-id-62' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_values' type-id='type-id-63' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_entries' type-id='type-id-62' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_key_compare_func' type-id='type-id-64' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_value_equal_func' type-id='type-id-32' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='root' type-id='type-id-59' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='first' type-id='type-id-59' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='last' type-id='type-id-59' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='stamp' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='568' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeTreeSet' is-struct='yes' visibility='default' size-in-bits='512' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1396' column='1' hash='894f94c64d927a6b' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-66' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='priv' type-id='type-id-67' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1398' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeTreeSetNode' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='173' column='1' hash='70416d891ea0bf5a' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='color' type-id='type-id-6' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='left' type-id='type-id-69' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='right' type-id='type-id-69' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='prev' type-id='type-id-69' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='type-id-69' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='179' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeTreeSetPrivate' is-struct='yes' visibility='default' size-in-bits='576' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='161' column='1' hash='448800df6aad32db' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_size' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='root' type-id='type-id-69' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_first' type-id='type-id-69' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_last' type-id='type-id-69' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='stamp' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_compare_func' type-id='type-id-64' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='170' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GCompareDataFunc' type-id='type-id-71' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='114' column='1' hash='fd7a63c0c6c822c4' id='type-id-35'/>
    <typedef-decl name='GEnumValue' type-id='type-id-8' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/genums.h' line='142' column='1' id='type-id-72'/>
    <typedef-decl name='GeeArrayQueue' type-id='type-id-11' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='378' column='1' id='type-id-73'/>
    <typedef-decl name='GeeArrayQueuePrivate' type-id='type-id-14' size-in-bits='640' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='380' column='1' id='type-id-74'/>
    <typedef-decl name='GeeConcurrentList' type-id='type-id-21' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='397' column='1' id='type-id-75'/>
    <typedef-decl name='GeeConcurrentListNode' type-id='type-id-24' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='48' column='1' id='type-id-76'/>
    <typedef-decl name='GeeConcurrentListNodePrivate' type-id='type-id-30' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='104' column='1' id='type-id-77'/>
    <typedef-decl name='GeeConcurrentListPrivate' type-id='type-id-31' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='399' column='1' id='type-id-78'/>
    <typedef-decl name='GeeFoldFunc' type-id='type-id-79' size-in-bits='64' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='58' column='1' hash='fd7a63c0c6c822c4' id='type-id-80'/>
    <typedef-decl name='GeeHashDataFunc' type-id='type-id-81' size-in-bits='64' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='419' column='1' hash='fd7a63c0c6c822c4' id='type-id-38'/>
    <typedef-decl name='GeeHashSet' type-id='type-id-39' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='483' column='1' id='type-id-82'/>
    <typedef-decl name='GeeHashSetNode' type-id='type-id-42' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='44' column='1' id='type-id-83'/>
    <typedef-decl name='GeeHashSetPrivate' type-id='type-id-45' size-in-bits='576' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='485' column='1' id='type-id-84'/>
    <typedef-decl name='GeeHazardPointerContext' type-id='type-id-48' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='504' column='1' id='type-id-85'/>
    <typedef-decl name='GeeHazardPointerPolicy' type-id='type-id-2' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='495' column='1' hash='a573b039fe2d2433' id='type-id-1'/>
    <typedef-decl name='GeeMapEntry' type-id='type-id-52' size-in-bits='256' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='234' column='1' id='type-id-86'/>
    <typedef-decl name='GeeMapEntryPrivate' type-id='type-id-87' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='520' column='1' id='type-id-88'/>
    <typedef-decl name='GeeTreeMap' type-id='type-id-55' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='552' column='1' id='type-id-89'/>
    <typedef-decl name='GeeTreeMapNode' type-id='type-id-58' size-in-bits='512' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='59' column='1' id='type-id-90'/>
    <typedef-decl name='GeeTreeMapNodeColor' type-id='type-id-5' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treemap.c' line='92' column='1' hash='0d4cd463f5d2e849' id='type-id-4'/>
    <typedef-decl name='GeeTreeMapPrivate' type-id='type-id-61' size-in-bits='1024' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='554' column='1' id='type-id-91'/>
    <typedef-decl name='GeeTreeSet' type-id='type-id-65' size-in-bits='512' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='585' column='1' id='type-id-92'/>
    <typedef-decl name='GeeTreeSetNode' type-id='type-id-68' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='40' column='1' id='type-id-93'/>
    <typedef-decl name='GeeTreeSetNodeColor' type-id='type-id-7' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/treeset.c' line='74' column='1' hash='c6e75df9fddffd5b' id='type-id-6'/>
    <typedef-decl name='GeeTreeSetPrivate' type-id='type-id-70' size-in-bits='576' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='587' column='1' id='type-id-94'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' hash='00c69a3db6b69d54' id='type-id-95'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' hash='64b8eeedb802b161' id='type-id-96'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' hash='361a9182a7491f89' id='type-id-13'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' hash='d0505d0840503bdd' id='type-id-97'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' hash='f532da4b8ef6e0dd' id='type-id-28'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' hash='9fdbb92645240829' id='type-id-27'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' hash='4fcaf5420e02f8c3' id='type-id-23'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' hash='d02196483d419cba' id='type-id-64'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' hash='43627104bdb19c8c' id='type-id-34'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' hash='942280618f36376b' id='type-id-47'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' hash='a3df78d0caf2b9fc' id='type-id-37'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' hash='2f566dddd975ed73' id='type-id-102'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' hash='6f17666a038872c3' id='type-id-43'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' hash='11f03b5855c9bad4' id='type-id-46'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' hash='ec800c9d66a96949' id='type-id-41'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' hash='cf13d37a015ec7b5' id='type-id-49'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' hash='e5bf1f94a6c82284' id='type-id-51'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' hash='e067b39c58f49f16' id='type-id-60'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' hash='5636246071786bb9' id='type-id-54'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' hash='5aaf5b0093c8587e' id='type-id-103'/>
    <pointer-type-def type-id='type-id-90' size-in-bits='64' hash='14f6bbe80a18db3f' id='type-id-59'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' hash='62a332adda83c25b' id='type-id-57'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' hash='4a0778af51d267e9' id='type-id-104'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' hash='96a0ff9b3a054f70' id='type-id-69'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' hash='290afa26add8d288' id='type-id-67'/>
    <qualified-type-def type-id='type-id-72' const='yes' hash='76d4d447aa632750' id='type-id-105'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' hash='56f4414cf873b574' id='type-id-106'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' hash='9cf8fabf60d2b1bf' id='type-id-29'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' hash='4634e457ea272875' id='type-id-108'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-71'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' hash='7c3bfb2f442d97d9' id='type-id-110'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-79'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' hash='4384563727abe56b' id='type-id-113'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-81'/>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' id='type-id-116'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove' hash='7f32ffea222edbe7'>
      <return type-id='type-id-119'/>
    </function-decl>
    <class-decl name='_GeeAbstractBidirSortedMapPrivate' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedmap.c' line='83' column='1' hash='9344580823b3f78a' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='k_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedmap.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='k_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedmap.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='k_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedmap.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='v_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedmap.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='v_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedmap.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='v_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedmap.c' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_read_only_view' type-id='type-id-121' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedmap.c' line='90' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeAbstractBidirSortedSetPrivate' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedset.c' line='90' column='1' hash='d434be1098e93a59' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedset.c' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedset.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedset.c' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_read_only_view' type-id='type-id-121' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractbidirsortedset.c' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeAbstractQueuePrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractqueue.c' line='51' column='1' hash='07e4ba862774fa8f' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractqueue.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractqueue.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractqueue.c' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeArrayListPrivate' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='95' column='1' hash='81b28d851202ee8e' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_equal_func' type-id='type-id-32' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_stamp' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeComparable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-125'/>
    <class-decl name='_GeeDeque' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-126'/>
    <class-decl name='_GeeFunctionsCompareDataFuncClosurePrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='141' column='1' hash='d13146d134d53821' id='type-id-127'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='144' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeFunctionsHashDataFuncClosurePrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='117' column='1' hash='5ede3fe15b0f4b6a' id='type-id-128'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='120' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeMapEntryPrivate' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='55' column='1' hash='da1e8b4cefb58862' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='k_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='k_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='k_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='v_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='v_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='v_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='61' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='gee_array_list_new_wrap' mangled-name='gee_array_list_new_wrap' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_array_list_new_wrap' hash='8ee1418faa7096e2'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='599' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='600' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='601' column='1'/>
      <parameter type-id='type-id-20' name='items' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='602' column='1'/>
      <parameter type-id='type-id-9' name='items_length1' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='603' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='604' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='605' column='1'/>
      <parameter type-id='type-id-17' name='equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='606' column='1'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='gee_array_list_add_all' mangled-name='gee_array_list_add_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='1419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_array_list_add_all' hash='e1a08c22c020a0fc'>
      <parameter type-id='type-id-50' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='1419' column='1'/>
      <parameter type-id='type-id-63' name='collection' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='1420' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_array_list_get_equal_func' mangled-name='gee_array_list_get_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='2974' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_array_list_get_equal_func' hash='913e423dc1c025e5'>
      <parameter type-id='type-id-50' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='2974' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='2975' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='gee_array_list_get_type' mangled-name='gee_array_list_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arraylist.c' line='4356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_array_list_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_array_queue_construct' mangled-name='gee_array_queue_construct' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_array_queue_construct' hash='7cdaac50363b765e'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='234' column='1'/>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='235' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='236' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='237' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='238' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='239' column='1'/>
      <parameter type-id='type-id-17' name='equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='240' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='gee_array_queue_new' mangled-name='gee_array_queue_new' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_array_queue_new' hash='4c1808e5039cb256'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='329' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='330' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='331' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='332' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='333' column='1'/>
      <parameter type-id='type-id-17' name='equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='334' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='gee_array_queue_get_equal_func' mangled-name='gee_array_queue_get_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='1426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_array_queue_get_equal_func' hash='229d8541d1b7c880'>
      <parameter type-id='type-id-96' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='1426' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='1427' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='gee_array_queue_get_is_empty' mangled-name='gee_array_queue_get_is_empty' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='1478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_array_queue_get_is_empty' hash='fc126a3ad23ca728'>
      <parameter type-id='type-id-96' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='1478' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_array_queue_get_type' mangled-name='gee_array_queue_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/arrayqueue.c' line='2521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_array_queue_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_bidir_iterator_previous' mangled-name='gee_bidir_iterator_previous' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidiriterator.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_iterator_previous' hash='388da3fa973fde78'>
      <parameter type-id='type-id-130' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidiriterator.c' line='47' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_bidir_iterator_has_previous' mangled-name='gee_bidir_iterator_has_previous' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidiriterator.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_iterator_has_previous' hash='388da3fa973fde78'>
      <parameter type-id='type-id-130' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidiriterator.c' line='47' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_bidir_iterator_first' mangled-name='gee_bidir_iterator_first' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidiriterator.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_iterator_first' hash='388da3fa973fde78'>
      <parameter type-id='type-id-130' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidiriterator.c' line='47' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_bidir_iterator_last' mangled-name='gee_bidir_iterator_last' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidiriterator.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_iterator_last' hash='388da3fa973fde78'>
      <parameter type-id='type-id-130' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidiriterator.c' line='47' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_bidir_iterator_get_type' mangled-name='gee_bidir_iterator_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidiriterator.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_iterator_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_bidir_list_bidir_list_iterator' mangled-name='gee_bidir_list_bidir_list_iterator' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirlist.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_list_bidir_list_iterator' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-131' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirlist.c' line='47' column='1'/>
      <return type-id='type-id-132'/>
    </function-decl>
    <function-decl name='gee_bidir_list_get_read_only_view' mangled-name='gee_bidir_list_get_read_only_view' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirlist.c' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_list_get_read_only_view' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-131' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirlist.c' line='66' column='1'/>
      <return type-id='type-id-131'/>
    </function-decl>
    <function-decl name='gee_bidir_list_get_type' mangled-name='gee_bidir_list_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirlist.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_list_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_bidir_list_iterator_insert' mangled-name='gee_bidir_list_iterator_insert' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirlistiterator.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_list_iterator_insert' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-132' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirlistiterator.c' line='50' column='1'/>
      <parameter type-id='type-id-107' name='item' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirlistiterator.c' line='51' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_bidir_list_iterator_get_type' mangled-name='gee_bidir_list_iterator_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirlistiterator.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_list_iterator_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_bidir_map_iterator_previous' mangled-name='gee_bidir_map_iterator_previous' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirmapiterator.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_map_iterator_previous' hash='388da3fa973fde78'>
      <parameter type-id='type-id-133' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirmapiterator.c' line='48' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_bidir_map_iterator_has_previous' mangled-name='gee_bidir_map_iterator_has_previous' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirmapiterator.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_map_iterator_has_previous' hash='388da3fa973fde78'>
      <parameter type-id='type-id-133' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirmapiterator.c' line='48' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_bidir_map_iterator_first' mangled-name='gee_bidir_map_iterator_first' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirmapiterator.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_map_iterator_first' hash='388da3fa973fde78'>
      <parameter type-id='type-id-133' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirmapiterator.c' line='48' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_bidir_map_iterator_last' mangled-name='gee_bidir_map_iterator_last' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirmapiterator.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_map_iterator_last' hash='388da3fa973fde78'>
      <parameter type-id='type-id-133' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirmapiterator.c' line='48' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_bidir_map_iterator_get_type' mangled-name='gee_bidir_map_iterator_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirmapiterator.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_map_iterator_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_bidir_sorted_map_bidir_map_iterator' mangled-name='gee_bidir_sorted_map_bidir_map_iterator' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_sorted_map_bidir_map_iterator' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-134' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='49' column='1'/>
      <return type-id='type-id-133'/>
    </function-decl>
    <function-decl name='gee_bidir_sorted_map_empty' mangled-name='gee_bidir_sorted_map_empty' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_sorted_map_empty' hash='9f67f38eab594b33'>
      <parameter type-id='type-id-15' name='k_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='73' column='1'/>
      <parameter type-id='type-id-16' name='k_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='74' column='1'/>
      <parameter type-id='type-id-17' name='k_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='75' column='1'/>
      <parameter type-id='type-id-15' name='v_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='76' column='1'/>
      <parameter type-id='type-id-16' name='v_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='77' column='1'/>
      <parameter type-id='type-id-17' name='v_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='78' column='1'/>
      <return type-id='type-id-134'/>
    </function-decl>
    <function-decl name='gee_bidir_sorted_map_get_read_only_view' mangled-name='gee_bidir_sorted_map_get_read_only_view' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_sorted_map_get_read_only_view' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-134' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='106' column='1'/>
      <return type-id='type-id-134'/>
    </function-decl>
    <function-decl name='gee_bidir_sorted_map_get_type' mangled-name='gee_bidir_sorted_map_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedmap.c' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_sorted_map_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_bidir_sorted_set_bidir_iterator' mangled-name='gee_bidir_sorted_set_bidir_iterator' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedset.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_sorted_set_bidir_iterator' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-135' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedset.c' line='50' column='1'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='gee_bidir_sorted_set_empty' mangled-name='gee_bidir_sorted_set_empty' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedset.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_sorted_set_empty' hash='464ac63c8856dbba'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedset.c' line='74' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedset.c' line='75' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedset.c' line='76' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='gee_bidir_sorted_set_get_read_only_view' mangled-name='gee_bidir_sorted_set_get_read_only_view' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedset.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_sorted_set_get_read_only_view' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-135' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedset.c' line='104' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='gee_bidir_sorted_set_get_type' mangled-name='gee_bidir_sorted_set_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/bidirsortedset.c' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_bidir_sorted_set_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_collection_contains' mangled-name='gee_collection_contains' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_contains' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='252' column='1'/>
      <parameter type-id='type-id-107' name='item' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='253' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_add' mangled-name='gee_collection_add' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_add' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='252' column='1'/>
      <parameter type-id='type-id-107' name='item' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='253' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_remove' mangled-name='gee_collection_remove' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_remove' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='252' column='1'/>
      <parameter type-id='type-id-107' name='item' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='253' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_clear' mangled-name='gee_collection_clear' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_clear' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='332' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_collection_add_all' mangled-name='gee_collection_add_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_add_all' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='400' column='1'/>
      <parameter type-id='type-id-63' name='collection' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='401' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_contains_all' mangled-name='gee_collection_contains_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_contains_all' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='400' column='1'/>
      <parameter type-id='type-id-63' name='collection' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='401' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_remove_all' mangled-name='gee_collection_remove_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_remove_all' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='400' column='1'/>
      <parameter type-id='type-id-63' name='collection' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='401' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_retain_all' mangled-name='gee_collection_retain_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='654' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_retain_all' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='400' column='1'/>
      <parameter type-id='type-id-63' name='collection' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='401' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_to_array' mangled-name='gee_collection_to_array' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_to_array' hash='8dbf93826d0336e9'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1107' column='1'/>
      <parameter type-id='type-id-110' name='result_length1' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1108' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='gee_collection_add_all_array' mangled-name='gee_collection_add_all_array' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_add_all_array' hash='8b31d564236ccec9'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1300' column='1'/>
      <parameter type-id='type-id-20' name='array' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1301' column='1'/>
      <parameter type-id='type-id-9' name='array_length1' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1302' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_contains_all_array' mangled-name='gee_collection_contains_all_array' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_contains_all_array' hash='8b31d564236ccec9'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1300' column='1'/>
      <parameter type-id='type-id-20' name='array' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1301' column='1'/>
      <parameter type-id='type-id-9' name='array_length1' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1302' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_remove_all_array' mangled-name='gee_collection_remove_all_array' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_remove_all_array' hash='8b31d564236ccec9'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1300' column='1'/>
      <parameter type-id='type-id-20' name='array' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1301' column='1'/>
      <parameter type-id='type-id-9' name='array_length1' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1302' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_add_all_iterator' mangled-name='gee_collection_add_all_iterator' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_add_all_iterator' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1802' column='1'/>
      <parameter type-id='type-id-136' name='iter' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1803' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_contains_all_iterator' mangled-name='gee_collection_contains_all_iterator' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1861' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_contains_all_iterator' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1802' column='1'/>
      <parameter type-id='type-id-136' name='iter' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1803' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_remove_all_iterator' mangled-name='gee_collection_remove_all_iterator' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_remove_all_iterator' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1802' column='1'/>
      <parameter type-id='type-id-136' name='iter' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1803' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_empty' mangled-name='gee_collection_empty' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1992' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_empty' hash='464ac63c8856dbba'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1992' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1993' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='1994' column='1'/>
      <return type-id='type-id-63'/>
    </function-decl>
    <function-decl name='gee_collection_get_size' mangled-name='gee_collection_get_size' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='4568' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_get_size' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='4568' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gee_collection_get_is_empty' mangled-name='gee_collection_get_is_empty' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='4587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_get_is_empty' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='4587' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_get_read_only' mangled-name='gee_collection_get_read_only' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='4626' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_get_read_only' hash='388da3fa973fde78'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='4587' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_collection_get_read_only_view' mangled-name='gee_collection_get_read_only_view' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='4645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_get_read_only_view' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-63' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='4645' column='1'/>
      <return type-id='type-id-63'/>
    </function-decl>
    <function-decl name='gee_collection_get_type' mangled-name='gee_collection_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/collection.c' line='4726' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_collection_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_comparable_compare_to' mangled-name='gee_comparable_compare_to' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/comparable.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_comparable_compare_to' hash='388da3fa973fde78'>
      <parameter type-id='type-id-116' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/comparable.c' line='48' column='1'/>
      <parameter type-id='type-id-107' name='object' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/comparable.c' line='49' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gee_comparable_get_type' mangled-name='gee_comparable_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/comparable.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_comparable_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_concurrent_list_construct' mangled-name='gee_concurrent_list_construct' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_concurrent_list_construct' hash='0f976029dfa1a95f'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='433' column='1'/>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='434' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='435' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='436' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='437' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='438' column='1'/>
      <parameter type-id='type-id-17' name='equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='439' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='gee_concurrent_list_new' mangled-name='gee_concurrent_list_new' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='525' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_concurrent_list_new' hash='a6d306c48955db96'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='525' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='526' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='527' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='528' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='529' column='1'/>
      <parameter type-id='type-id-17' name='equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='530' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='gee_concurrent_list_get_equal_func' mangled-name='gee_concurrent_list_get_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='1654' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_concurrent_list_get_equal_func' hash='edb39e7704d16edc'>
      <parameter type-id='type-id-97' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='1654' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='1655' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='gee_concurrent_list_get_is_empty' mangled-name='gee_concurrent_list_get_is_empty' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='1782' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_concurrent_list_get_is_empty' hash='bf9bd7a8f00e2b7a'>
      <parameter type-id='type-id-97' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='1782' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_concurrent_list_get_type' mangled-name='gee_concurrent_list_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentlist.c' line='4105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_concurrent_list_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_concurrent_set_range_type_get_type' mangled-name='gee_concurrent_set_range_type_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='829' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_concurrent_set_range_type_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <typedef-decl name='GeeDeque' type-id='type-id-126' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='368' column='1' id='type-id-117'/>
    <typedef-decl name='GeeComparable' type-id='type-id-125' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='387' column='1' id='type-id-115'/>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-109'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-111'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='type-id-114'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-44'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-137'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-119'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-37210' comp-dir-path='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-19' hash='4dd9a72ade2845b6' id='type-id-138'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-139' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-140'/>
    </array-type-def>
    <class-decl name='_GPrivate' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/glib/gthread.h' line='89' column='1' hash='2ddf8e9ed1c35500' id='type-id-141'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='type-id-19' visibility='default' filepath='/usr/include/glib-2.0/glib/gthread.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='notify' type-id='type-id-17' visibility='default' filepath='/usr/include/glib-2.0/glib/gthread.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='future' type-id='type-id-138' visibility='default' filepath='/usr/include/glib-2.0/glib/gthread.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeConcurrentSet' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1230' column='1' hash='cb4f40640d3f03a0' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-143' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='priv' type-id='type-id-144' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1232' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeConcurrentSetPrivate' is-struct='yes' visibility='default' size-in-bits='512' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='171' column='1' hash='d42d373876d4f606' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_size' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_head' type-id='type-id-146' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_cmp' type-id='type-id-35' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_cmp_target' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_cmp_target_destroy_notify' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='179' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeConcurrentSetTower' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='191' column='1' hash='04fe6f61d351ecd6' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-25' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-26' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='priv' type-id='type-id-148' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_nodes' type-id='type-id-149' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_data' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_height' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='197' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeConcurrentSetTowerNode' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='186' column='1' hash='cee18e7949d099ed' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_succ' type-id='type-id-146' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_backlink' type-id='type-id-146' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='188' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeConcurrentSetTowerPrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='285' column='1' hash='3a1fc0dafdd0aa55' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='288' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GPrivate' type-id='type-id-141' size-in-bits='256' filepath='/usr/include/glib-2.0/glib/gthread.h' line='57' column='1' id='type-id-152'/>
    <typedef-decl name='GeeConcurrentSet' type-id='type-id-142' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='408' column='1' id='type-id-153'/>
    <typedef-decl name='GeeConcurrentSetPrivate' type-id='type-id-145' size-in-bits='512' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='410' column='1' id='type-id-154'/>
    <typedef-decl name='GeeConcurrentSetTower' type-id='type-id-147' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='50' column='1' id='type-id-155'/>
    <typedef-decl name='GeeConcurrentSetTowerNode' type-id='type-id-150' size-in-bits='128' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='88' column='1' id='type-id-156'/>
    <typedef-decl name='GeeConcurrentSetTowerPrivate' type-id='type-id-151' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='85' column='1' id='type-id-157'/>
    <typedef-decl name='gint32' type-id='type-id-158' size-in-bits='32' filepath='/usr/lib64/glib-2.0/include/glibconfig.h' line='56' column='1' hash='09d17c08f594edc7' id='type-id-159'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' hash='02ad7473b0770dc2' id='type-id-160'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' hash='a6ffe4f74a93af6e' id='type-id-161'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' hash='3fc14de9b324c3c9' id='type-id-144'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' hash='d6c5d15da100320b' id='type-id-146'/>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' hash='3659b9d6001e0af1' id='type-id-149'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' hash='f7786f9d38bdcdd8' id='type-id-148'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-163'/>
    <class-decl name='_GRand' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-164'/>
    <typedef-decl name='GRand' type-id='type-id-164' filepath='/usr/include/glib-2.0/glib/grand.h' line='38' column='1' id='type-id-162'/>
    <function-decl name='gee_concurrent_set_construct' mangled-name='gee_concurrent_set_construct' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_concurrent_set_construct' hash='88623c767c13af9d'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='884' column='1'/>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='885' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='886' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='887' column='1'/>
      <parameter type-id='type-id-35' name='compare_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='888' column='1'/>
      <parameter type-id='type-id-19' name='compare_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='889' column='1'/>
      <parameter type-id='type-id-17' name='compare_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='890' column='1'/>
      <return type-id='type-id-161'/>
    </function-decl>
    <function-decl name='gee_concurrent_set_new' mangled-name='gee_concurrent_set_new' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_concurrent_set_new' hash='4ecdde6dd8739e3b'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='975' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='976' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='977' column='1'/>
      <parameter type-id='type-id-35' name='compare_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='978' column='1'/>
      <parameter type-id='type-id-19' name='compare_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='979' column='1'/>
      <parameter type-id='type-id-17' name='compare_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='980' column='1'/>
      <return type-id='type-id-161'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-4dd88' comp-dir-path='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee' language='LANG_C11'>
    <enum-decl name='GeePromiseFutureState' naming-typedef-id='type-id-165' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='55' column='1' hash='db9c2c74dc4df579' id='type-id-166'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='GEE_PROMISE_FUTURE_STATE_INIT' value='0'/>
      <enumerator name='GEE_PROMISE_FUTURE_STATE_ABANDON' value='1'/>
      <enumerator name='GEE_PROMISE_FUTURE_STATE_EXCEPTION' value='2'/>
      <enumerator name='GEE_PROMISE_FUTURE_STATE_READY' value='3'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-44' size-in-bits='64' hash='df5f5e8ed11926f2' id='type-id-167'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-139' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-140'/>
    </array-type-def>
    <class-decl name='_GCond' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/gthread.h' line='74' column='1' hash='9269f754e4188a82' id='type-id-168'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='type-id-19' visibility='default' filepath='/usr/include/glib-2.0/glib/gthread.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='i' type-id='type-id-167' visibility='default' filepath='/usr/include/glib-2.0/glib/gthread.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GError' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/gerror.h' line='45' column='1' hash='a8773754418f4d7e' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-170' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='code' type-id='type-id-9' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='message' type-id='type-id-171' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeFunctionsEqualDataFuncClosure' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='79' column='1' hash='5fc60303b33ea3e9' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-25' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-26' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='priv' type-id='type-id-173' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='func' type-id='type-id-18' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='func_target' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='func_target_destroy_notify' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeFunctionsEqualDataFuncClosurePrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='93' column='1' hash='56d3fbb5cbf8463c' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='96' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeFutureSourceFuncArrayElement' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='96' column='1' hash='7864d62fc2f7d783' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-176' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='func_target' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='func_target_destroy_notify' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHashMap' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1270' column='1' hash='8d00999e7d7bbf27' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-178' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-179' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1272' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHashMapNode' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='324' column='1' hash='72c7074eedb8eafc' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-181' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='key_hash' type-id='type-id-44' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='entry' type-id='type-id-60' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='329' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHashMapPrivate' is-struct='yes' visibility='default' size-in-bits='1024' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='303' column='1' hash='00c88bfdc694e0d7' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='k_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='k_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='k_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='v_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='v_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='v_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_array_size' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='_nnodes' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_nodes' type-id='type-id-183' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_nodes_length1' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='__nodes_size_' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_key_hash_func' type-id='type-id-47' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_key_equal_func' type-id='type-id-32' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_value_equal_func' type-id='type-id-32' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_keys' type-id='type-id-184' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_values' type-id='type-id-63' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_entries' type-id='type-id-184' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_stamp' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='321' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeePromise' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1358' column='1' hash='68b77c6a1b252d06' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-25' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-26' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='priv' type-id='type-id-186' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1361' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeePromiseFuture' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='90' column='1' hash='bf6024d78ea40662' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-53' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-188' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeePromiseFuturePrivate' is-struct='yes' visibility='default' size-in-bits='704' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='105' column='1' hash='0267931c1307a5d4' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_mutex' type-id='type-id-190' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_set' type-id='type-id-191' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_state' type-id='type-id-165' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_value' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_exception' type-id='type-id-192' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_when_done' type-id='type-id-193' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_when_done_length1' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='__when_done_size_' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeePromisePrivate' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='83' column='1' hash='ab1bb6110dd4b65c' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_future' type-id='type-id-195' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='87' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GAsyncReadyCallback' type-id='type-id-196' size-in-bits='64' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='190' column='1' hash='fd7a63c0c6c822c4' id='type-id-197'/>
    <typedef-decl name='GCond' type-id='type-id-168' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/gthread.h' line='56' column='1' id='type-id-191'/>
    <typedef-decl name='GError' type-id='type-id-169' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/gerror.h' line='43' column='1' id='type-id-198'/>
    <typedef-decl name='GMutex' type-id='type-id-199' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gthread.h' line='53' column='1' id='type-id-190'/>
    <typedef-decl name='GQuark' type-id='type-id-200' size-in-bits='32' filepath='/usr/include/glib-2.0/glib/gquark.h' line='38' column='1' hash='e66b43f97c38e87a' id='type-id-170'/>
    <typedef-decl name='GSourceFunc' type-id='type-id-201' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gmain.h' line='200' column='1' hash='fd7a63c0c6c822c4' id='type-id-176'/>
    <typedef-decl name='GeeFunctionsCompareDataFuncClosure' type-id='type-id-33' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='74' column='1' id='type-id-98'/>
    <typedef-decl name='GeeFunctionsCompareDataFuncClosurePrivate' type-id='type-id-127' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='76' column='1' id='type-id-99'/>
    <typedef-decl name='GeeFunctionsHashDataFuncClosure' type-id='type-id-36' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='62' column='1' id='type-id-100'/>
    <typedef-decl name='GeeFunctionsHashDataFuncClosurePrivate' type-id='type-id-128' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='64' column='1' id='type-id-101'/>
    <typedef-decl name='GeeFutureFlatMapFunc' type-id='type-id-202' size-in-bits='64' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='433' column='1' hash='fd7a63c0c6c822c4' id='type-id-203'/>
    <typedef-decl name='GeeFutureLightMapFunc' type-id='type-id-204' size-in-bits='64' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='431' column='1' hash='fd7a63c0c6c822c4' id='type-id-205'/>
    <typedef-decl name='GeeFutureMapFunc' type-id='type-id-206' size-in-bits='64' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='430' column='1' hash='fd7a63c0c6c822c4' id='type-id-207'/>
    <typedef-decl name='GeeFutureZipFunc' type-id='type-id-208' size-in-bits='64' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='432' column='1' hash='fd7a63c0c6c822c4' id='type-id-209'/>
    <typedef-decl name='GeeHashMap' type-id='type-id-177' size-in-bits='320' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='450' column='1' id='type-id-210'/>
    <typedef-decl name='GeeHashMapNode' type-id='type-id-180' size-in-bits='320' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='44' column='1' id='type-id-211'/>
    <typedef-decl name='GeeHashMapPrivate' type-id='type-id-182' size-in-bits='1024' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='452' column='1' id='type-id-212'/>
    <typedef-decl name='GeePromise' type-id='type-id-185' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='540' column='1' id='type-id-213'/>
    <typedef-decl name='GeePromiseFuture' type-id='type-id-187' size-in-bits='256' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='50' column='1' id='type-id-214'/>
    <typedef-decl name='GeePromiseFuturePrivate' type-id='type-id-189' size-in-bits='704' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='54' column='1' id='type-id-215'/>
    <typedef-decl name='GeePromiseFutureState' type-id='type-id-166' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='60' column='1' hash='db9c2c74dc4df579' id='type-id-165'/>
    <typedef-decl name='GeePromisePrivate' type-id='type-id-194' size-in-bits='256' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='542' column='1' id='type-id-216'/>
    <typedef-decl name='guint32' type-id='type-id-217' size-in-bits='32' filepath='/usr/lib64/glib-2.0/include/glibconfig.h' line='57' column='1' hash='e66b43f97c38e87a' id='type-id-200'/>
    <union-decl name='_GMutex' visibility='default' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gthread.h' line='60' column='1' hash='1e87a56b204c21a0' id='type-id-199'>
      <data-member access='public'>
        <var-decl name='p' type-id='type-id-19' visibility='default' filepath='/usr/include/glib-2.0/glib/gthread.h' line='63' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='i' type-id='type-id-167' visibility='default' filepath='/usr/include/glib-2.0/glib/gthread.h' line='64' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' hash='96686f4623f16fd0' id='type-id-192'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' hash='f3a3b0f39224c369' id='type-id-218'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' hash='1888e62de6e8ef80' id='type-id-219'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-202'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' hash='04b0fd97763a9063' id='type-id-193'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' hash='28fca2453076196b' id='type-id-222'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' hash='013b7c57f5d4a6c0' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' hash='0201b00eab6588c9' id='type-id-183'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' hash='3abb1ee72a889ab0' id='type-id-179'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' hash='f45df1997cccca19' id='type-id-223'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' hash='59a2940cc00ba527' id='type-id-195'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' hash='dbb3915d89f217fe' id='type-id-188'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' hash='0cdd6a30dc93742e' id='type-id-186'/>
    <qualified-type-def type-id='type-id-198' const='yes' hash='05513674c78bcf96' id='type-id-224'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' hash='41433aba07377a83' id='type-id-225'/>
    <qualified-type-def type-id='type-id-226' const='yes' hash='3e50fd33f9bb78d9' id='type-id-227'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' hash='c44743f354f6a443' id='type-id-228'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-201'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-204'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-208'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-206'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-196'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-239'/>
    <class-decl name='_GAsyncResult' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-240'/>
    <class-decl name='_GeeFuture' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-241'/>
    <class-decl name='_GeeHashable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-242'/>
    <typedef-decl name='GAsyncResult' type-id='type-id-240' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='36' column='1' id='type-id-234'/>
    <function-decl name='gee_concurrent_set_get_type' mangled-name='gee_concurrent_set_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/concurrentset.c' line='11800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_concurrent_set_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_deque_offer_head' mangled-name='gee_deque_offer_head' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_deque_offer_head' hash='388da3fa973fde78'>
      <parameter type-id='type-id-118' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='156' column='1'/>
      <parameter type-id='type-id-107' name='element' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='157' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_deque_peek_head' mangled-name='gee_deque_peek_head' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_deque_peek_head' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-118' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='75' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_deque_poll_head' mangled-name='gee_deque_poll_head' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_deque_poll_head' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-118' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='75' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_deque_drain_head' mangled-name='gee_deque_drain_head' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_deque_drain_head' hash='d628501fd2223339'>
      <parameter type-id='type-id-118' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='128' column='1'/>
      <parameter type-id='type-id-63' name='recipient' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='129' column='1'/>
      <parameter type-id='type-id-9' name='amount' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='130' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gee_deque_offer_tail' mangled-name='gee_deque_offer_tail' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_deque_offer_tail' hash='388da3fa973fde78'>
      <parameter type-id='type-id-118' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='156' column='1'/>
      <parameter type-id='type-id-107' name='element' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='157' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_deque_peek_tail' mangled-name='gee_deque_peek_tail' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_deque_peek_tail' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-118' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='75' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_deque_poll_tail' mangled-name='gee_deque_poll_tail' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_deque_poll_tail' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-118' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='75' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_deque_drain_tail' mangled-name='gee_deque_drain_tail' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_deque_drain_tail' hash='d628501fd2223339'>
      <parameter type-id='type-id-118' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='128' column='1'/>
      <parameter type-id='type-id-63' name='recipient' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='129' column='1'/>
      <parameter type-id='type-id-9' name='amount' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='130' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gee_deque_get_type' mangled-name='gee_deque_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/deque.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_deque_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_functions_get_equal_func_for' mangled-name='gee_functions_get_equal_func_for' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_functions_get_equal_func_for' hash='bb227780983b4c92'>
      <parameter type-id='type-id-15' name='t' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='509' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='510' column='1'/>
      <parameter type-id='type-id-243' name='result_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='511' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='gee_functions_get_hash_func_for' mangled-name='gee_functions_get_hash_func_for' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_functions_get_hash_func_for' hash='bb227780983b4c92'>
      <parameter type-id='type-id-15' name='t' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='701' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='702' column='1'/>
      <parameter type-id='type-id-243' name='result_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='703' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='gee_functions_get_compare_func_for' mangled-name='gee_functions_get_compare_func_for' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='933' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_functions_get_compare_func_for' hash='bb227780983b4c92'>
      <parameter type-id='type-id-15' name='t' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='933' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='934' column='1'/>
      <parameter type-id='type-id-243' name='result_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/functions.c' line='935' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='gee_future_wait' mangled-name='gee_future_wait' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_wait' hash='07dd3e6030b7e923'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='317' column='1'/>
      <parameter type-id='type-id-218' name='error' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='318' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='gee_future_wait_until' mangled-name='gee_future_wait_until' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_wait_until' hash='3ea1c71abe69f00f'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='347' column='1'/>
      <parameter type-id='type-id-244' name='end_time' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='348' column='1'/>
      <parameter type-id='type-id-29' name='value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='349' column='1'/>
      <parameter type-id='type-id-218' name='error' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='350' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_future_wait_async' mangled-name='gee_future_wait_async' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_wait_async' hash='5695f5ce05a4c55f'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='369' column='1'/>
      <parameter type-id='type-id-197' name='_callback_' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='370' column='1'/>
      <parameter type-id='type-id-19' name='_user_data_' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='371' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_future_wait_finish' mangled-name='gee_future_wait_finish' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_wait_finish' hash='07dd3e6030b7e923'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='385' column='1'/>
      <parameter type-id='type-id-235' name='_res_' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='386' column='1'/>
      <parameter type-id='type-id-218' name='error' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='387' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='gee_future_map' mangled-name='gee_future_map' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='653' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_map' hash='ca4e21e15b79ab12'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='653' column='1'/>
      <parameter type-id='type-id-15' name='a_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='654' column='1'/>
      <parameter type-id='type-id-16' name='a_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='655' column='1'/>
      <parameter type-id='type-id-17' name='a_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='656' column='1'/>
      <parameter type-id='type-id-207' name='func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='657' column='1'/>
      <parameter type-id='type-id-19' name='func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='658' column='1'/>
      <parameter type-id='type-id-17' name='func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='659' column='1'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='gee_future_light_map_fixed' mangled-name='gee_future_light_map_fixed' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_light_map_fixed' hash='ca4e21e15b79ab12'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='742' column='1'/>
      <parameter type-id='type-id-15' name='a_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='743' column='1'/>
      <parameter type-id='type-id-16' name='a_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='744' column='1'/>
      <parameter type-id='type-id-17' name='a_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='745' column='1'/>
      <parameter type-id='type-id-205' name='func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='746' column='1'/>
      <parameter type-id='type-id-19' name='func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='747' column='1'/>
      <parameter type-id='type-id-17' name='func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='748' column='1'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='gee_future_light_map' mangled-name='gee_future_light_map' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_light_map' hash='32110aebf860851c'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='786' column='1'/>
      <parameter type-id='type-id-15' name='a_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='787' column='1'/>
      <parameter type-id='type-id-16' name='a_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='788' column='1'/>
      <parameter type-id='type-id-17' name='a_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='789' column='1'/>
      <parameter type-id='type-id-205' name='func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='790' column='1'/>
      <parameter type-id='type-id-19' name='func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='791' column='1'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='gee_future_zip' mangled-name='gee_future_zip' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_zip' hash='f25e3ed57a5a7ce7'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='990' column='1'/>
      <parameter type-id='type-id-15' name='a_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='991' column='1'/>
      <parameter type-id='type-id-16' name='a_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='992' column='1'/>
      <parameter type-id='type-id-17' name='a_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='993' column='1'/>
      <parameter type-id='type-id-15' name='b_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='994' column='1'/>
      <parameter type-id='type-id-16' name='b_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='995' column='1'/>
      <parameter type-id='type-id-17' name='b_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='996' column='1'/>
      <parameter type-id='type-id-209' name='zip_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='997' column='1'/>
      <parameter type-id='type-id-19' name='zip_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='998' column='1'/>
      <parameter type-id='type-id-237' name='second' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='999' column='1'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='gee_future_flat_map' mangled-name='gee_future_flat_map' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_flat_map' hash='ca4e21e15b79ab12'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1437' column='1'/>
      <parameter type-id='type-id-15' name='a_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1438' column='1'/>
      <parameter type-id='type-id-16' name='a_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1439' column='1'/>
      <parameter type-id='type-id-17' name='a_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1440' column='1'/>
      <parameter type-id='type-id-203' name='func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1441' column='1'/>
      <parameter type-id='type-id-19' name='func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1442' column='1'/>
      <parameter type-id='type-id-17' name='func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1443' column='1'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='gee_future_get_value' mangled-name='gee_future_get_value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1787' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_get_value' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1787' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='gee_future_get_ready' mangled-name='gee_future_get_ready' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1864' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_get_ready' hash='388da3fa973fde78'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1864' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_future_get_exception' mangled-name='gee_future_get_exception' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1883' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_get_exception' hash='5a93fd810447fa83'>
      <parameter type-id='type-id-237' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='1883' column='1'/>
      <return type-id='type-id-192'/>
    </function-decl>
    <function-decl name='gee_future_get_type' mangled-name='gee_future_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='2097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_future_error_quark' mangled-name='gee_future_error_quark' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='2109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_error_quark' hash='2bb88322482ae81c'>
      <return type-id='type-id-170'/>
    </function-decl>
    <function-decl name='gee_future_error_get_type' mangled-name='gee_future_error_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/future.c' line='2124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_future_error_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <typedef-decl name='GeeFuture' type-id='type-id-241' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='426' column='1' id='type-id-236'/>
    <typedef-decl name='GeeHashable' type-id='type-id-242' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='440' column='1' id='type-id-238'/>
    <function-decl name='gee_hashable_hash' mangled-name='gee_hashable_hash' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashable.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hashable_hash' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-239' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashable.c' line='50' column='1'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='gee_hashable_equal_to' mangled-name='gee_hashable_equal_to' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashable.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hashable_equal_to' hash='388da3fa973fde78'>
      <parameter type-id='type-id-239' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashable.c' line='87' column='1'/>
      <parameter type-id='type-id-107' name='object' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashable.c' line='88' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_hashable_get_type' mangled-name='gee_hashable_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashable.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hashable_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_hash_map_construct' mangled-name='gee_hash_map_construct' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1042' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_map_construct' hash='750a510bd6a021c5'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1042' column='1'/>
      <parameter type-id='type-id-15' name='k_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1043' column='1'/>
      <parameter type-id='type-id-16' name='k_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1044' column='1'/>
      <parameter type-id='type-id-17' name='k_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1045' column='1'/>
      <parameter type-id='type-id-15' name='v_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1046' column='1'/>
      <parameter type-id='type-id-16' name='v_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1047' column='1'/>
      <parameter type-id='type-id-17' name='v_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1048' column='1'/>
      <parameter type-id='type-id-38' name='key_hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1049' column='1'/>
      <parameter type-id='type-id-19' name='key_hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1050' column='1'/>
      <parameter type-id='type-id-17' name='key_hash_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1051' column='1'/>
      <parameter type-id='type-id-18' name='key_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1052' column='1'/>
      <parameter type-id='type-id-19' name='key_equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1053' column='1'/>
      <parameter type-id='type-id-17' name='key_equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1054' column='1'/>
      <parameter type-id='type-id-18' name='value_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1055' column='1'/>
      <parameter type-id='type-id-19' name='value_equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1056' column='1'/>
      <parameter type-id='type-id-17' name='value_equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1057' column='1'/>
      <return type-id='type-id-222'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-220'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-237'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-229'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-129'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-230'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-107'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-231'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-232'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='6fe16b214fd52931' id='type-id-233'>
      <parameter type-id='type-id-219'/>
      <parameter type-id='type-id-235'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-119'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-245'>
      <parameter type-id='type-id-19' name='instance' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='1787' column='1'/>
      <return type-id='type-id-19'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-64d17' comp-dir-path='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee' language='LANG_C11'>
    <class-decl name='_GeeHashMultiMap' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1279' column='1' hash='652a3336cd1ea092' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-247' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priv' type-id='type-id-248' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1281' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHashMultiMapPrivate' is-struct='yes' visibility='default' size-in-bits='512' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='75' column='1' hash='337d01fd374368d2' id='type-id-249'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='k_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='k_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='k_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='v_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='v_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='v_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_value_hash_func' type-id='type-id-47' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_value_equal_func' type-id='type-id-32' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='83' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHashMultiSet' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1288' column='1' hash='86e3cb2a5488d982' id='type-id-250'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-251' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='priv' type-id='type-id-252' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1290' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHashMultiSetPrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='71' column='1' hash='17c60f97e593f400' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='74' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GeeHashMultiMap' type-id='type-id-246' size-in-bits='384' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='461' column='1' id='type-id-254'/>
    <typedef-decl name='GeeHashMultiMapPrivate' type-id='type-id-249' size-in-bits='512' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='463' column='1' id='type-id-255'/>
    <typedef-decl name='GeeHashMultiSet' type-id='type-id-250' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='472' column='1' id='type-id-256'/>
    <typedef-decl name='GeeHashMultiSetPrivate' type-id='type-id-253' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='474' column='1' id='type-id-257'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' hash='67f306dcbf32607d' id='type-id-258'/>
    <pointer-type-def type-id='type-id-255' size-in-bits='64' hash='f61d121720828a3f' id='type-id-248'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' hash='86864dc71ddfae9c' id='type-id-259'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' hash='38e59368485063b4' id='type-id-252'/>
    <class-decl name='_GeeAbstractMultiMapPrivate' is-struct='yes' visibility='default' size-in-bits='512' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultimap.c' line='212' column='1' hash='08e91d9ab7a7c237' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='k_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultimap.c' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='k_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultimap.c' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='k_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultimap.c' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='v_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultimap.c' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='v_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultimap.c' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='v_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultimap.c' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_nitems' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultimap.c' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_read_only_view' type-id='type-id-121' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultimap.c' line='220' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeAbstractMultiSetPrivate' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultiset.c' line='97' column='1' hash='1b3f2ef95b187164' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultiset.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultiset.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultiset.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_nitems' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultiset.c' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_read_only_view' type-id='type-id-121' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/abstractmultiset.c' line='102' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='gee_hash_map_new' mangled-name='gee_hash_map_new' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_map_new' hash='4027a1b72fbd06bc'>
      <parameter type-id='type-id-15' name='k_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1255' column='1'/>
      <parameter type-id='type-id-16' name='k_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1256' column='1'/>
      <parameter type-id='type-id-17' name='k_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1257' column='1'/>
      <parameter type-id='type-id-15' name='v_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1258' column='1'/>
      <parameter type-id='type-id-16' name='v_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1259' column='1'/>
      <parameter type-id='type-id-17' name='v_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1260' column='1'/>
      <parameter type-id='type-id-38' name='key_hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1261' column='1'/>
      <parameter type-id='type-id-19' name='key_hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1262' column='1'/>
      <parameter type-id='type-id-17' name='key_hash_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1263' column='1'/>
      <parameter type-id='type-id-18' name='key_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1264' column='1'/>
      <parameter type-id='type-id-19' name='key_equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1265' column='1'/>
      <parameter type-id='type-id-17' name='key_equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1266' column='1'/>
      <parameter type-id='type-id-18' name='value_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1267' column='1'/>
      <parameter type-id='type-id-19' name='value_equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1268' column='1'/>
      <parameter type-id='type-id-17' name='value_equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='1269' column='1'/>
      <return type-id='type-id-222'/>
    </function-decl>
    <function-decl name='gee_hash_map_get_key_hash_func' mangled-name='gee_hash_map_get_key_hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='2447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_map_get_key_hash_func' hash='41b2d61f1472f7fb'>
      <parameter type-id='type-id-222' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='2447' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='2448' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='gee_hash_map_get_key_equal_func' mangled-name='gee_hash_map_get_key_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='2488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_map_get_key_equal_func' hash='41b2d61f1472f7fb'>
      <parameter type-id='type-id-222' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='2488' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='2489' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='gee_hash_map_get_value_equal_func' mangled-name='gee_hash_map_get_value_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='2529' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_map_get_value_equal_func' hash='41b2d61f1472f7fb'>
      <parameter type-id='type-id-222' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='2488' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='2489' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='gee_hash_map_get_type' mangled-name='gee_hash_map_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmap.c' line='7290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_map_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_hash_multi_map_construct' mangled-name='gee_hash_multi_map_construct' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_map_construct' hash='3375130d34185d3a'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='236' column='1'/>
      <parameter type-id='type-id-15' name='k_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='237' column='1'/>
      <parameter type-id='type-id-16' name='k_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='238' column='1'/>
      <parameter type-id='type-id-17' name='k_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='239' column='1'/>
      <parameter type-id='type-id-15' name='v_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='240' column='1'/>
      <parameter type-id='type-id-16' name='v_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='241' column='1'/>
      <parameter type-id='type-id-17' name='v_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='242' column='1'/>
      <parameter type-id='type-id-38' name='key_hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='243' column='1'/>
      <parameter type-id='type-id-19' name='key_hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='244' column='1'/>
      <parameter type-id='type-id-17' name='key_hash_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='245' column='1'/>
      <parameter type-id='type-id-18' name='key_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='246' column='1'/>
      <parameter type-id='type-id-19' name='key_equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='247' column='1'/>
      <parameter type-id='type-id-17' name='key_equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='248' column='1'/>
      <parameter type-id='type-id-38' name='value_hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='249' column='1'/>
      <parameter type-id='type-id-19' name='value_hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='250' column='1'/>
      <parameter type-id='type-id-17' name='value_hash_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='251' column='1'/>
      <parameter type-id='type-id-18' name='value_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='252' column='1'/>
      <parameter type-id='type-id-19' name='value_equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='253' column='1'/>
      <parameter type-id='type-id-17' name='value_equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='254' column='1'/>
      <return type-id='type-id-258'/>
    </function-decl>
    <function-decl name='gee_hash_multi_map_new' mangled-name='gee_hash_multi_map_new' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_map_new' hash='881b6d5cd8f43ffb'>
      <parameter type-id='type-id-15' name='k_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='444' column='1'/>
      <parameter type-id='type-id-16' name='k_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='445' column='1'/>
      <parameter type-id='type-id-17' name='k_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='446' column='1'/>
      <parameter type-id='type-id-15' name='v_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='447' column='1'/>
      <parameter type-id='type-id-16' name='v_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='448' column='1'/>
      <parameter type-id='type-id-17' name='v_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='449' column='1'/>
      <parameter type-id='type-id-38' name='key_hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='450' column='1'/>
      <parameter type-id='type-id-19' name='key_hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='451' column='1'/>
      <parameter type-id='type-id-17' name='key_hash_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='452' column='1'/>
      <parameter type-id='type-id-18' name='key_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='453' column='1'/>
      <parameter type-id='type-id-19' name='key_equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='454' column='1'/>
      <parameter type-id='type-id-17' name='key_equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='455' column='1'/>
      <parameter type-id='type-id-38' name='value_hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='456' column='1'/>
      <parameter type-id='type-id-19' name='value_hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='457' column='1'/>
      <parameter type-id='type-id-17' name='value_hash_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='458' column='1'/>
      <parameter type-id='type-id-18' name='value_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='459' column='1'/>
      <parameter type-id='type-id-19' name='value_equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='460' column='1'/>
      <parameter type-id='type-id-17' name='value_equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='461' column='1'/>
      <return type-id='type-id-258'/>
    </function-decl>
    <function-decl name='gee_hash_multi_map_get_key_hash_func' mangled-name='gee_hash_multi_map_get_key_hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_map_get_key_hash_func' hash='cb82c534428fa5db'>
      <parameter type-id='type-id-258' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='580' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='581' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='gee_hash_multi_map_get_key_equal_func' mangled-name='gee_hash_multi_map_get_key_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_map_get_key_equal_func' hash='cb82c534428fa5db'>
      <parameter type-id='type-id-258' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='615' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='616' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='gee_hash_multi_map_get_value_hash_func' mangled-name='gee_hash_multi_map_get_value_hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_map_get_value_hash_func' hash='cb82c534428fa5db'>
      <parameter type-id='type-id-258' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='580' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='581' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='gee_hash_multi_map_get_value_equal_func' mangled-name='gee_hash_multi_map_get_value_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_map_get_value_equal_func' hash='cb82c534428fa5db'>
      <parameter type-id='type-id-258' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='615' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='616' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='gee_hash_multi_map_get_type' mangled-name='gee_hash_multi_map_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultimap.c' line='804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_map_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_hash_multi_set_construct' mangled-name='gee_hash_multi_set_construct' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_set_construct' hash='ba9c6779b6e109af'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='175' column='1'/>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='176' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='177' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='178' column='1'/>
      <parameter type-id='type-id-38' name='hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='179' column='1'/>
      <parameter type-id='type-id-19' name='hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='180' column='1'/>
      <parameter type-id='type-id-17' name='hash_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='181' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='182' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='183' column='1'/>
      <parameter type-id='type-id-17' name='equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='184' column='1'/>
      <return type-id='type-id-259'/>
    </function-decl>
    <function-decl name='gee_hash_multi_set_new_fixed' mangled-name='gee_hash_multi_set_new_fixed' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_set_new_fixed' hash='c944c4a0e0b40a96'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='255' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='256' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='257' column='1'/>
      <parameter type-id='type-id-38' name='hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='258' column='1'/>
      <parameter type-id='type-id-19' name='hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='259' column='1'/>
      <parameter type-id='type-id-17' name='hash_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='260' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='261' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='262' column='1'/>
      <parameter type-id='type-id-17' name='equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='263' column='1'/>
      <return type-id='type-id-259'/>
    </function-decl>
    <function-decl name='gee_hash_multi_set_construct_broken' mangled-name='gee_hash_multi_set_construct_broken' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_set_construct_broken' hash='ca008a7285a20f0d'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='284' column='1'/>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='285' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='286' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='287' column='1'/>
      <parameter type-id='type-id-38' name='hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='288' column='1'/>
      <parameter type-id='type-id-19' name='hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='289' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='290' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='291' column='1'/>
      <return type-id='type-id-259'/>
    </function-decl>
    <function-decl name='gee_hash_multi_set_new' mangled-name='gee_hash_multi_set_new' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_set_new' hash='0639d0b78c2c24a1'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='316' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='317' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='318' column='1'/>
      <parameter type-id='type-id-38' name='hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='319' column='1'/>
      <parameter type-id='type-id-19' name='hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='320' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='321' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='322' column='1'/>
      <return type-id='type-id-259'/>
    </function-decl>
    <function-decl name='gee_hash_multi_set_get_hash_func' mangled-name='gee_hash_multi_set_get_hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_set_get_hash_func' hash='bda1e61326d61ee4'>
      <parameter type-id='type-id-259' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='398' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='399' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='gee_hash_multi_set_get_equal_func' mangled-name='gee_hash_multi_set_get_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_set_get_equal_func' hash='bda1e61326d61ee4'>
      <parameter type-id='type-id-259' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='433' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='434' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='gee_hash_multi_set_get_type' mangled-name='gee_hash_multi_set_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashmultiset.c' line='511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_multi_set_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_hash_set_construct' mangled-name='gee_hash_set_construct' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_set_construct' hash='b4ce7ce84ccfe422'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='343' column='1'/>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='344' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='345' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='346' column='1'/>
      <parameter type-id='type-id-38' name='hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='347' column='1'/>
      <parameter type-id='type-id-19' name='hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='348' column='1'/>
      <parameter type-id='type-id-17' name='hash_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='349' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='350' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='351' column='1'/>
      <parameter type-id='type-id-17' name='equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='352' column='1'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <function-decl name='gee_hash_set_new' mangled-name='gee_hash_set_new' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='490' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_set_new' hash='25afed6d044fb4d2'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='490' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='491' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='492' column='1'/>
      <parameter type-id='type-id-38' name='hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='493' column='1'/>
      <parameter type-id='type-id-19' name='hash_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='494' column='1'/>
      <parameter type-id='type-id-17' name='hash_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='495' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='496' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='497' column='1'/>
      <parameter type-id='type-id-17' name='equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='498' column='1'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <function-decl name='gee_hash_set_get_hash_func' mangled-name='gee_hash_set_get_hash_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='1400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_set_get_hash_func' hash='b28d13d8689e8259'>
      <parameter type-id='type-id-102' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='1400' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='1401' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='gee_hash_set_get_equal_func' mangled-name='gee_hash_set_get_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='1441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_set_get_equal_func' hash='b28d13d8689e8259'>
      <parameter type-id='type-id-102' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='1441' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='1442' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='gee_hash_set_get_type' mangled-name='gee_hash_set_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hashset.c' line='2584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hash_set_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-777cb' comp-dir-path='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-226' size-in-bits='320' hash='e7f9696e246a3049' id='type-id-262'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-139' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='type-id-263'/>
    </array-type-def>
    <enum-decl name='GThreadPriority' naming-typedef-id='type-id-264' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='41' column='1' hash='598bf67cad362481' id='type-id-265'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='G_THREAD_PRIORITY_LOW' value='0'/>
      <enumerator name='G_THREAD_PRIORITY_NORMAL' value='1'/>
      <enumerator name='G_THREAD_PRIORITY_HIGH' value='2'/>
      <enumerator name='G_THREAD_PRIORITY_URGENT' value='3'/>
    </enum-decl>
    <enum-decl name='GeeHazardPointerReleasePolicy' naming-typedef-id='type-id-266' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='498' column='1' hash='4a1d6f85eac5b6ac' id='type-id-267'>
      <underlying-type type-id='type-id-3'/>
      <enumerator name='GEE_HAZARD_POINTER_RELEASE_POLICY_HELPER_THREAD' value='0'/>
      <enumerator name='GEE_HAZARD_POINTER_RELEASE_POLICY_MAIN_LOOP' value='1'/>
    </enum-decl>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='type-id-268'/>
    <class-decl name='GStaticMutex' is-struct='yes' naming-typedef-id='type-id-269' visibility='default' size-in-bits='384' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='135' column='1' hash='1cca716aac3dd163' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-271' visibility='default' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='unused' type-id='type-id-272' visibility='default' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='141' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GStaticPrivate' is-struct='yes' visibility='default' size-in-bits='32' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='246' column='1' hash='097f698f6226204c' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index' type-id='type-id-44' visibility='default' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='249' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GThread' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='48' column='1' hash='8cddc87840225d4c' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-275' visibility='default' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-19' visibility='default' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='joinable' type-id='type-id-129' visibility='default' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='priority' type-id='type-id-264' visibility='default' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHazardPointer' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1306' column='1' hash='cd13d392fc7c6313' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_node' type-id='type-id-277' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1307' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeHazardPointerNode' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='66' column='1' hash='11b4821187e0924c' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_next' type-id='type-id-277' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_active' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_hazard' type-id='type-id-279' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeLazyPrivate' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='77' column='1' hash='eb44505b6b603b7f' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_func' type-id='type-id-281' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_func_target' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_func_target_destroy_notify' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_value' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='84' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeLinkedList' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1327' column='1' hash='c641e303df2ae3b1' id='type-id-282'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-283' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='priv' type-id='type-id-284' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='1329' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeLinkedListNode' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='109' column='1' hash='1a7592bcd6ff376a' id='type-id-285'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-19' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-286' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-286' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='112' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GeeLinkedListPrivate' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='98' column='1' hash='32b5b239e8627f1e' id='type-id-287'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-15' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_dup_func' type-id='type-id-16' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_destroy_func' type-id='type-id-17' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_size' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='_stamp' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_head' type-id='type-id-286' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_tail' type-id='type-id-286' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_equal_func' type-id='type-id-32' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/thread-shared-types.h' line='51' column='1' hash='5bcfb7f1ab39fa47' id='type-id-288'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-289' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-289' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/bits/struct_mutex.h' line='22' column='1' hash='765d7e157ef2ec37' id='type-id-290'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-158' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-217' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-158' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-217' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-158' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-268' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-268' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-291' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GStaticMutex' type-id='type-id-270' size-in-bits='384' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='144' column='1' id='type-id-269'/>
    <typedef-decl name='GStaticPrivate' type-id='type-id-273' size-in-bits='32' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='245' column='1' id='type-id-292'/>
    <typedef-decl name='GThread' type-id='type-id-274' size-in-bits='192' filepath='/usr/include/glib-2.0/glib/gthread.h' line='51' column='1' id='type-id-293'/>
    <typedef-decl name='GThreadFunc' type-id='type-id-294' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gthread.h' line='49' column='1' hash='fd7a63c0c6c822c4' id='type-id-275'/>
    <typedef-decl name='GThreadPriority' type-id='type-id-265' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/glib/deprecated/gthread.h' line='46' column='1' hash='598bf67cad362481' id='type-id-264'/>
    <typedef-decl name='GeeHazardPointer' type-id='type-id-276' size-in-bits='64' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='486' column='1' id='type-id-295'/>
    <typedef-decl name='GeeHazardPointerNode' type-id='type-id-278' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='487' column='1' id='type-id-296'/>
    <typedef-decl name='GeeHazardPointerReleasePolicy' type-id='type-id-267' size-in-bits='32' alignment-in-bits='32' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='501' column='1' hash='4a1d6f85eac5b6ac' id='type-id-266'/>
    <typedef-decl name='GeeLazyFunc' type-id='type-id-294' size-in-bits='64' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='507' column='1' hash='fd7a63c0c6c822c4' id='type-id-281'/>
    <typedef-decl name='GeeLinkedList' type-id='type-id-282' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='517' column='1' id='type-id-297'/>
    <typedef-decl name='GeeLinkedListNode' type-id='type-id-285' size-in-bits='192' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='44' column='1' id='type-id-298'/>
    <typedef-decl name='GeeLinkedListPrivate' type-id='type-id-287' size-in-bits='448' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='519' column='1' id='type-id-299'/>
    <typedef-decl name='GeeUnfoldFunc' type-id='type-id-300' size-in-bits='64' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='506' column='1' hash='fd7a63c0c6c822c4' id='type-id-301'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-288' size-in-bits='128' filepath='/usr/include/bits/thread-shared-types.h' line='55' column='1' id='type-id-291'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-302' size-in-bits='320' filepath='/usr/include/bits/pthreadtypes.h' line='72' column='1' id='type-id-272'/>
    <union-decl name='pthread_mutex_t' naming-typedef-id='type-id-272' visibility='default' size-in-bits='320' filepath='/usr/include/bits/pthreadtypes.h' line='67' column='1' hash='8e3e5ddbcaed875f' id='type-id-302'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-290' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-262' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-303' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' hash='4e2a61282d97f55f' id='type-id-304'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' hash='ff5d7c6783615906' id='type-id-271'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' hash='ac0159801d353eed' id='type-id-305'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' hash='456ec6f4992075df' id='type-id-306'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' hash='4f0d9209dc2d29fb' id='type-id-307'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' hash='81b74ac702c4255f' id='type-id-308'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' hash='ada7559c145ec84f' id='type-id-309'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' hash='7dbaaf79be32fbda' id='type-id-277'/>
    <pointer-type-def type-id='type-id-310' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-300'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' hash='8660fd2aeaf3d4fe' id='type-id-311'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' hash='81e4019e5d0dc8d3' id='type-id-286'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' hash='3251bdeaccf687a6' id='type-id-284'/>
    <pointer-type-def type-id='type-id-288' size-in-bits='64' hash='b83eb2deac70d470' id='type-id-289'/>
    <qualified-type-def type-id='type-id-312' const='yes' hash='5579a3cec125e90f' id='type-id-313'/>
    <pointer-type-def type-id='type-id-313' size-in-bits='64' hash='5b0604936bdf7526' id='type-id-314'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-318'/>
    <class-decl name='_GTask' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-319'/>
    <class-decl name='_GeeQueue' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-320'/>
    <typedef-decl name='GTask' type-id='type-id-319' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='145' column='1' id='type-id-315'/>
    <typedef-decl name='GeeQueue' type-id='type-id-320' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/gee.h' line='338' column='1' id='type-id-317'/>
    <var-decl name='gee_hazard_pointer__head' type-id='type-id-277' mangled-name='gee_hazard_pointer__head' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='79' column='1' elf-symbol-id='gee_hazard_pointer__head'/>
    <var-decl name='gee_hazard_pointer__default_policy' type-id='type-id-9' mangled-name='gee_hazard_pointer__default_policy' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='80' column='1' elf-symbol-id='gee_hazard_pointer__default_policy'/>
    <var-decl name='gee_hazard_pointer__thread_exit_policy' type-id='type-id-9' mangled-name='gee_hazard_pointer__thread_exit_policy' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='81' column='1' elf-symbol-id='gee_hazard_pointer__thread_exit_policy'/>
    <var-decl name='gee_hazard_pointer_release_policy' type-id='type-id-9' mangled-name='gee_hazard_pointer_release_policy' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='82' column='1' elf-symbol-id='gee_hazard_pointer_release_policy'/>
    <var-decl name='gee_hazard_pointer__queue' type-id='type-id-318' mangled-name='gee_hazard_pointer__queue' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='83' column='1' elf-symbol-id='gee_hazard_pointer__queue'/>
    <var-decl name='gee_hazard_pointer__queue_mutex' type-id='type-id-269' mangled-name='gee_hazard_pointer__queue_mutex' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='84' column='1' elf-symbol-id='gee_hazard_pointer__queue_mutex'/>
    <var-decl name='gee_hazard_pointer__global_to_free' type-id='type-id-50' mangled-name='gee_hazard_pointer__global_to_free' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='85' column='1' elf-symbol-id='gee_hazard_pointer__global_to_free'/>
    <var-decl name='gee_hazard_pointer_context__current_context' type-id='type-id-292' mangled-name='gee_hazard_pointer_context__current_context' visibility='default' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='88' column='1' elf-symbol-id='gee_hazard_pointer_context__current_context'/>
    <function-decl name='gee_hazard_pointer_policy_is_concrete' mangled-name='gee_hazard_pointer_policy_is_concrete' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_policy_is_concrete' hash='e88f0406b796fce3'>
      <parameter type-id='type-id-1' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='151' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_policy_is_blocking' mangled-name='gee_hazard_pointer_policy_is_blocking' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_policy_is_blocking' hash='e88f0406b796fce3'>
      <parameter type-id='type-id-1' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='151' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_policy_is_safe' mangled-name='gee_hazard_pointer_policy_is_safe' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_policy_is_safe' hash='e88f0406b796fce3'>
      <parameter type-id='type-id-1' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='151' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_policy_to_concrete' mangled-name='gee_hazard_pointer_policy_to_concrete' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_policy_to_concrete' hash='cddfa92d1b1ee18e'>
      <parameter type-id='type-id-1' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='293' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_policy_get_type' mangled-name='gee_hazard_pointer_policy_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_policy_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_release_policy_get_type' mangled-name='gee_hazard_pointer_release_policy_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='898' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_release_policy_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_new' mangled-name='gee_hazard_pointer_new' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='915' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_new' hash='9bbc2788252e14ea'>
      <parameter type-id='type-id-29' name='ptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='915' column='1'/>
      <return type-id='type-id-309'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_get_hazard_pointer' mangled-name='gee_hazard_pointer_get_hazard_pointer' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='966' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_get_hazard_pointer' hash='5144db6058ff3170'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='966' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='967' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='968' column='1'/>
      <parameter type-id='type-id-108' name='aptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='969' column='1'/>
      <parameter type-id='type-id-112' name='mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='970' column='1'/>
      <parameter type-id='type-id-113' name='mask_out' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='971' column='1'/>
      <return type-id='type-id-309'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_get_pointer' mangled-name='gee_hazard_pointer_get_pointer' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_get_pointer' hash='b85846583a98d881'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1093' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1094' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1095' column='1'/>
      <parameter type-id='type-id-108' name='aptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1096' column='1'/>
      <parameter type-id='type-id-112' name='mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1097' column='1'/>
      <parameter type-id='type-id-113' name='mask_out' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1098' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_exchange_hazard_pointer' mangled-name='gee_hazard_pointer_exchange_hazard_pointer' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_exchange_hazard_pointer' hash='20a0e9d6046400b4'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1206' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1207' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1208' column='1'/>
      <parameter type-id='type-id-108' name='aptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1209' column='1'/>
      <parameter type-id='type-id-19' name='new_ptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1210' column='1'/>
      <parameter type-id='type-id-112' name='mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1211' column='1'/>
      <parameter type-id='type-id-112' name='new_mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1212' column='1'/>
      <parameter type-id='type-id-113' name='old_mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1213' column='1'/>
      <return type-id='type-id-309'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_set_pointer' mangled-name='gee_hazard_pointer_set_pointer' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_set_pointer' hash='0755d108d50d2cb3'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1378' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1379' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1380' column='1'/>
      <parameter type-id='type-id-108' name='aptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1381' column='1'/>
      <parameter type-id='type-id-19' name='new_ptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1382' column='1'/>
      <parameter type-id='type-id-112' name='mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1383' column='1'/>
      <parameter type-id='type-id-112' name='new_mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1384' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_exchange_pointer' mangled-name='gee_hazard_pointer_exchange_pointer' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_exchange_pointer' hash='c066cfdb77fe90ab'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1444' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1445' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1446' column='1'/>
      <parameter type-id='type-id-108' name='aptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1447' column='1'/>
      <parameter type-id='type-id-19' name='new_ptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1448' column='1'/>
      <parameter type-id='type-id-112' name='mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1449' column='1'/>
      <parameter type-id='type-id-112' name='new_mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1450' column='1'/>
      <parameter type-id='type-id-113' name='old_mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1451' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_compare_and_exchange_pointer' mangled-name='gee_hazard_pointer_compare_and_exchange_pointer' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1522' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_compare_and_exchange_pointer' hash='eba21dfbbad89aa7'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1522' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1523' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1524' column='1'/>
      <parameter type-id='type-id-108' name='aptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1525' column='1'/>
      <parameter type-id='type-id-107' name='old_ptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1526' column='1'/>
      <parameter type-id='type-id-19' name='_new_ptr' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1527' column='1'/>
      <parameter type-id='type-id-112' name='mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1528' column='1'/>
      <parameter type-id='type-id-112' name='old_mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1529' column='1'/>
      <parameter type-id='type-id-112' name='new_mask' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1530' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_get' mangled-name='gee_hazard_pointer_get' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1633' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_get' hash='6715c6fd9041be61'>
      <parameter type-id='type-id-309' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1633' column='1'/>
      <parameter type-id='type-id-129' name='other_thread' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1634' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_release' mangled-name='gee_hazard_pointer_release' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_release' hash='b6b8ca3c34b474b6'>
      <parameter type-id='type-id-309' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1658' column='1'/>
      <parameter type-id='type-id-17' name='notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1659' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_set_default_policy' mangled-name='gee_hazard_pointer_set_default_policy' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_set_default_policy' hash='5e7e9539ef03ecd0'>
      <parameter type-id='type-id-1' name='policy' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1707' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_set_thread_exit_policy' mangled-name='gee_hazard_pointer_set_thread_exit_policy' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1729' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_set_thread_exit_policy' hash='5e7e9539ef03ecd0'>
      <parameter type-id='type-id-1' name='policy' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1707' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_set_release_policy' mangled-name='gee_hazard_pointer_set_release_policy' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_set_release_policy' hash='9029c970dbfd69e5'>
      <parameter type-id='type-id-266' name='policy' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='1752' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_context_new' mangled-name='gee_hazard_pointer_context_new' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_context_new' hash='e615c213a30bc45a'>
      <parameter type-id='type-id-51' name='policy' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2163' column='1'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_context_try_free' mangled-name='gee_hazard_pointer_context_try_free' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_context_try_free' hash='2e74a2be97fce5ac'>
      <parameter type-id='type-id-49' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2442' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_context_free_all' mangled-name='gee_hazard_pointer_context_free_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_context_free_all' hash='2e74a2be97fce5ac'>
      <parameter type-id='type-id-49' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2442' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_context_try_release' mangled-name='gee_hazard_pointer_context_try_release' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_context_try_release' hash='2e74a2be97fce5ac'>
      <parameter type-id='type-id-49' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2442' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_context_release' mangled-name='gee_hazard_pointer_context_release' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_context_release' hash='2e74a2be97fce5ac'>
      <parameter type-id='type-id-49' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2442' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_context_free' mangled-name='gee_hazard_pointer_context_free' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_context_free' hash='2e74a2be97fce5ac'>
      <parameter type-id='type-id-49' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2442' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_hazard_pointer_free' mangled-name='gee_hazard_pointer_free' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_hazard_pointer_free' hash='de6dfb0f78d90823'>
      <parameter type-id='type-id-309' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/hazardpointer.c' line='2731' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_iterable_iterator' mangled-name='gee_iterable_iterator' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterable.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_iterable_iterator' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-321' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterable.c' line='49' column='1'/>
      <return type-id='type-id-136'/>
    </function-decl>
    <function-decl name='gee_iterable_get_type' mangled-name='gee_iterable_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterable.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_iterable_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_iterator_next' mangled-name='gee_iterator_next' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_iterator_next' hash='388da3fa973fde78'>
      <parameter type-id='type-id-136' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='458' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_iterator_has_next' mangled-name='gee_iterator_has_next' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_iterator_has_next' hash='388da3fa973fde78'>
      <parameter type-id='type-id-136' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='458' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_iterator_get' mangled-name='gee_iterator_get' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_iterator_get' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-136' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='141' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_iterator_remove' mangled-name='gee_iterator_remove' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_iterator_remove' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-136' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='165' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_iterator_unfold' mangled-name='gee_iterator_unfold' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_iterator_unfold' hash='cc263daf0223a571'>
      <parameter type-id='type-id-15' name='a_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='188' column='1'/>
      <parameter type-id='type-id-16' name='a_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='189' column='1'/>
      <parameter type-id='type-id-17' name='a_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='190' column='1'/>
      <parameter type-id='type-id-301' name='f' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='191' column='1'/>
      <parameter type-id='type-id-19' name='f_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='192' column='1'/>
      <parameter type-id='type-id-17' name='f_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='193' column='1'/>
      <parameter type-id='type-id-322' name='current' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='194' column='1'/>
      <return type-id='type-id-136'/>
    </function-decl>
    <function-decl name='gee_iterator_concat' mangled-name='gee_iterator_concat' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='378' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_iterator_concat' hash='464ac63c8856dbba'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='378' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='379' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='380' column='1'/>
      <parameter type-id='type-id-136' name='iters' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='381' column='1'/>
      <return type-id='type-id-136'/>
    </function-decl>
    <function-decl name='gee_iterator_get_valid' mangled-name='gee_iterator_get_valid' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_iterator_get_valid' hash='388da3fa973fde78'>
      <parameter type-id='type-id-136' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='458' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_iterator_get_read_only' mangled-name='gee_iterator_get_read_only' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_iterator_get_read_only' hash='388da3fa973fde78'>
      <parameter type-id='type-id-136' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='458' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_iterator_get_type' mangled-name='gee_iterator_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/iterator.c' line='525' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_iterator_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_lazy_construct' mangled-name='gee_lazy_construct' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_lazy_construct' hash='1541de69aa1be5da'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='208' column='1'/>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='209' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='210' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='211' column='1'/>
      <parameter type-id='type-id-281' name='func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='212' column='1'/>
      <parameter type-id='type-id-19' name='func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='213' column='1'/>
      <parameter type-id='type-id-17' name='func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='214' column='1'/>
      <return type-id='type-id-322'/>
    </function-decl>
    <function-decl name='gee_lazy_new' mangled-name='gee_lazy_new' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_lazy_new' hash='0339894823b885e7'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='268' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='269' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='270' column='1'/>
      <parameter type-id='type-id-281' name='func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='271' column='1'/>
      <parameter type-id='type-id-19' name='func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='272' column='1'/>
      <parameter type-id='type-id-17' name='func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='273' column='1'/>
      <return type-id='type-id-322'/>
    </function-decl>
    <function-decl name='gee_lazy_construct_from_value' mangled-name='gee_lazy_construct_from_value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_lazy_construct_from_value' hash='5ad2bac280a940f9'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='281' column='1'/>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='282' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='283' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='284' column='1'/>
      <parameter type-id='type-id-107' name='item' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='285' column='1'/>
      <return type-id='type-id-322'/>
    </function-decl>
    <function-decl name='gee_lazy_new_from_value' mangled-name='gee_lazy_new_from_value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_lazy_new_from_value' hash='cb39421fcecadd82'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='309' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='310' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='311' column='1'/>
      <parameter type-id='type-id-107' name='item' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='312' column='1'/>
      <return type-id='type-id-322'/>
    </function-decl>
    <function-decl name='gee_lazy_eval' mangled-name='gee_lazy_eval' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_lazy_eval' hash='1de4a8faa7f395e2'>
      <parameter type-id='type-id-322' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='320' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_lazy_get' mangled-name='gee_lazy_get' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_lazy_get' hash='1de4a8faa7f395e2'>
      <parameter type-id='type-id-322' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='365' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_lazy_get_value' mangled-name='gee_lazy_get_value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_lazy_get_value' hash='1de4a8faa7f395e2'>
      <parameter type-id='type-id-322' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='386' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='gee_lazy_get_future' mangled-name='gee_lazy_get_future' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_lazy_get_future' hash='1de4a8faa7f395e2'>
      <parameter type-id='type-id-322' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='404' column='1'/>
      <return type-id='type-id-237'/>
    </function-decl>
    <function-decl name='gee_param_spec_lazy' mangled-name='gee_param_spec_lazy' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='1396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_param_spec_lazy' hash='6d0441d7d6a9df59'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-323'/>
      <return type-id='type-id-324'/>
    </function-decl>
    <function-decl name='gee_value_get_lazy' mangled-name='gee_value_get_lazy' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='1415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_value_get_lazy' hash='fe8357e11df9e46f'>
      <parameter type-id='type-id-314' name='value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='1415' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_value_set_lazy' mangled-name='gee_value_set_lazy' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='1425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_value_set_lazy' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_value_take_lazy' mangled-name='gee_value_take_lazy' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='1458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_value_take_lazy' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_lazy_get_type' mangled-name='gee_lazy_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='1551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_lazy_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_lazy_ref' mangled-name='gee_lazy_ref' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='1563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_lazy_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-19' name='instance' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/promise.c' line='1787' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_lazy_unref' mangled-name='gee_lazy_unref' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/lazy.c' line='1575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_lazy_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_linked_list_construct' mangled-name='gee_linked_list_construct' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_linked_list_construct' hash='e8a01b1d56cf918c'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='337' column='1'/>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='338' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='339' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='340' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='341' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='342' column='1'/>
      <parameter type-id='type-id-17' name='equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='343' column='1'/>
      <return type-id='type-id-311'/>
    </function-decl>
    <function-decl name='gee_linked_list_new' mangled-name='gee_linked_list_new' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='414' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_linked_list_new' hash='3d756d039164e63c'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='414' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='415' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='416' column='1'/>
      <parameter type-id='type-id-18' name='equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='417' column='1'/>
      <parameter type-id='type-id-19' name='equal_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='418' column='1'/>
      <parameter type-id='type-id-17' name='equal_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='419' column='1'/>
      <return type-id='type-id-311'/>
    </function-decl>
    <function-decl name='gee_linked_list_first' mangled-name='gee_linked_list_first' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='1349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_linked_list_first' hash='ce47477419a14174'>
      <parameter type-id='type-id-311' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='1349' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_linked_list_last' mangled-name='gee_linked_list_last' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='1376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_linked_list_last' hash='ce47477419a14174'>
      <parameter type-id='type-id-311' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='1349' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_linked_list_get_equal_func' mangled-name='gee_linked_list_get_equal_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='2077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_linked_list_get_equal_func' hash='516766ad71d4f77b'>
      <parameter type-id='type-id-311' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='2077' column='1'/>
      <parameter type-id='type-id-20' name='result_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='2078' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='gee_linked_list_get_type' mangled-name='gee_linked_list_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/linkedlist.c' line='4239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_linked_list_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_list_list_iterator' mangled-name='gee_list_list_iterator' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_list_iterator' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='64' column='1'/>
      <return type-id='type-id-327'/>
    </function-decl>
    <function-decl name='gee_list_get' mangled-name='gee_list_get' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_get' hash='388da3fa973fde78'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='90' column='1'/>
      <parameter type-id='type-id-9' name='index' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='91' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_list_set' mangled-name='gee_list_set' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_set' hash='388da3fa973fde78'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='115' column='1'/>
      <parameter type-id='type-id-9' name='index' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='116' column='1'/>
      <parameter type-id='type-id-107' name='item' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='117' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_list_index_of' mangled-name='gee_list_index_of' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_index_of' hash='388da3fa973fde78'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='140' column='1'/>
      <parameter type-id='type-id-107' name='item' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='141' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gee_list_insert' mangled-name='gee_list_insert' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_insert' hash='388da3fa973fde78'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='115' column='1'/>
      <parameter type-id='type-id-9' name='index' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='116' column='1'/>
      <parameter type-id='type-id-107' name='item' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='117' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_list_remove_at' mangled-name='gee_list_remove_at' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_remove_at' hash='388da3fa973fde78'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='90' column='1'/>
      <parameter type-id='type-id-9' name='index' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='91' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_list_slice' mangled-name='gee_list_slice' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_slice' hash='d628501fd2223339'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='219' column='1'/>
      <parameter type-id='type-id-9' name='start' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='220' column='1'/>
      <parameter type-id='type-id-9' name='stop' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='221' column='1'/>
      <return type-id='type-id-326'/>
    </function-decl>
    <function-decl name='gee_list_first' mangled-name='gee_list_first' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_first' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='259' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_list_last' mangled-name='gee_list_last' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_last' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='259' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_list_insert_all' mangled-name='gee_list_insert_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_insert_all' hash='388da3fa973fde78'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='385' column='1'/>
      <parameter type-id='type-id-9' name='index' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='386' column='1'/>
      <parameter type-id='type-id-63' name='collection' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='387' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_list_sort' mangled-name='gee_list_sort' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_sort' hash='e7946129631a25a2'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='451' column='1'/>
      <parameter type-id='type-id-35' name='compare_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='452' column='1'/>
      <parameter type-id='type-id-19' name='compare_func_target' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='453' column='1'/>
      <parameter type-id='type-id-17' name='compare_func_target_destroy_notify' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='454' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_list_empty' mangled-name='gee_list_empty' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_empty' hash='464ac63c8856dbba'>
      <parameter type-id='type-id-15' name='g_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='475' column='1'/>
      <parameter type-id='type-id-16' name='g_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='476' column='1'/>
      <parameter type-id='type-id-17' name='g_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='477' column='1'/>
      <return type-id='type-id-326'/>
    </function-decl>
    <function-decl name='gee_list_get_read_only_view' mangled-name='gee_list_get_read_only_view' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_get_read_only_view' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-326' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='505' column='1'/>
      <return type-id='type-id-326'/>
    </function-decl>
    <function-decl name='gee_list_get_type' mangled-name='gee_list_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/list.c' line='557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_list_iterator_set' mangled-name='gee_list_iterator_set' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/listiterator.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_iterator_set' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-327' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/listiterator.c' line='45' column='1'/>
      <parameter type-id='type-id-107' name='item' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/listiterator.c' line='46' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_list_iterator_add' mangled-name='gee_list_iterator_add' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/listiterator.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_iterator_add' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-327' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/listiterator.c' line='45' column='1'/>
      <parameter type-id='type-id-107' name='item' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/listiterator.c' line='46' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_list_iterator_index' mangled-name='gee_list_iterator_index' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/listiterator.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_iterator_index' hash='388da3fa973fde78'>
      <parameter type-id='type-id-327' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/listiterator.c' line='91' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gee_list_iterator_get_type' mangled-name='gee_list_iterator_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/listiterator.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_list_iterator_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_map_has_key' mangled-name='gee_map_has_key' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_has_key' hash='388da3fa973fde78'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='92' column='1'/>
      <parameter type-id='type-id-107' name='key' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='93' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_contains' mangled-name='gee_map_contains' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_contains' hash='388da3fa973fde78'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='92' column='1'/>
      <parameter type-id='type-id-107' name='key' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='93' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_has' mangled-name='gee_map_has' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_has' hash='388da3fa973fde78'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='139' column='1'/>
      <parameter type-id='type-id-107' name='key' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='140' column='1'/>
      <parameter type-id='type-id-107' name='value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='141' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_get' mangled-name='gee_map_get' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_get' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='168' column='1'/>
      <parameter type-id='type-id-107' name='key' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='169' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='gee_map_set' mangled-name='gee_map_set' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_set' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='194' column='1'/>
      <parameter type-id='type-id-107' name='key' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='195' column='1'/>
      <parameter type-id='type-id-107' name='value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='196' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_map_unset' mangled-name='gee_map_unset' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_unset' hash='30589b15fc730e93'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='220' column='1'/>
      <parameter type-id='type-id-107' name='key' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='221' column='1'/>
      <parameter type-id='type-id-20' name='value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='222' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_remove' mangled-name='gee_map_remove' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_remove' hash='30589b15fc730e93'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='220' column='1'/>
      <parameter type-id='type-id-107' name='key' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='221' column='1'/>
      <parameter type-id='type-id-20' name='value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='222' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_clear' mangled-name='gee_map_clear' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_clear' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='285' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_map_map_iterator' mangled-name='gee_map_map_iterator' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_map_iterator' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='306' column='1'/>
      <return type-id='type-id-329'/>
    </function-decl>
    <function-decl name='gee_map_set_all' mangled-name='gee_map_set_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='409' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_set_all' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='409' column='1'/>
      <parameter type-id='type-id-328' name='map' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='410' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_map_unset_all' mangled-name='gee_map_unset_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_unset_all' hash='388da3fa973fde78'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='505' column='1'/>
      <parameter type-id='type-id-328' name='map' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='506' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_remove_all' mangled-name='gee_map_remove_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_remove_all' hash='388da3fa973fde78'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='505' column='1'/>
      <parameter type-id='type-id-328' name='map' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='506' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_has_all' mangled-name='gee_map_has_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_has_all' hash='388da3fa973fde78'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='505' column='1'/>
      <parameter type-id='type-id-328' name='map' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='506' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_contains_all' mangled-name='gee_map_contains_all' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_contains_all' hash='388da3fa973fde78'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='505' column='1'/>
      <parameter type-id='type-id-328' name='map' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='506' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_empty' mangled-name='gee_map_empty' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_empty' hash='9f67f38eab594b33'>
      <parameter type-id='type-id-15' name='k_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='691' column='1'/>
      <parameter type-id='type-id-16' name='k_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='692' column='1'/>
      <parameter type-id='type-id-17' name='k_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='693' column='1'/>
      <parameter type-id='type-id-15' name='v_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='694' column='1'/>
      <parameter type-id='type-id-16' name='v_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='695' column='1'/>
      <parameter type-id='type-id-17' name='v_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='696' column='1'/>
      <return type-id='type-id-328'/>
    </function-decl>
    <function-decl name='gee_map_get_size' mangled-name='gee_map_get_size' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='724' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_get_size' hash='388da3fa973fde78'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='724' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='gee_map_get_is_empty' mangled-name='gee_map_get_is_empty' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='743' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_get_is_empty' hash='388da3fa973fde78'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='743' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_get_read_only' mangled-name='gee_map_get_read_only' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='782' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_get_read_only' hash='388da3fa973fde78'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='743' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_get_keys' mangled-name='gee_map_get_keys' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_get_keys' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='801' column='1'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='gee_map_get_values' mangled-name='gee_map_get_values' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_get_values' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='820' column='1'/>
      <return type-id='type-id-63'/>
    </function-decl>
    <function-decl name='gee_map_get_entries' mangled-name='gee_map_get_entries' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='839' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_get_entries' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='801' column='1'/>
      <return type-id='type-id-184'/>
    </function-decl>
    <function-decl name='gee_map_get_read_only_view' mangled-name='gee_map_get_read_only_view' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='858' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_get_read_only_view' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='858' column='1'/>
      <return type-id='type-id-328'/>
    </function-decl>
    <function-decl name='gee_map_get_key_type' mangled-name='gee_map_get_key_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='877' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_get_key_type' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='877' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_map_get_value_type' mangled-name='gee_map_get_value_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='890' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_get_value_type' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-328' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='877' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_map_entry_construct' mangled-name='gee_map_entry_construct' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='909' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_entry_construct' hash='dad47d699ee80bfb'>
      <parameter type-id='type-id-15' name='object_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='909' column='1'/>
      <parameter type-id='type-id-15' name='k_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='910' column='1'/>
      <parameter type-id='type-id-16' name='k_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='911' column='1'/>
      <parameter type-id='type-id-17' name='k_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='912' column='1'/>
      <parameter type-id='type-id-15' name='v_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='913' column='1'/>
      <parameter type-id='type-id-16' name='v_dup_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='914' column='1'/>
      <parameter type-id='type-id-17' name='v_destroy_func' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='915' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='gee_map_entry_get_key' mangled-name='gee_map_entry_get_key' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='938' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_entry_get_key' hash='287b5d77d552fcee'>
      <parameter type-id='type-id-60' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='938' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='gee_map_entry_get_value' mangled-name='gee_map_entry_get_value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='957' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_entry_get_value' hash='287b5d77d552fcee'>
      <parameter type-id='type-id-60' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='938' column='1'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='gee_map_entry_set_value' mangled-name='gee_map_entry_set_value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='976' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_entry_set_value' hash='287b5d77d552fcee'>
      <parameter type-id='type-id-60' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='976' column='1'/>
      <parameter type-id='type-id-107' name='value' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='977' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='gee_map_entry_get_read_only' mangled-name='gee_map_entry_get_read_only' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='993' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_entry_get_read_only' hash='0e1449e753c8e14c'>
      <parameter type-id='type-id-60' name='self' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='993' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='gee_map_entry_get_type' mangled-name='gee_map_entry_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='1079' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_entry_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='gee_map_get_type' mangled-name='gee_map_get_type' filepath='/usr/src/debug/libgee-0.20.8-2.fc43.x86_64/gee/map.c' line='1268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gee_map_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-type size-in-bits='64' hash='1de4a8faa7f395e2' id='type-id-310'>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-322'/>
    </function-type>
    <function-type size-in-bits='64' hash='fe8357e11df9e46f' id='type-id-330'>
