<abi-corpus version='2.4' architecture='elf-amd-x86_64' soname='libgobject-2.0.so.0'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libffi.so.8'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='g_array_get_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_binding_dup_source' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_binding_dup_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_binding_flags_get_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_binding_get_flags' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_binding_get_source' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_binding_get_source_property' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_binding_get_target' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ffi_type_double' version='LIBFFI_BASE_8.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ffi_type_float' version='LIBFFI_BASE_8.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ffi_type_pointer' version='LIBFFI_BASE_8.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ffi_type_sint32' version='LIBFFI_BASE_8.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ffi_type_sint64' version='LIBFFI_BASE_8.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ffi_type_uint32' version='LIBFFI_BASE_8.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ffi_type_uint64' version='LIBFFI_BASE_8.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ffi_type_void' version='LIBFFI_BASE_8.0' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_child_watch_funcs' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_idle_funcs' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_io_watch_funcs' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_timeout_funcs' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_unix_fd_source_funcs' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_unix_signal_funcs' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='../gobject/gbinding.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_atomic_rc_box_alloc0' filepath='../glib/grcbox.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_atomic_rc_box_alloc0' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_atomic_rc_box_acquire' filepath='../glib/grcbox.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_atomic_rc_box_acquire' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_atomic_rc_box_release_full' filepath='../glib/grcbox.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_atomic_rc_box_release_full' hash='5695f5ce05a4c55f'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_strcmp0' filepath='../glib/gtestutils.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strcmp0' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' hash='d731989df7e70156' id='type-id-7'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='fe8357e11df9e46f' id='type-id-10'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-12'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' hash='cbc7d8889754444d' id='type-id-13'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gbindinggroup.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GBinding' is-struct='yes' visibility='default' size-in-bits='832' filepath='../gobject/gbinding.c' line='236' column='1' hash='5eb98799276f412c' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-18' visibility='default' filepath='../gobject/gbinding.c' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='context' type-id='type-id-19' visibility='default' filepath='../gobject/gbinding.c' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='unbind_lock' type-id='type-id-20' visibility='default' filepath='../gobject/gbinding.c' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='transform_func' type-id='type-id-21' visibility='default' filepath='../gobject/gbinding.c' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='source_property' type-id='type-id-8' visibility='default' filepath='../gobject/gbinding.c' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='target_property' type-id='type-id-8' visibility='default' filepath='../gobject/gbinding.c' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='source_pspec' type-id='type-id-22' visibility='default' filepath='../gobject/gbinding.c' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='target_pspec' type-id='type-id-22' visibility='default' filepath='../gobject/gbinding.c' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='flags' type-id='type-id-23' visibility='default' filepath='../gobject/gbinding.c' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='source_notify' type-id='type-id-16' visibility='default' filepath='../gobject/gbinding.c' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='target_notify' type-id='type-id-16' visibility='default' filepath='../gobject/gbinding.c' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='target_weak_notify_installed' type-id='type-id-9' visibility='default' filepath='../gobject/gbinding.c' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='is_frozen' type-id='type-id-16' visibility='default' filepath='../gobject/gbinding.c' line='264' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_ptr_array_steal' filepath='../glib/garray.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_steal' hash='0780a089a581f14c'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_ptr_array_steal_index_fast' filepath='../glib/garray.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_steal_index_fast' hash='c2f4fddf0cb60960'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gboxed.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <enum-decl name='GThreadPriority' naming-typedef-id='type-id-27' size-in-bits='32' alignment-in-bits='32' filepath='../glib/deprecated/gthread.h' line='41' column='1' hash='598bf67cad362481' id='type-id-28'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_THREAD_PRIORITY_LOW' value='0'/>
      <enumerator name='G_THREAD_PRIORITY_NORMAL' value='1'/>
      <enumerator name='G_THREAD_PRIORITY_HIGH' value='2'/>
      <enumerator name='G_THREAD_PRIORITY_URGENT' value='3'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-30' size-in-bits='896' hash='6935992bffa28efe' id='type-id-31'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='type-id-32' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='type-id-33'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-30' size-in-bits='1024' hash='33354c943d48ca44' id='type-id-34'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-32' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-35'/>
    </array-type-def>
    <class-decl name='_GByteArray' is-struct='yes' visibility='default' size-in-bits='128' filepath='../glib/garray.h' line='49' column='1' hash='f953252d0d9e6d1e' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-37' visibility='default' filepath='../glib/garray.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-16' visibility='default' filepath='../glib/garray.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GDate' is-struct='yes' visibility='default' size-in-bits='64' filepath='../glib/gdate.h' line='92' column='1' hash='1d3d570917edf6d3' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='julian_days' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='julian' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33'>
        <var-decl name='dmy' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34'>
        <var-decl name='day' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='month' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='44'>
        <var-decl name='year' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GError' is-struct='yes' visibility='default' size-in-bits='128' filepath='../glib/gerror.h' line='45' column='1' hash='a8773754418f4d7e' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-40' visibility='default' filepath='../glib/gerror.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='code' type-id='type-id-41' visibility='default' filepath='../glib/gerror.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='message' type-id='type-id-42' visibility='default' filepath='../glib/gerror.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GString' is-struct='yes' visibility='default' size-in-bits='192' filepath='../glib/gstring.h' line='45' column='1' hash='c4334d726eae4ebb' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='type-id-42' visibility='default' filepath='../glib/gstring.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-1' visibility='default' filepath='../glib/gstring.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='allocated_len' type-id='type-id-1' visibility='default' filepath='../glib/gstring.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GThread' is-struct='yes' visibility='default' size-in-bits='192' filepath='../glib/deprecated/gthread.h' line='48' column='1' hash='8cddc87840225d4c' id='type-id-44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='func' type-id='type-id-45' visibility='default' filepath='../glib/deprecated/gthread.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-2' visibility='default' filepath='../glib/deprecated/gthread.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='joinable' type-id='type-id-9' visibility='default' filepath='../glib/deprecated/gthread.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='priority' type-id='type-id-27' visibility='default' filepath='../glib/deprecated/gthread.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GVariantBuilder' is-struct='yes' visibility='default' size-in-bits='1024' filepath='../glib/gvariant.h' line='300' column='1' hash='147ab824d7624055' id='type-id-46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='type-id-47' visibility='default' filepath='../glib/gvariant.h' line='310' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GVariantDict' is-struct='yes' visibility='default' size-in-bits='1024' filepath='../glib/gvariant.h' line='486' column='1' hash='54b25937f7c4f514' id='type-id-48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='type-id-49' visibility='default' filepath='../glib/gvariant.h' line='496' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='1024' is-anonymous='yes' filepath='../glib/gvariant.h' line='490' column='1' hash='bc7e7ab3bca62b07' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='asv' type-id='type-id-51' visibility='default' filepath='../glib/gvariant.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='partial_magic' type-id='type-id-1' visibility='default' filepath='../glib/gvariant.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='y' type-id='type-id-31' visibility='default' filepath='../glib/gvariant.h' line='493' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='1024' is-anonymous='yes' filepath='../glib/gvariant.h' line='304' column='1' hash='cd389cd590112931#2' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='partial_magic' type-id='type-id-1' visibility='default' filepath='../glib/gvariant.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-53' visibility='default' filepath='../glib/gvariant.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='y' type-id='type-id-31' visibility='default' filepath='../glib/gvariant.h' line='307' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GByteArray' type-id='type-id-36' size-in-bits='128' filepath='../glib/garray.h' line='40' column='1' id='type-id-54'/>
    <typedef-decl name='GDate' type-id='type-id-38' size-in-bits='64' filepath='../glib/gdate.h' line='44' column='1' id='type-id-55'/>
    <typedef-decl name='GError' type-id='type-id-39' size-in-bits='128' filepath='../glib/gerror.h' line='43' column='1' id='type-id-56'/>
    <typedef-decl name='GString' type-id='type-id-43' size-in-bits='192' filepath='../glib/gstring.h' line='43' column='1' id='type-id-57'/>
    <typedef-decl name='GThread' type-id='type-id-44' size-in-bits='192' filepath='../glib/gthread.h' line='51' column='1' id='type-id-58'/>
    <typedef-decl name='GThreadFunc' type-id='type-id-59' size-in-bits='64' filepath='../glib/gthread.h' line='49' column='1' hash='fd7a63c0c6c822c4' id='type-id-45'/>
    <typedef-decl name='GThreadPriority' type-id='type-id-28' size-in-bits='32' alignment-in-bits='32' filepath='../glib/deprecated/gthread.h' line='46' column='1' hash='598bf67cad362481' id='type-id-27'/>
    <typedef-decl name='GVariantBuilder' type-id='type-id-46' size-in-bits='1024' filepath='../glib/gvariant.h' line='299' column='1' id='type-id-60'/>
    <typedef-decl name='GVariantDict' type-id='type-id-48' size-in-bits='1024' filepath='../glib/gvariant.h' line='485' column='1' id='type-id-61'/>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='1024' is-anonymous='yes' filepath='../glib/gvariant.h' line='488' column='1' hash='75930f2c96aacef4#3' id='type-id-49'>
      <data-member access='public'>
        <var-decl name='s' type-id='type-id-50' visibility='default' filepath='../glib/gvariant.h' line='494' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='x' type-id='type-id-34' visibility='default' filepath='../glib/gvariant.h' line='495' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='1024' is-anonymous='yes' filepath='../glib/gvariant.h' line='302' column='1' hash='75930f2c96aacef4#4' id='type-id-47'>
      <data-member access='public'>
        <var-decl name='s' type-id='type-id-52' visibility='default' filepath='../glib/gvariant.h' line='308' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='x' type-id='type-id-34' visibility='default' filepath='../glib/gvariant.h' line='309' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' hash='f28cc4b41a45db9f' id='type-id-62'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' hash='141b65ba9d2e04c1' id='type-id-63'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' hash='96686f4623f16fd0' id='type-id-64'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' hash='de334dd51ba793b2' id='type-id-65'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' hash='4f0d9209dc2d29fb' id='type-id-66'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' hash='2b0d6a81d57aa297' id='type-id-67'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' hash='a5a25aeb4bd72557' id='type-id-68'/>
    <qualified-type-def type-id='type-id-55' const='yes' hash='02ab6c08d982eaf2' id='type-id-69'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' hash='0cdbf2b9798f232d' id='type-id-70'/>
    <qualified-type-def type-id='type-id-56' const='yes' hash='05513674c78bcf96' id='type-id-71'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' hash='41433aba07377a83' id='type-id-72'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' hash='b850e17205d9f8d1' id='type-id-73'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' hash='4d9f8d539f48293b' id='type-id-37'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-76'/>
    <pointer-type-def type-id='type-id-77' size-in-bits='64' id='type-id-78'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-88'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-100'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-102'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-104'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-107' size-in-bits='64' id='type-id-108'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-110'/>
    <qualified-type-def type-id='type-id-79' const='yes' id='type-id-111'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-112'/>
    <class-decl name='_GBookmarkFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-113'/>
    <class-decl name='_GBytes' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-114'/>
    <class-decl name='_GChecksum' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-115'/>
    <class-decl name='_GDateTime' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-116'/>
    <class-decl name='_GHmac' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-117'/>
    <class-decl name='_GKeyFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-118'/>
    <class-decl name='_GMainLoop' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-119'/>
    <class-decl name='_GMappedFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-120'/>
    <class-decl name='_GMarkupParseContext' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-121'/>
    <class-decl name='_GMatchInfo' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-122'/>
    <class-decl name='_GOptionGroup' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-123'/>
    <class-decl name='_GPatternSpec' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-124'/>
    <class-decl name='_GRand' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-125'/>
    <class-decl name='_GRegex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-126'/>
    <class-decl name='_GStrvBuilder' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-127'/>
    <class-decl name='_GTimeZone' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-128'/>
    <class-decl name='_GTree' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-129'/>
    <class-decl name='_GUri' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-130'/>
    <typedef-decl name='GBytes' type-id='type-id-114' filepath='../glib/garray.h' line='38' column='1' id='type-id-77'/>
    <function-decl name='g_array_ref' filepath='../glib/garray.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_ref' hash='1a6ecd2d3c0c7d9d'>
      <parameter type-id='type-id-131'/>
      <return type-id='type-id-131'/>
    </function-decl>
    <function-decl name='g_array_unref' filepath='../glib/garray.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_unref' hash='e89cece792c3957b'>
      <parameter type-id='type-id-131'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_ptr_array_ref' filepath='../glib/garray.h' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_ref' hash='fbb45be3cce01700'>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='g_byte_array_ref' filepath='../glib/garray.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_ref' hash='595da72c17c602b2'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='g_byte_array_unref' filepath='../glib/garray.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_unref' hash='357ac0abb41ad6dc'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GBookmarkFile' type-id='type-id-113' filepath='../glib/gbookmarkfile.h' line='118' column='1' id='type-id-75'/>
    <function-decl name='g_bookmark_file_free' filepath='../glib/gbookmarkfile.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_free' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_bookmark_file_copy' filepath='../glib/gbookmarkfile.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_copy' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='g_bytes_ref' filepath='../glib/gbytes.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-78'/>
    </function-decl>
    <function-decl name='g_bytes_unref' filepath='../glib/gbytes.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-78'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GChecksum' type-id='type-id-115' filepath='../glib/gchecksum.h' line='57' column='1' id='type-id-79'/>
    <function-decl name='g_checksum_copy' filepath='../glib/gchecksum.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_copy' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='g_checksum_free' filepath='../glib/gchecksum.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_free' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_date_free' filepath='../glib/gdate.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_free' hash='127d8fffb27c967b'>
      <parameter type-id='type-id-63'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_date_copy' filepath='../glib/gdate.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_copy' hash='c873ae32ff9ce39c'>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-63'/>
    </function-decl>
    <typedef-decl name='GDateTime' type-id='type-id-116' filepath='../glib/gdatetime.h' line='122' column='1' id='type-id-81'/>
    <function-decl name='g_date_time_unref' filepath='../glib/gdatetime.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_date_time_ref' filepath='../glib/gdatetime.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='g_dir_ref' filepath='../glib/gdir.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dir_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-132'/>
    </function-decl>
    <function-decl name='g_dir_unref' filepath='../glib/gdir.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dir_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_error_free' filepath='../glib/gerror.h' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_free' hash='5a93fd810447fa83'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_error_copy' filepath='../glib/gerror.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_copy' hash='060835fb0b13e090'>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='g_hash_table_ref' filepath='../glib/ghash.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-133'/>
    </function-decl>
    <function-decl name='g_hash_table_unref' filepath='../glib/ghash.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-133'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GHmac' type-id='type-id-117' filepath='../glib/ghmac.h' line='33' column='1' id='type-id-83'/>
    <function-decl name='g_hmac_ref' filepath='../glib/ghmac.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hmac_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_hmac_unref' filepath='../glib/ghmac.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hmac_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GKeyFile' type-id='type-id-118' filepath='../glib/gkeyfile.h' line='50' column='1' id='type-id-85'/>
    <function-decl name='g_key_file_ref' filepath='../glib/gkeyfile.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='g_key_file_unref' filepath='../glib/gkeyfile.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_key_file_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GMainLoop' type-id='type-id-119' filepath='../glib/gmain.h' line='78' column='1' id='type-id-87'/>
    <function-decl name='g_main_context_ref' filepath='../glib/gmain.h' line='494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_main_context_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-134'/>
    </function-decl>
    <function-decl name='g_main_context_unref' filepath='../glib/gmain.h' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_main_context_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_main_loop_ref' filepath='../glib/gmain.h' line='684' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_main_loop_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-88'/>
    </function-decl>
    <function-decl name='g_main_loop_unref' filepath='../glib/gmain.h' line='686' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_main_loop_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-88'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_source_ref' filepath='../glib/gmain.h' line='705' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_ref' hash='75986bd48626a515'>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_source_unref' filepath='../glib/gmain.h' line='707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_unref' hash='09b40bdb5c9eca2e'>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GMappedFile' type-id='type-id-120' filepath='../glib/gmappedfile.h' line='34' column='1' id='type-id-89'/>
    <function-decl name='g_mapped_file_ref' filepath='../glib/gmappedfile.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mapped_file_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='g_mapped_file_unref' filepath='../glib/gmappedfile.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mapped_file_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GMarkupParseContext' type-id='type-id-121' filepath='../glib/gmarkup.h' line='116' column='1' id='type-id-91'/>
    <function-decl name='g_markup_parse_context_ref' filepath='../glib/gmarkup.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_markup_parse_context_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-92'/>
    </function-decl>
    <function-decl name='g_markup_parse_context_unref' filepath='../glib/gmarkup.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_markup_parse_context_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GOptionGroup' type-id='type-id-123' filepath='../glib/goption.h' line='53' column='1' id='type-id-95'/>
    <function-decl name='g_option_group_ref' filepath='../glib/goption.h' line='414' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_group_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='g_option_group_unref' filepath='../glib/goption.h' line='416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_option_group_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GPatternSpec' type-id='type-id-124' filepath='../glib/gpattern.h' line='32' column='1' id='type-id-97'/>
    <function-decl name='g_pattern_spec_free' filepath='../glib/gpattern.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_pattern_spec_free' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_pattern_spec_copy' filepath='../glib/gpattern.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_pattern_spec_copy' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <typedef-decl name='GRand' type-id='type-id-125' filepath='../glib/grand.h' line='38' column='1' id='type-id-99'/>
    <function-decl name='g_rand_free' filepath='../glib/grand.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_rand_free' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_rand_copy' filepath='../glib/grand.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_rand_copy' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <typedef-decl name='GRegex' type-id='type-id-126' filepath='../glib/gregex.h' line='416' column='1' id='type-id-101'/>
    <typedef-decl name='GMatchInfo' type-id='type-id-122' filepath='../glib/gregex.h' line='425' column='1' id='type-id-93'/>
    <function-decl name='g_regex_ref' filepath='../glib/gregex.h' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_regex_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-102'/>
    </function-decl>
    <function-decl name='g_regex_unref' filepath='../glib/gregex.h' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_regex_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_match_info_ref' filepath='../glib/gregex.h' line='573' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_match_info_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-94'/>
    </function-decl>
    <function-decl name='g_match_info_unref' filepath='../glib/gregex.h' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_match_info_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_strfreev' filepath='../glib/gstrfuncs.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strfreev' hash='a660cca625e22f9c'>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_strdupv' filepath='../glib/gstrfuncs.h' line='369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strdupv' hash='6eebcc71dc9d2bbb'>
      <parameter type-id='type-id-73'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='g_string_copy' filepath='../glib/gstring.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_copy' hash='e30ac59fe84b59b2'>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-65'/>
    </function-decl>
    <function-decl name='g_string_free' filepath='../glib/gstring.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_free' hash='9d1d8d666afba838'>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <typedef-decl name='GStrvBuilder' type-id='type-id-127' filepath='../glib/gstrvbuilder.h' line='33' column='1' id='type-id-103'/>
    <function-decl name='g_strv_builder_unref' filepath='../glib/gstrvbuilder.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strv_builder_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_strv_builder_ref' filepath='../glib/gstrvbuilder.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strv_builder_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-104'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='g_thread_ref' filepath='../glib/gthread.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_thread_ref' hash='d00eb2806807040a'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='g_thread_unref' filepath='../glib/gthread.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_thread_unref' hash='33f5698e77fbca29'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GTimeZone' type-id='type-id-128' filepath='../glib/gtimezone.h' line='34' column='1' id='type-id-105'/>
    <function-decl name='g_time_zone_ref' filepath='../glib/gtimezone.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_time_zone_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='g_time_zone_unref' filepath='../glib/gtimezone.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_time_zone_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GTree' type-id='type-id-129' filepath='../glib/gtree.h' line='40' column='1' id='type-id-107'/>
    <function-decl name='g_tree_ref' filepath='../glib/gtree.h' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_tree_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='g_tree_unref' filepath='../glib/gtree.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_tree_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GUri' type-id='type-id-130' filepath='../glib/guri.h' line='33' column='1' id='type-id-109'/>
    <function-decl name='g_uri_ref' filepath='../glib/guri.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_uri_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-110'/>
    </function-decl>
    <function-decl name='g_uri_unref' filepath='../glib/guri.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_uri_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_variant_builder_unref' filepath='../glib/gvariant.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_builder_unref' hash='36a10355c5c0bf0c'>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_variant_builder_ref' filepath='../glib/gvariant.h' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_builder_ref' hash='b53014a847acdec3'>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='g_variant_dict_ref' filepath='../glib/gvariant.h' line='572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dict_ref' hash='2e9d892991b02a26'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='g_variant_dict_unref' filepath='../glib/gvariant.h' line='574' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_dict_unref' hash='1d11135c4b993cb4'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='09b40bdb5c9eca2e' id='type-id-136'>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gclosure.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <var-decl name='ffi_type_pointer' type-id='type-id-137' visibility='default' filepath='/usr/include/ffi-x86_64.h' line='222' column='1' elf-symbol-id='ffi_type_pointer@@LIBFFI_BASE_8.0'/>
    <function-decl name='ffi_call' filepath='/usr/include/ffi-x86_64.h' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ffi_call@@LIBFFI_BASE_8.0' hash='a357c40c06dff173'>
      <parameter type-id='type-id-138'/>
      <parameter type-id='type-id-139'/>
      <parameter type-id='type-id-140'/>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='26165d0039618a4f' id='type-id-142'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/genums.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_string_new' filepath='../glib/gstring.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_new' hash='9c88f7857a1005cc'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-65'/>
    </function-decl>
    <function-decl name='g_string_free_and_steal' filepath='../glib/gstring.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_free_and_steal' hash='7b9942aa0c7675a4'>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='g_string_insert_len' filepath='../glib/gstring.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_insert_len' hash='56352021ad4eddc4'>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-143'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-65'/>
    </function-decl>
    <function-decl name='g_string_append_len' filepath='../glib/gstring.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_append_len' hash='67d9355e78cea58f'>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-65'/>
    </function-decl>
    <function-decl name='g_string_append_printf' filepath='../glib/gstring.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_append_printf' hash='9c88f7857a1005cc'>
      <parameter type-id='type-id-65'/>
      <parameter type-id='type-id-8'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gmarshal.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gobject.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='type-id-144'/>
    <class-decl name='_GParamSpecPool' is-struct='yes' visibility='default' size-in-bits='192' filepath='../gobject/gparam.c' line='944' column='1' hash='d075954aaad337d5' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-20' visibility='default' filepath='../gobject/gparam.c' line='946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type_prefixing' type-id='type-id-9' visibility='default' filepath='../gobject/gparam.c' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash_table' type-id='type-id-133' visibility='default' filepath='../gobject/gparam.c' line='948' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_bit_lock' filepath='../glib/gbitlock.h' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bit_lock' hash='11e1000f387b1cab'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_bit_unlock' filepath='../glib/gbitlock.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bit_unlock' hash='11e1000f387b1cab'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_pointer_bit_lock' filepath='../glib/gbitlock.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_pointer_bit_lock' hash='388da3fa973fde78'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_pointer_bit_lock_and_get' filepath='../glib/gbitlock.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_pointer_bit_lock_and_get' hash='3bd86df7a4467ca4'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-148'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_pointer_bit_unlock' filepath='../glib/gbitlock.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_pointer_bit_unlock' hash='388da3fa973fde78'>
      <parameter type-id='type-id-147'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_pointer_bit_lock_mask_ptr' filepath='../glib/gbitlock.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_pointer_bit_lock_mask_ptr' hash='abcd92ca93f721fc'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_pointer_bit_unlock_and_set' filepath='../glib/gbitlock.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_pointer_bit_unlock_and_set' hash='3f7b79ee24d3110f'>
      <parameter type-id='type-id-140'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_datalist_id_dup_data' filepath='../glib/gdataset.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_id_dup_data' hash='29ea89c16fda2a0c'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_datalist_id_replace_data' filepath='../glib/gdataset.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_id_replace_data' hash='0ef151269124106a'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_datalist_unset_flags' filepath='../glib/gdataset.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_unset_flags' hash='cc8b8ef221b7dabe'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_datalist_get_flags' filepath='../glib/gdataset.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_get_flags' hash='61423974899161d7'>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_datalist_get_data' filepath='../glib/gdataset.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_get_data' hash='24cddc1ff9ca508b'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_list_free' filepath='../glib/glist.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_free' hash='c884abd86095e20d'>
      <parameter type-id='type-id-152'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_slist_free' filepath='../glib/gslist.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_free' hash='ebbf473d6dca81f0'>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_slist_append' filepath='../glib/gslist.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_append' hash='d25cb34cbff9f8c9'>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-153'/>
    </function-decl>
    <function-decl name='g_slist_remove' filepath='../glib/gslist.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_remove' hash='d25cb34cbff9f8c9'>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-153'/>
    </function-decl>
    <function-decl name='g_slist_copy' filepath='../glib/gslist.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_copy' hash='d25cb34cbff9f8c9'>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-153'/>
    </function-decl>
    <function-decl name='g_slist_length' filepath='../glib/gslist.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_length' hash='1693892e04bac5ff'>
      <parameter type-id='type-id-153'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_nullify_pointer' filepath='../glib/gutils.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_nullify_pointer' hash='7a97601669533a47'>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='glib__private__' filepath='../gobject/../glib/glib-private.h' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='glib__private__' hash='b73ae5cee7b1f986'>
      <return type-id='type-id-155'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-156'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gparam.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_hash_table_new_full' filepath='../glib/ghash.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_new_full' hash='76f2737fedeaf3a6'>
      <parameter type-id='type-id-157'/>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-133'/>
    </function-decl>
    <function-decl name='g_hash_table_foreach' filepath='../glib/ghash.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_foreach' hash='5695f5ce05a4c55f'>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-159'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_list_prepend' filepath='../glib/glist.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_prepend' hash='b832210b99ef58b3'>
      <parameter type-id='type-id-152'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-152'/>
    </function-decl>
    <function-decl name='g_slist_sort' filepath='../glib/gslist.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_sort' hash='2c12cfcd7b83a590'>
      <parameter type-id='type-id-153'/>
      <parameter type-id='type-id-160'/>
      <return type-id='type-id-153'/>
    </function-decl>
    <function-decl name='g_mutex_clear' filepath='../glib/gthread.h' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mutex_clear' hash='37ae111832bd0fb5'>
      <parameter type-id='type-id-161'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gparamspecs.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_unichar_validate' filepath='../glib/gunicode.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unichar_validate' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-162'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_variant_get_type' filepath='../glib/gvariant.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_type' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='g_variant_is_of_type' filepath='../glib/gvariant.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_is_of_type' hash='388da3fa973fde78'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_variant_classify' filepath='../glib/gvariant.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_classify' hash='18289293a52fad10'>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-163'/>
    </function-decl>
    <function-decl name='g_variant_equal' filepath='../glib/gvariant.h' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_equal' hash='388da3fa973fde78'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_variant_compare' filepath='../glib/gvariant.h' line='482' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_compare' hash='388da3fa973fde78'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='g_variant_type_equal' filepath='../glib/gvarianttype.h' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_equal' hash='388da3fa973fde78'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-164'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='afc5d71ff2523962' id='type-id-165'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-41'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-166'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-41'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gsignal.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_array_new' filepath='../glib/garray.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_new' hash='85342590edca6c7d'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-131'/>
    </function-decl>
    <function-decl name='g_array_free' filepath='../glib/garray.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_free' hash='9c71f9f61c11a46a'>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='g_array_append_vals' filepath='../glib/garray.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_append_vals' hash='ed37041a4b02081a'>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-131'/>
    </function-decl>
    <function-decl name='g_direct_hash' filepath='../glib/ghash.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_direct_hash' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_hook_list_init' filepath='../glib/ghook.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hook_list_init' hash='93bb47122f17404d'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_hook_list_clear' filepath='../glib/ghook.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hook_list_clear' hash='3cf280a94bdd887b'>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_hook_alloc' filepath='../glib/ghook.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hook_alloc' hash='cac9c4e2c5cd6918'>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='g_hook_ref' filepath='../glib/ghook.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hook_ref' hash='44caef8890360466'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='g_hook_unref' filepath='../glib/ghook.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hook_unref' hash='90d4526175e85df7'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_hook_destroy' filepath='../glib/ghook.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hook_destroy' hash='572f7a4b89f3c0b3'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_hook_destroy_link' filepath='../glib/ghook.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hook_destroy_link' hash='90d4526175e85df7'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_hook_insert_before' filepath='../glib/ghook.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hook_insert_before' hash='2179cc5f6b1b8a3d'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_hook_first_valid' filepath='../glib/ghook.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hook_first_valid' hash='5f7f54a0c29606e5'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='g_hook_next_valid' filepath='../glib/ghook.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hook_next_valid' hash='29036b233ff24697'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='type-id-170'>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' hash='82750ceff524f440' id='type-id-171'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-173'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='90d4526175e85df7' id='type-id-174'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gsignalgroup.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_ptr_array_set_size' filepath='../glib/garray.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_set_size' hash='9488051409510324'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_ptr_array_remove_index' filepath='../glib/garray.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_remove_index' hash='c2f4fddf0cb60960'>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_rec_mutex_init' filepath='../glib/gthread.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_rec_mutex_init' hash='1a6c7f7a65f91f35'>
      <parameter type-id='type-id-175'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_rec_mutex_clear' filepath='../glib/gthread.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_rec_mutex_clear' hash='1a6c7f7a65f91f35'>
      <parameter type-id='type-id-175'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gsourceclosure.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <enum-decl name='GIOCondition' naming-typedef-id='type-id-176' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gmain.h' line='34' column='1' hash='2eab2da4c5ae2edd' id='type-id-177'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_IO_IN' value='1'/>
      <enumerator name='G_IO_OUT' value='4'/>
      <enumerator name='G_IO_PRI' value='2'/>
      <enumerator name='G_IO_ERR' value='8'/>
      <enumerator name='G_IO_HUP' value='16'/>
      <enumerator name='G_IO_NVAL' value='32'/>
    </enum-decl>
    <enum-decl name='GIOFlags' naming-typedef-id='type-id-178' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='87' column='1' hash='5a9c4986bd53c9af' id='type-id-179'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_IO_FLAG_NONE' value='0'/>
      <enumerator name='G_IO_FLAG_APPEND' value='1'/>
      <enumerator name='G_IO_FLAG_NONBLOCK' value='2'/>
      <enumerator name='G_IO_FLAG_IS_READABLE' value='4'/>
      <enumerator name='G_IO_FLAG_IS_WRITABLE' value='8'/>
      <enumerator name='G_IO_FLAG_IS_WRITEABLE' value='8'/>
      <enumerator name='G_IO_FLAG_IS_SEEKABLE' value='16'/>
      <enumerator name='G_IO_FLAG_MASK' value='31'/>
      <enumerator name='G_IO_FLAG_GET_MASK' value='31'/>
      <enumerator name='G_IO_FLAG_SET_MASK' value='3'/>
    </enum-decl>
    <enum-decl name='GIOStatus' naming-typedef-id='type-id-180' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='72' column='1' hash='0bfc0e6ac1595f20' id='type-id-181'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_IO_STATUS_ERROR' value='0'/>
      <enumerator name='G_IO_STATUS_NORMAL' value='1'/>
      <enumerator name='G_IO_STATUS_EOF' value='2'/>
      <enumerator name='G_IO_STATUS_AGAIN' value='3'/>
    </enum-decl>
    <enum-decl name='GSeekType' naming-typedef-id='type-id-182' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='80' column='1' hash='af28507cd178ecb6' id='type-id-183'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_SEEK_CUR' value='0'/>
      <enumerator name='G_SEEK_SET' value='1'/>
      <enumerator name='G_SEEK_END' value='2'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-184' size-in-bits='48' hash='b341a146a45c7b1f' id='type-id-185'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-32' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-186'/>
    </array-type-def>
    <class-decl name='_GIOChannel' is-struct='yes' visibility='default' size-in-bits='896' filepath='../glib/giochannel.h' line='100' column='1' hash='52c73078aad73912' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-41' visibility='default' filepath='../glib/giochannel.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='funcs' type-id='type-id-188' visibility='default' filepath='../glib/giochannel.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='encoding' type-id='type-id-42' visibility='default' filepath='../glib/giochannel.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='read_cd' type-id='type-id-189' visibility='default' filepath='../glib/giochannel.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write_cd' type-id='type-id-189' visibility='default' filepath='../glib/giochannel.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='line_term' type-id='type-id-42' visibility='default' filepath='../glib/giochannel.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='line_term_len' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='buf_size' type-id='type-id-1' visibility='default' filepath='../glib/giochannel.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='read_buf' type-id='type-id-65' visibility='default' filepath='../glib/giochannel.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='encoded_read_buf' type-id='type-id-65' visibility='default' filepath='../glib/giochannel.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='write_buf' type-id='type-id-65' visibility='default' filepath='../glib/giochannel.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='partial_write_buf' type-id='type-id-185' visibility='default' filepath='../glib/giochannel.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='752'>
        <var-decl name='use_buffer' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='753'>
        <var-decl name='do_encode' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='754'>
        <var-decl name='close_on_unref' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='755'>
        <var-decl name='is_readable' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='756'>
        <var-decl name='is_writeable' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='757'>
        <var-decl name='is_seekable' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reserved1' type-id='type-id-2' visibility='default' filepath='../glib/giochannel.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='reserved2' type-id='type-id-2' visibility='default' filepath='../glib/giochannel.h' line='128' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GIOFuncs' is-struct='yes' visibility='default' size-in-bits='512' filepath='../glib/giochannel.h' line='134' column='1' hash='087da271ce041765' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='io_read' type-id='type-id-191' visibility='default' filepath='../glib/giochannel.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='io_write' type-id='type-id-192' visibility='default' filepath='../glib/giochannel.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='io_seek' type-id='type-id-193' visibility='default' filepath='../glib/giochannel.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='io_close' type-id='type-id-194' visibility='default' filepath='../glib/giochannel.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='io_create_watch' type-id='type-id-195' visibility='default' filepath='../glib/giochannel.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='io_free' type-id='type-id-196' visibility='default' filepath='../glib/giochannel.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='io_set_flags' type-id='type-id-197' visibility='default' filepath='../glib/giochannel.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='io_get_flags' type-id='type-id-198' visibility='default' filepath='../glib/giochannel.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GIOChannel' type-id='type-id-187' size-in-bits='896' filepath='../glib/giochannel.h' line='43' column='1' id='type-id-199'/>
    <typedef-decl name='GIOCondition' type-id='type-id-177' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gmain.h' line='41' column='1' hash='2eab2da4c5ae2edd' id='type-id-176'/>
    <typedef-decl name='GIOFlags' type-id='type-id-179' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='98' column='1' hash='5a9c4986bd53c9af' id='type-id-178'/>
    <typedef-decl name='GIOFuncs' type-id='type-id-190' size-in-bits='512' filepath='../glib/giochannel.h' line='44' column='1' id='type-id-200'/>
    <typedef-decl name='GIOStatus' type-id='type-id-181' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='77' column='1' hash='0bfc0e6ac1595f20' id='type-id-180'/>
    <typedef-decl name='GSeekType' type-id='type-id-183' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='84' column='1' hash='af28507cd178ecb6' id='type-id-182'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' hash='f3a3b0f39224c369' id='type-id-201'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' hash='93550a37558be942' id='type-id-202'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-198'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' hash='794cfad536cded25' id='type-id-188'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-194'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-197'/>
    <pointer-type-def type-id='type-id-206' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-192'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-191'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-193'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-195'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-196'/>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' id='type-id-212'/>
    <class-decl name='_GIConv' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-211'/>
    <typedef-decl name='GIConv' type-id='type-id-212' size-in-bits='64' filepath='../glib/gconvert.h' line='85' column='1' id='type-id-189'/>
    <function-decl name='g_io_channel_ref' filepath='../glib/giochannel.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_channel_ref' hash='9590baabda67e847'>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-202'/>
    </function-decl>
    <function-decl name='g_io_channel_unref' filepath='../glib/giochannel.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_channel_unref' hash='965f9eef66f85871'>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <var-decl name='g_io_watch_funcs' type-id='type-id-213' visibility='default' filepath='../glib/giochannel.h' line='330' column='1' elf-symbol-id='g_io_watch_funcs'/>
    <function-decl name='g_source_destroy' filepath='../glib/gmain.h' line='713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_destroy' hash='09b40bdb5c9eca2e'>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_source_set_callback_indirect' filepath='../glib/gmain.h' line='782' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_set_callback_indirect' hash='0a8621680ce5d819'>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-214'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <var-decl name='g_timeout_funcs' type-id='type-id-213' visibility='default' filepath='../glib/gmain.h' line='1024' column='1' elf-symbol-id='g_timeout_funcs'/>
    <var-decl name='g_child_watch_funcs' type-id='type-id-213' visibility='default' filepath='../glib/gmain.h' line='1025' column='1' elf-symbol-id='g_child_watch_funcs'/>
    <var-decl name='g_idle_funcs' type-id='type-id-213' visibility='default' filepath='../glib/gmain.h' line='1026' column='1' elf-symbol-id='g_idle_funcs'/>
    <var-decl name='g_unix_signal_funcs' type-id='type-id-213' visibility='default' filepath='../glib/gmain.h' line='1028' column='1' elf-symbol-id='g_unix_signal_funcs'/>
    <var-decl name='g_unix_fd_source_funcs' type-id='type-id-213' visibility='default' filepath='../glib/gmain.h' line='1029' column='1' elf-symbol-id='g_unix_fd_source_funcs'/>
    <function-type size-in-bits='64' hash='1ca2ab019bcda056' id='type-id-203'>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-178'/>
    </function-type>
    <function-type size-in-bits='64' hash='d1fd1874ebc79635' id='type-id-204'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-180'/>
    </function-type>
    <function-type size-in-bits='64' hash='cbc21649f21115a2' id='type-id-205'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-178'/>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-180'/>
    </function-type>
    <function-type size-in-bits='64' hash='88800937b43a9727' id='type-id-206'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-180'/>
    </function-type>
    <function-type size-in-bits='64' hash='890fca2700b2b271' id='type-id-207'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-180'/>
    </function-type>
    <function-type size-in-bits='64' hash='11499dbebefdf426' id='type-id-208'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-215'/>
      <parameter type-id='type-id-182'/>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-180'/>
    </function-type>
    <function-type size-in-bits='64' hash='140552f56530c0f0' id='type-id-209'>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-135'/>
    </function-type>
    <function-type size-in-bits='64' hash='965f9eef66f85871' id='type-id-210'>
      <parameter type-id='type-id-202'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gtype.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='GLibPrivateVTable' is-struct='yes' naming-typedef-id='type-id-216' visibility='default' size-in-bits='1088' filepath='../glib/glib-private.h' line='239' column='1' hash='6cf6c2c36b65c167' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_wakeup_new' type-id='type-id-218' visibility='default' filepath='../glib/glib-private.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='g_wakeup_free' type-id='type-id-219' visibility='default' filepath='../glib/glib-private.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='g_wakeup_get_pollfd' type-id='type-id-220' visibility='default' filepath='../glib/glib-private.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='g_wakeup_signal' type-id='type-id-219' visibility='default' filepath='../glib/glib-private.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='g_wakeup_acknowledge' type-id='type-id-219' visibility='default' filepath='../glib/glib-private.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='g_get_worker_context' type-id='type-id-221' visibility='default' filepath='../glib/glib-private.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='g_check_setuid' type-id='type-id-222' visibility='default' filepath='../glib/glib-private.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='g_main_context_new_with_next_id' type-id='type-id-223' visibility='default' filepath='../glib/glib-private.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='g_dir_open_with_errno' type-id='type-id-224' visibility='default' filepath='../glib/glib-private.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='g_dir_new_from_dirp' type-id='type-id-225' visibility='default' filepath='../glib/glib-private.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='glib_init' type-id='type-id-139' visibility='default' filepath='../glib/glib-private.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='g_win32_push_empty_invalid_parameter_handler' type-id='type-id-226' visibility='default' filepath='../glib/glib-private.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='g_win32_pop_invalid_parameter_handler' type-id='type-id-226' visibility='default' filepath='../glib/glib-private.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='g_find_program_for_path' type-id='type-id-227' visibility='default' filepath='../glib/glib-private.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='g_uri_get_default_scheme_port' type-id='type-id-228' visibility='default' filepath='../glib/glib-private.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='g_set_prgname_once' type-id='type-id-229' visibility='default' filepath='../glib/glib-private.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='g_datalist_id_update_atomic' type-id='type-id-230' visibility='default' filepath='../glib/glib-private.h' line='306' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GData' is-struct='yes' visibility='default' size-in-bits='128' filepath='../gobject/gtype.c' line='3482' column='1' hash='045846c708875bfe' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_qdatas' type-id='type-id-16' visibility='default' filepath='../gobject/gtype.c' line='3484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='qdatas' type-id='type-id-232' visibility='default' filepath='../gobject/gtype.c' line='3485' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_QData' is-struct='yes' visibility='default' size-in-bits='128' filepath='../gobject/gtype.c' line='3487' column='1' hash='ebfb11a3a1b4738f' id='type-id-233'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='quark' type-id='type-id-40' visibility='default' filepath='../gobject/gtype.c' line='3489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-2' visibility='default' filepath='../gobject/gtype.c' line='3490' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GDataListUpdateAtomicFunc' type-id='type-id-234' size-in-bits='64' filepath='../glib/gdatasetprivate.h' line='75' column='1' hash='fd7a63c0c6c822c4' id='type-id-235'/>
    <typedef-decl name='GLibPrivateVTable' type-id='type-id-217' size-in-bits='1088' filepath='../glib/glib-private.h' line='313' column='1' id='type-id-216'/>
    <typedef-decl name='GWin32InvalidParameterHandler' type-id='type-id-236' size-in-bits='32' filepath='../glib/glib-private.h' line='226' column='1' id='type-id-237'/>
    <typedef-decl name='QData' type-id='type-id-233' size-in-bits='128' filepath='../gobject/gtype.c' line='3481' column='1' id='type-id-238'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' hash='26c777ab367efaba' id='type-id-232'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' id='type-id-240'/>
    <function-decl name='g_str_equal' filepath='../glib/ghash.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_str_equal' hash='388da3fa973fde78'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_str_hash' filepath='../glib/ghash.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_str_hash' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-154'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_quark_to_string' filepath='../glib/gquark.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_quark_to_string' hash='ca1560ab280d758e'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='g_rw_lock_writer_lock' filepath='../glib/gthread.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_rw_lock_writer_lock' hash='2f5e284a0dfeaa8f'>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_rw_lock_writer_unlock' filepath='../glib/gthread.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_rw_lock_writer_unlock' hash='2f5e284a0dfeaa8f'>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_rw_lock_reader_lock' filepath='../glib/gthread.h' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_rw_lock_reader_lock' hash='2f5e284a0dfeaa8f'>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_rw_lock_reader_unlock' filepath='../glib/gthread.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_rw_lock_reader_unlock' hash='2f5e284a0dfeaa8f'>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_parse_debug_string' filepath='../glib/gutils.h' line='275' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_parse_debug_string' hash='98f3533b4114c91f'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <typedef-decl name='GWakeup' type-id='type-id-243' filepath='../glib/gwakeup.h' line='27' column='1' id='type-id-239'/>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-244'>
      <return type-id='type-id-240'/>
    </function-type>
    <function-type size-in-bits='64' hash='0236e9383581bfb0' id='type-id-245'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-235'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-246'>
      <parameter type-id='type-id-240'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='70430ab31c139ec6' id='type-id-247'>
      <parameter type-id='type-id-240'/>
      <parameter type-id='type-id-248'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='779b4896b3b46c1f' id='type-id-249'>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-251'>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gtypemodule.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gtypeplugin.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gvaluearray.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_sort_array' filepath='../glib/gqsort.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_sort_array' hash='3aa907ea60dd12ba'>
      <parameter type-id='type-id-140'/>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-252'/>
      <parameter type-id='type-id-253'/>
      <parameter type-id='type-id-140'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='1a25e8acfe50e042' id='type-id-254'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gvaluetransform.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../gobject/gvaluetypes.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_strescape' filepath='../glib/gstrfuncs.h' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strescape' hash='58a789ef00ad4f55'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='g_variant_take_ref' filepath='../glib/gvariant.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_take_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-51'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-186ce' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <enum-decl name='GConnectFlags' naming-typedef-id='type-id-255' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gsignal.h' line='196' column='1' hash='47bc806744fc734a' id='type-id-256'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_CONNECT_DEFAULT' value='0'/>
      <enumerator name='G_CONNECT_AFTER' value='1'/>
      <enumerator name='G_CONNECT_SWAPPED' value='2'/>
    </enum-decl>
    <enum-decl name='GSignalMatchType' naming-typedef-id='type-id-257' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gsignal.h' line='215' column='1' hash='d637ff36353906c9' id='type-id-258'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_SIGNAL_MATCH_ID' value='1'/>
      <enumerator name='G_SIGNAL_MATCH_DETAIL' value='2'/>
      <enumerator name='G_SIGNAL_MATCH_CLOSURE' value='4'/>
      <enumerator name='G_SIGNAL_MATCH_FUNC' value='8'/>
      <enumerator name='G_SIGNAL_MATCH_DATA' value='16'/>
      <enumerator name='G_SIGNAL_MATCH_UNBLOCKED' value='32'/>
    </enum-decl>
    <enum-decl name='GVariantClass' naming-typedef-id='type-id-163' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gvariant.h' line='39' column='1' hash='d86a78244bc2f758' id='type-id-259'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_VARIANT_CLASS_BOOLEAN' value='98'/>
      <enumerator name='G_VARIANT_CLASS_BYTE' value='121'/>
      <enumerator name='G_VARIANT_CLASS_INT16' value='110'/>
      <enumerator name='G_VARIANT_CLASS_UINT16' value='113'/>
      <enumerator name='G_VARIANT_CLASS_INT32' value='105'/>
      <enumerator name='G_VARIANT_CLASS_UINT32' value='117'/>
      <enumerator name='G_VARIANT_CLASS_INT64' value='120'/>
      <enumerator name='G_VARIANT_CLASS_UINT64' value='116'/>
      <enumerator name='G_VARIANT_CLASS_HANDLE' value='104'/>
      <enumerator name='G_VARIANT_CLASS_DOUBLE' value='100'/>
      <enumerator name='G_VARIANT_CLASS_STRING' value='115'/>
      <enumerator name='G_VARIANT_CLASS_OBJECT_PATH' value='111'/>
      <enumerator name='G_VARIANT_CLASS_SIGNATURE' value='103'/>
      <enumerator name='G_VARIANT_CLASS_VARIANT' value='118'/>
      <enumerator name='G_VARIANT_CLASS_MAYBE' value='109'/>
      <enumerator name='G_VARIANT_CLASS_ARRAY' value='97'/>
      <enumerator name='G_VARIANT_CLASS_TUPLE' value='40'/>
      <enumerator name='G_VARIANT_CLASS_DICT_ENTRY' value='123'/>
    </enum-decl>
    <class-decl name='_GParamSpecTypeInfo' is-struct='yes' visibility='default' size-in-bits='448' filepath='../gobject/gparam.h' line='389' column='1' hash='cab684f890f23e8c' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='instance_size' type-id='type-id-261' visibility='default' filepath='../gobject/gparam.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='n_preallocs' type-id='type-id-261' visibility='default' filepath='../gobject/gparam.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='instance_init' type-id='type-id-262' visibility='default' filepath='../gobject/gparam.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value_type' type-id='type-id-263' visibility='default' filepath='../gobject/gparam.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='finalize' type-id='type-id-262' visibility='default' filepath='../gobject/gparam.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='value_set_default' type-id='type-id-264' visibility='default' filepath='../gobject/gparam.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='value_validate' type-id='type-id-265' visibility='default' filepath='../gobject/gparam.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='values_cmp' type-id='type-id-266' visibility='default' filepath='../gobject/gparam.h' line='403' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GParameter' is-struct='yes' visibility='default' size-in-bits='256' filepath='../gobject/gparam.h' line='280' column='1' hash='1c7081be2b941aa0' id='type-id-267'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-8' visibility='default' filepath='../gobject/gparam.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-268' visibility='default' filepath='../gobject/gparam.h' line='283' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GValueArray' is-struct='yes' visibility='default' size-in-bits='192' filepath='../gobject/gvaluearray.h' line='44' column='1' hash='dc2cd43667c5cc54' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='n_values' type-id='type-id-16' visibility='default' filepath='../gobject/gvaluearray.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='values' type-id='type-id-15' visibility='default' filepath='../gobject/gvaluearray.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='n_prealloced' type-id='type-id-16' visibility='default' filepath='../gobject/gvaluearray.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GCompareFunc' type-id='type-id-270' size-in-bits='64' filepath='../glib/gtypes.h' line='112' column='1' hash='fd7a63c0c6c822c4' id='type-id-160'/>
    <typedef-decl name='GConnectFlags' type-id='type-id-256' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gsignal.h' line='200' column='1' hash='47bc806744fc734a' id='type-id-255'/>
    <typedef-decl name='GDuplicateFunc' type-id='type-id-271' size-in-bits='64' filepath='../glib/gdataset.h' line='63' column='1' hash='fd7a63c0c6c822c4' id='type-id-150'/>
    <typedef-decl name='GEqualFunc' type-id='type-id-272' size-in-bits='64' filepath='../glib/gtypes.h' line='117' column='1' hash='fd7a63c0c6c822c4' id='type-id-158'/>
    <typedef-decl name='GHFunc' type-id='type-id-273' size-in-bits='64' filepath='../glib/gtypes.h' line='144' column='1' hash='fd7a63c0c6c822c4' id='type-id-159'/>
    <typedef-decl name='GHashFunc' type-id='type-id-274' size-in-bits='64' filepath='../glib/gtypes.h' line='143' column='1' hash='fd7a63c0c6c822c4' id='type-id-157'/>
    <typedef-decl name='GParamSpecTypeInfo' type-id='type-id-260' size-in-bits='448' filepath='../gobject/gparam.h' line='363' column='1' id='type-id-275'/>
    <typedef-decl name='GParameter' type-id='type-id-267' size-in-bits='256' filepath='../gobject/gparam.h' line='206' column='1' id='type-id-276'/>
    <typedef-decl name='GSignalMatchType' type-id='type-id-258' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gsignal.h' line='222' column='1' hash='d637ff36353906c9' id='type-id-257'/>
    <typedef-decl name='GToggleNotify' type-id='type-id-277' size-in-bits='64' filepath='../gobject/gobject.h' line='551' column='1' hash='fd7a63c0c6c822c4' id='type-id-278'/>
    <typedef-decl name='GValueArray' type-id='type-id-269' size-in-bits='192' filepath='../gobject/gvaluearray.h' line='43' column='1' id='type-id-279'/>
    <typedef-decl name='GVariantClass' type-id='type-id-259' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gvariant.h' line='58' column='1' hash='d86a78244bc2f758' id='type-id-163'/>
    <typedef-decl name='GWeakNotify' type-id='type-id-280' size-in-bits='64' filepath='../gobject/gobject.h' line='249' column='1' hash='fd7a63c0c6c822c4' id='type-id-281'/>
    <typedef-decl name='guint8' type-id='type-id-282' size-in-bits='8' filepath='glib/glibconfig.h' line='46' column='1' hash='6ebac62b3366db68' id='type-id-74'/>
    <typedef-decl name='guintptr' type-id='type-id-32' size-in-bits='64' filepath='glib/glibconfig.h' line='110' column='1' hash='8fdc5eea2983a729' id='type-id-30'/>
    <typedef-decl name='gunichar' type-id='type-id-283' size-in-bits='32' filepath='../glib/gunicode.h' line='61' column='1' hash='e66b43f97c38e87a' id='type-id-162'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' hash='d9e8b1e2ff6ad509' id='type-id-285'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' hash='4c960793080560da' id='type-id-286'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='61a6808aad469222' id='type-id-287'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' hash='011b46361395db51' id='type-id-288'/>
    <qualified-type-def type-id='type-id-275' const='yes' hash='b6a29317dba2d8bf' id='type-id-289'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' hash='210937d8e4dfefc4' id='type-id-290'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-291'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' hash='9f577e0cb45a155c' id='type-id-292'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-265'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-272'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-266'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-270'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-271'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-274'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' hash='6deef6b7069cfec0' id='type-id-295'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' hash='26fcafb8f090dab2' id='type-id-148'/>
    <pointer-type-def type-id='type-id-142' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-262'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-264'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-280'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-277'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-273'/>
    <qualified-type-def type-id='type-id-41' volatile='yes' hash='3fc2d25d4fbd22c7' id='type-id-300'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' hash='d3f127febcb1daae' id='type-id-146'/>
    <qualified-type-def type-id='type-id-4' volatile='yes' hash='0441c2c5cfdaba96' id='type-id-301'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-303'/>
    <qualified-type-def type-id='type-id-302' const='yes' id='type-id-304'/>
    <pointer-type-def type-id='type-id-304' size-in-bits='64' id='type-id-53'/>
    <function-decl name='__builtin___strncpy_chk' mangled-name='__strncpy_chk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__strncpy_chk' hash='7f32ffea222edbe7'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__builtin_strncpy' mangled-name='strncpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-4'/>
    </function-decl>
    <class-decl name='_GVariantType' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-305'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-147'/>
    <typedef-decl name='GVariantType' type-id='type-id-305' filepath='../glib/gvarianttype.h' line='34' column='1' id='type-id-302'/>
    <function-decl name='g_object_interface_find_property' mangled-name='g_object_interface_find_property' filepath='../gobject/gobject.c' line='1530' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_interface_find_property' hash='82681d06e9d4d1b6'>
      <parameter type-id='type-id-2' name='g_iface' filepath='../gobject/gobject.c' line='1530' column='1'/>
      <parameter type-id='type-id-8' name='property_name' filepath='../gobject/gobject.c' line='1531' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_object_class_override_property' mangled-name='g_object_class_override_property' filepath='../gobject/gobject.c' line='1574' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_class_override_property' hash='aabb92214fc23d99'>
      <parameter type-id='type-id-306' name='oclass' filepath='../gobject/gobject.c' line='1574' column='1'/>
      <parameter type-id='type-id-16' name='property_id' filepath='../gobject/gobject.c' line='1575' column='1'/>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gobject.c' line='1576' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_class_list_properties' mangled-name='g_object_class_list_properties' filepath='../gobject/gobject.c' line='1638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_class_list_properties' hash='1dfc55ce6a8a94b3'>
      <parameter type-id='type-id-306' name='class' filepath='../gobject/gobject.c' line='1638' column='1'/>
      <parameter type-id='type-id-295' name='n_properties_p' filepath='../gobject/gobject.c' line='1639' column='1'/>
      <return type-id='type-id-307'/>
    </function-decl>
    <function-decl name='g_object_interface_list_properties' mangled-name='g_object_interface_list_properties' filepath='../gobject/gobject.c' line='1675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_interface_list_properties' hash='805056520f2a5786'>
      <parameter type-id='type-id-2' name='g_iface' filepath='../gobject/gobject.c' line='1675' column='1'/>
      <parameter type-id='type-id-295' name='n_properties_p' filepath='../gobject/gobject.c' line='1676' column='1'/>
      <return type-id='type-id-307'/>
    </function-decl>
    <function-decl name='g_object_run_dispose' mangled-name='g_object_run_dispose' filepath='../gobject/gobject.c' line='1902' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_run_dispose' hash='6fe16b214fd52931'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='1941' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_freeze_notify' mangled-name='g_object_freeze_notify' filepath='../gobject/gobject.c' line='1941' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_freeze_notify' hash='6fe16b214fd52931'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='1941' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_notify' mangled-name='g_object_notify' filepath='../gobject/gobject.c' line='2021' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_notify' hash='1f607bbb15207612'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='2021' column='1'/>
      <parameter type-id='type-id-8' name='property_name' filepath='../gobject/gobject.c' line='2022' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_notify_by_pspec' mangled-name='g_object_notify_by_pspec' filepath='../gobject/gobject.c' line='2093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_notify_by_pspec' hash='0b2f5f57ef48aa48'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='2093' column='1'/>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gobject.c' line='2094' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_thaw_notify' mangled-name='g_object_thaw_notify' filepath='../gobject/gobject.c' line='2118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_thaw_notify' hash='6fe16b214fd52931'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='1941' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_get_type' mangled-name='g_object_get_type' filepath='../gobject/gobject.c' line='2424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_object_new' mangled-name='g_object_new' filepath='../gobject/gobject.c' line='2467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_new' hash='5ae21ed5468382fc'>
      <parameter type-id='type-id-263' name='object_type' filepath='../gobject/gobject.c' line='2467' column='1'/>
      <parameter type-id='type-id-8' name='first_property_name' filepath='../gobject/gobject.c' line='2468' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_new_with_properties' mangled-name='g_object_new_with_properties' filepath='../gobject/gobject.c' line='2790' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_new_with_properties' hash='0b069b79f14ad99f'>
      <parameter type-id='type-id-263' name='object_type' filepath='../gobject/gobject.c' line='2790' column='1'/>
      <parameter type-id='type-id-16' name='n_properties' filepath='../gobject/gobject.c' line='2791' column='1'/>
      <parameter type-id='type-id-291' name='names' filepath='../gobject/gobject.c' line='2792' column='1'/>
      <parameter type-id='type-id-11' name='values' filepath='../gobject/gobject.c' line='2793' column='1'/>
      <return type-id='type-id-284'/>
    </function-decl>
    <function-decl name='g_object_newv' mangled-name='g_object_newv' filepath='../gobject/gobject.c' line='2854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_newv' hash='a749bcc394de5f46'>
      <parameter type-id='type-id-263' name='object_type' filepath='../gobject/gobject.c' line='2854' column='1'/>
      <parameter type-id='type-id-16' name='n_parameters' filepath='../gobject/gobject.c' line='2855' column='1'/>
      <parameter type-id='type-id-286' name='parameters' filepath='../gobject/gobject.c' line='2856' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_new_valist' mangled-name='g_object_new_valist' filepath='../gobject/gobject.c' line='2920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_new_valist' hash='1697beec4473eb88'>
      <parameter type-id='type-id-263' name='object_type' filepath='../gobject/gobject.c' line='2920' column='1'/>
      <parameter type-id='type-id-8' name='first_property_name' filepath='../gobject/gobject.c' line='2921' column='1'/>
      <parameter type-id='type-id-172' name='var_args' filepath='../gobject/gobject.c' line='2922' column='1'/>
      <return type-id='type-id-284'/>
    </function-decl>
    <function-decl name='g_object_setv' mangled-name='g_object_setv' filepath='../gobject/gobject.c' line='3113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_setv' hash='a86f4420c6d773ad'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='3113' column='1'/>
      <parameter type-id='type-id-16' name='n_properties' filepath='../gobject/gobject.c' line='3114' column='1'/>
      <parameter type-id='type-id-292' name='names' filepath='../gobject/gobject.c' line='3115' column='1'/>
      <parameter type-id='type-id-11' name='values' filepath='../gobject/gobject.c' line='3116' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_set_valist' mangled-name='g_object_set_valist' filepath='../gobject/gobject.c' line='3164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_set_valist' hash='d3d56121577dbadc'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='3164' column='1'/>
      <parameter type-id='type-id-8' name='first_property_name' filepath='../gobject/gobject.c' line='3165' column='1'/>
      <parameter type-id='type-id-172' name='var_args' filepath='../gobject/gobject.c' line='3166' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_getv' mangled-name='g_object_getv' filepath='../gobject/gobject.c' line='3258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_getv' hash='5b40830b6a3b9a91'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='3258' column='1'/>
      <parameter type-id='type-id-16' name='n_properties' filepath='../gobject/gobject.c' line='3259' column='1'/>
      <parameter type-id='type-id-292' name='names' filepath='../gobject/gobject.c' line='3260' column='1'/>
      <parameter type-id='type-id-15' name='values' filepath='../gobject/gobject.c' line='3261' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_get_valist' mangled-name='g_object_get_valist' filepath='../gobject/gobject.c' line='3306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_get_valist' hash='d3d56121577dbadc'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='3164' column='1'/>
      <parameter type-id='type-id-8' name='first_property_name' filepath='../gobject/gobject.c' line='3165' column='1'/>
      <parameter type-id='type-id-172' name='var_args' filepath='../gobject/gobject.c' line='3166' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_set' mangled-name='g_object_set' filepath='../gobject/gobject.c' line='3372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_set' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-2' name='_object' filepath='../gobject/gobject.c' line='3650' column='1'/>
      <parameter type-id='type-id-8' name='signal_spec' filepath='../gobject/gobject.c' line='3651' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_get' mangled-name='g_object_get' filepath='../gobject/gobject.c' line='3421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_get' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-2' name='_object' filepath='../gobject/gobject.c' line='3650' column='1'/>
      <parameter type-id='type-id-8' name='signal_spec' filepath='../gobject/gobject.c' line='3651' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_set_property' mangled-name='g_object_set_property' filepath='../gobject/gobject.c' line='3444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_set_property' hash='fc7ee6f7cde87080'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_get_property' mangled-name='g_object_get_property' filepath='../gobject/gobject.c' line='3475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_get_property' hash='893bffd963bae939'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_connect' mangled-name='g_object_connect' filepath='../gobject/gobject.c' line='3567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_connect' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-2' name='_object' filepath='../gobject/gobject.c' line='3567' column='1'/>
      <parameter type-id='type-id-8' name='signal_spec' filepath='../gobject/gobject.c' line='3568' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_disconnect' mangled-name='g_object_disconnect' filepath='../gobject/gobject.c' line='3650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_disconnect' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-2' name='_object' filepath='../gobject/gobject.c' line='3650' column='1'/>
      <parameter type-id='type-id-8' name='signal_spec' filepath='../gobject/gobject.c' line='3651' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_weak_ref' mangled-name='g_object_weak_ref' filepath='../gobject/gobject.c' line='3847' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_weak_ref' hash='15371e00e40a3f79'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='3847' column='1'/>
      <parameter type-id='type-id-281' name='notify' filepath='../gobject/gobject.c' line='3848' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gobject.c' line='3849' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_weak_unref' mangled-name='g_object_weak_unref' filepath='../gobject/gobject.c' line='3927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_weak_unref' hash='15371e00e40a3f79'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='3847' column='1'/>
      <parameter type-id='type-id-281' name='notify' filepath='../gobject/gobject.c' line='3848' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gobject.c' line='3849' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_add_weak_pointer' mangled-name='g_object_add_weak_pointer' filepath='../gobject/gobject.c' line='4089' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_add_weak_pointer' hash='7ba94f5b3d9d6b13'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='4089' column='1'/>
      <parameter type-id='type-id-26' name='weak_pointer_location' filepath='../gobject/gobject.c' line='4090' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_remove_weak_pointer' mangled-name='g_object_remove_weak_pointer' filepath='../gobject/gobject.c' line='4111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_remove_weak_pointer' hash='7ba94f5b3d9d6b13'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='4089' column='1'/>
      <parameter type-id='type-id-26' name='weak_pointer_location' filepath='../gobject/gobject.c' line='4090' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_is_floating' mangled-name='g_object_is_floating' filepath='../gobject/gobject.c' line='4161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_is_floating' hash='388da3fa973fde78'>
      <parameter type-id='type-id-2' name='_object' filepath='../gobject/gobject.c' line='4161' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_object_ref_sink' mangled-name='g_object_ref_sink' filepath='../gobject/gobject.c' line='4189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_ref_sink' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_take_ref' mangled-name='g_object_take_ref' filepath='../gobject/gobject.c' line='4247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_take_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_force_floating' mangled-name='g_object_force_floating' filepath='../gobject/gobject.c' line='4270' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_force_floating' hash='6fe16b214fd52931'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='1941' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_add_toggle_ref' mangled-name='g_object_add_toggle_ref' filepath='../gobject/gobject.c' line='4471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_add_toggle_ref' hash='15371e00e40a3f79'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='4471' column='1'/>
      <parameter type-id='type-id-278' name='notify' filepath='../gobject/gobject.c' line='4472' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gobject.c' line='4473' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_remove_toggle_ref' mangled-name='g_object_remove_toggle_ref' filepath='../gobject/gobject.c' line='4554' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_remove_toggle_ref' hash='15371e00e40a3f79'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='4471' column='1'/>
      <parameter type-id='type-id-278' name='notify' filepath='../gobject/gobject.c' line='4472' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gobject.c' line='4473' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_ref' mangled-name='g_object_ref' filepath='../gobject/gobject.c' line='4650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_unref' mangled-name='g_object_unref' filepath='../gobject/gobject.c' line='4734' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_clear_object' mangled-name='g_clear_object' filepath='../gobject/gobject.c' line='4942' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_clear_object' hash='a119a4536a4e1646'>
      <parameter type-id='type-id-285' name='object_ptr' filepath='../gobject/gobject.c' line='4942' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_get_qdata' mangled-name='g_object_get_qdata' filepath='../gobject/gobject.c' line='4958' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_get_qdata' hash='5b485c2f0e37ac45'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='4958' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gobject.c' line='4959' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_set_qdata' mangled-name='g_object_set_qdata' filepath='../gobject/gobject.c' line='4982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_set_qdata' hash='5b485c2f0e37ac45'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='4982' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gobject.c' line='4983' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gobject.c' line='4984' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_dup_qdata' mangled-name='g_object_dup_qdata' filepath='../gobject/gobject.c' line='5022' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_dup_qdata' hash='bf6949763e290d80'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5022' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gobject.c' line='5023' column='1'/>
      <parameter type-id='type-id-150' name='dup_func' filepath='../gobject/gobject.c' line='5024' column='1'/>
      <parameter type-id='type-id-2' name='user_data' filepath='../gobject/gobject.c' line='5025' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_replace_qdata' mangled-name='g_object_replace_qdata' filepath='../gobject/gobject.c' line='5062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_replace_qdata' hash='b27da1044d1d9119'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5062' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gobject.c' line='5063' column='1'/>
      <parameter type-id='type-id-2' name='oldval' filepath='../gobject/gobject.c' line='5064' column='1'/>
      <parameter type-id='type-id-2' name='newval' filepath='../gobject/gobject.c' line='5065' column='1'/>
      <parameter type-id='type-id-3' name='destroy' filepath='../gobject/gobject.c' line='5066' column='1'/>
      <parameter type-id='type-id-151' name='old_destroy' filepath='../gobject/gobject.c' line='5067' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_object_set_qdata_full' mangled-name='g_object_set_qdata_full' filepath='../gobject/gobject.c' line='5092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_set_qdata_full' hash='bf6949763e290d80'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5092' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gobject.c' line='5093' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gobject.c' line='5094' column='1'/>
      <parameter type-id='type-id-3' name='destroy' filepath='../gobject/gobject.c' line='5095' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_steal_qdata' mangled-name='g_object_steal_qdata' filepath='../gobject/gobject.c' line='5148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_steal_qdata' hash='5b485c2f0e37ac45'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='4958' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gobject.c' line='4959' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_get_data' mangled-name='g_object_get_data' filepath='../gobject/gobject.c' line='5168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_get_data' hash='1f607bbb15207612'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5168' column='1'/>
      <parameter type-id='type-id-8' name='key' filepath='../gobject/gobject.c' line='5169' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_set_data' mangled-name='g_object_set_data' filepath='../gobject/gobject.c' line='5195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_set_data' hash='1f607bbb15207612'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5195' column='1'/>
      <parameter type-id='type-id-8' name='key' filepath='../gobject/gobject.c' line='5196' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gobject.c' line='5197' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_dup_data' mangled-name='g_object_dup_data' filepath='../gobject/gobject.c' line='5235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_dup_data' hash='31e84a64329ff553'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5235' column='1'/>
      <parameter type-id='type-id-8' name='key' filepath='../gobject/gobject.c' line='5236' column='1'/>
      <parameter type-id='type-id-150' name='dup_func' filepath='../gobject/gobject.c' line='5237' column='1'/>
      <parameter type-id='type-id-2' name='user_data' filepath='../gobject/gobject.c' line='5238' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_replace_data' mangled-name='g_object_replace_data' filepath='../gobject/gobject.c' line='5280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_replace_data' hash='07f0e3c1ab120bf0'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5280' column='1'/>
      <parameter type-id='type-id-8' name='key' filepath='../gobject/gobject.c' line='5281' column='1'/>
      <parameter type-id='type-id-2' name='oldval' filepath='../gobject/gobject.c' line='5282' column='1'/>
      <parameter type-id='type-id-2' name='newval' filepath='../gobject/gobject.c' line='5283' column='1'/>
      <parameter type-id='type-id-3' name='destroy' filepath='../gobject/gobject.c' line='5284' column='1'/>
      <parameter type-id='type-id-151' name='old_destroy' filepath='../gobject/gobject.c' line='5285' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_object_set_data_full' mangled-name='g_object_set_data_full' filepath='../gobject/gobject.c' line='5310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_set_data_full' hash='31e84a64329ff553'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5310' column='1'/>
      <parameter type-id='type-id-8' name='key' filepath='../gobject/gobject.c' line='5311' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gobject.c' line='5312' column='1'/>
      <parameter type-id='type-id-3' name='destroy' filepath='../gobject/gobject.c' line='5313' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_object_steal_data' mangled-name='g_object_steal_data' filepath='../gobject/gobject.c' line='5334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_steal_data' hash='1f607bbb15207612'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5168' column='1'/>
      <parameter type-id='type-id-8' name='key' filepath='../gobject/gobject.c' line='5169' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_value_set_object' mangled-name='g_value_set_object' filepath='../gobject/gobject.c' line='5452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_object' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_set_object_take_ownership' mangled-name='g_value_set_object_take_ownership' filepath='../gobject/gobject.c' line='5485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_object_take_ownership' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_take_object' mangled-name='g_value_take_object' filepath='../gobject/gobject.c' line='5507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_take_object' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_get_object' mangled-name='g_value_get_object' filepath='../gobject/gobject.c' line='5532' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_object' hash='fe8357e11df9e46f'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_value_dup_object' mangled-name='g_value_dup_object' filepath='../gobject/gobject.c' line='5551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_dup_object' hash='fe8357e11df9e46f'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_signal_connect_object' mangled-name='g_signal_connect_object' filepath='../gobject/gobject.c' line='5587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_connect_object' hash='5fabea6422d8c8e0'>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gobject.c' line='5587' column='1'/>
      <parameter type-id='type-id-8' name='detailed_signal' filepath='../gobject/gobject.c' line='5588' column='1'/>
      <parameter type-id='type-id-308' name='c_handler' filepath='../gobject/gobject.c' line='5589' column='1'/>
      <parameter type-id='type-id-2' name='gobject' filepath='../gobject/gobject.c' line='5590' column='1'/>
      <parameter type-id='type-id-255' name='connect_flags' filepath='../gobject/gobject.c' line='5591' column='1'/>
      <return type-id='type-id-169'/>
    </function-decl>
    <function-decl name='g_object_watch_closure' mangled-name='g_object_watch_closure' filepath='../gobject/gobject.c' line='5752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_watch_closure' hash='e31955d4e6e59b30'>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_closure_new_object' mangled-name='g_closure_new_object' filepath='../gobject/gobject.c' line='5787' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_closure_new_object' hash='33c59090ad690b1e'>
      <parameter type-id='type-id-16' name='sizeof_closure' filepath='../gobject/gobject.c' line='5787' column='1'/>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5788' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_cclosure_new_object' mangled-name='g_cclosure_new_object' filepath='../gobject/gobject.c' line='5815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_cclosure_new_object' hash='cbfa5c9ee8a56cdb'>
      <parameter type-id='type-id-308' name='callback_func' filepath='../gobject/gobject.c' line='5844' column='1'/>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5845' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_cclosure_new_object_swap' mangled-name='g_cclosure_new_object_swap' filepath='../gobject/gobject.c' line='5844' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_cclosure_new_object_swap' hash='cbfa5c9ee8a56cdb'>
      <parameter type-id='type-id-308' name='callback_func' filepath='../gobject/gobject.c' line='5844' column='1'/>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='5845' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_object_compat_control' mangled-name='g_object_compat_control' filepath='../gobject/gobject.c' line='5860' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_compat_control' hash='91495cdf6321a116'>
      <parameter type-id='type-id-1' name='what' filepath='../gobject/gobject.c' line='5860' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gobject.c' line='5861' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_initially_unowned_get_type' mangled-name='g_initially_unowned_get_type' filepath='../gobject/gobject.c' line='5880' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_initially_unowned_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_weak_ref_init' mangled-name='g_weak_ref_init' filepath='../gobject/gobject.c' line='6138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_weak_ref_init' hash='2cba033cb52ed1fa'>
      <parameter type-id='type-id-309'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_weak_ref_clear' mangled-name='g_weak_ref_clear' filepath='../gobject/gobject.c' line='6168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_weak_ref_clear' hash='2cba033cb52ed1fa'>
      <parameter type-id='type-id-309' name='weak_ref' filepath='../gobject/gobject.c' line='6168' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_weak_ref_get' mangled-name='g_weak_ref_get' filepath='../gobject/gobject.c' line='6196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_weak_ref_get' hash='2cba033cb52ed1fa'>
      <parameter type-id='type-id-309' name='weak_ref' filepath='../gobject/gobject.c' line='6196' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_weak_ref_set' mangled-name='g_weak_ref_set' filepath='../gobject/gobject.c' line='6299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_weak_ref_set' hash='2cba033cb52ed1fa'>
      <parameter type-id='type-id-309'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_param_spec_ref' mangled-name='g_param_spec_ref' filepath='../gobject/gparam.c' line='213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_ref' hash='c1d5f7228b423e3e'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_unref' mangled-name='g_param_spec_unref' filepath='../gobject/gparam.c' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_unref' hash='26165d0039618a4f'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_param_spec_sink' mangled-name='g_param_spec_sink' filepath='../gobject/gparam.c' line='256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_sink' hash='26165d0039618a4f'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_param_spec_ref_sink' mangled-name='g_param_spec_ref_sink' filepath='../gobject/gparam.c' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_ref_sink' hash='c1d5f7228b423e3e'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_get_name' mangled-name='g_param_spec_get_name' filepath='../gobject/gparam.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_get_name' hash='f484db09efcff1df'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='300' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='g_param_spec_get_nick' mangled-name='g_param_spec_get_nick' filepath='../gobject/gparam.c' line='316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_get_nick' hash='f484db09efcff1df'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='300' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='g_param_spec_get_blurb' mangled-name='g_param_spec_get_blurb' filepath='../gobject/gparam.c' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_get_blurb' hash='f484db09efcff1df'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='300' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='g_param_spec_is_valid_name' mangled-name='g_param_spec_is_valid_name' filepath='../gobject/gparam.c' line='399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_is_valid_name' hash='d731989df7e70156'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_param_spec_internal' mangled-name='g_param_spec_internal' filepath='../gobject/gparam.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_internal' hash='e75f28e9c30da94d'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_param_spec_get_qdata' mangled-name='g_param_spec_get_qdata' filepath='../gobject/gparam.c' line='511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_get_qdata' hash='be289b952b7a7ad7'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='511' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gparam.c' line='512' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_param_spec_set_qdata' mangled-name='g_param_spec_set_qdata' filepath='../gobject/gparam.c' line='533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_set_qdata' hash='be289b952b7a7ad7'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='533' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gparam.c' line='534' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gparam.c' line='535' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_param_spec_set_qdata_full' mangled-name='g_param_spec_set_qdata_full' filepath='../gobject/gparam.c' line='558' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_set_qdata_full' hash='60950665ebcd5e42'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='558' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gparam.c' line='559' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gparam.c' line='560' column='1'/>
      <parameter type-id='type-id-3' name='destroy' filepath='../gobject/gparam.c' line='561' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_param_spec_steal_qdata' mangled-name='g_param_spec_steal_qdata' filepath='../gobject/gparam.c' line='582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_steal_qdata' hash='be289b952b7a7ad7'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='511' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gparam.c' line='512' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_param_spec_get_redirect_target' mangled-name='g_param_spec_get_redirect_target' filepath='../gobject/gparam.c' line='609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_get_redirect_target' hash='c1d5f7228b423e3e'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_value_set_default' mangled-name='g_param_value_set_default' filepath='../gobject/gparam.c' line='628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_value_set_default' hash='23be2bd3d3c71579'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='628' column='1'/>
      <parameter type-id='type-id-15' name='value' filepath='../gobject/gparam.c' line='629' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_param_value_defaults' mangled-name='g_param_value_defaults' filepath='../gobject/gparam.c' line='657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_value_defaults' hash='b28879f99e136c0f'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_param_value_validate' mangled-name='g_param_value_validate' filepath='../gobject/gparam.c' line='690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_value_validate' hash='a88560a47b79f56a'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='690' column='1'/>
      <parameter type-id='type-id-15' name='value' filepath='../gobject/gparam.c' line='691' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_param_value_is_valid' mangled-name='g_param_value_is_valid' filepath='../gobject/gparam.c' line='723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_value_is_valid' hash='b28879f99e136c0f'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_param_value_convert' mangled-name='g_param_value_convert' filepath='../gobject/gparam.c' line='774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_value_convert' hash='535c45f12e139660'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='774' column='1'/>
      <parameter type-id='type-id-11' name='src_value' filepath='../gobject/gparam.c' line='775' column='1'/>
      <parameter type-id='type-id-15' name='dest_value' filepath='../gobject/gparam.c' line='776' column='1'/>
      <parameter type-id='type-id-9' name='strict_validation' filepath='../gobject/gparam.c' line='777' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_param_values_cmp' mangled-name='g_param_values_cmp' filepath='../gobject/gparam.c' line='820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_values_cmp' hash='afc5d71ff2523962'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='g_param_spec_pool_new' mangled-name='g_param_spec_pool_new' filepath='../gobject/gparam.c' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_pool_new' hash='f8556f94b7872eb8'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-311'/>
    </function-decl>
    <function-decl name='g_param_spec_pool_free' mangled-name='g_param_spec_pool_free' filepath='../gobject/gparam.c' line='1014' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_pool_free' hash='5e6a83357d0e312f'>
      <parameter type-id='type-id-311'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_param_spec_pool_insert' mangled-name='g_param_spec_pool_insert' filepath='../gobject/gparam.c' line='1032' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_pool_insert' hash='bc98c8f6d8db75dd'>
      <parameter type-id='type-id-311'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_param_spec_pool_remove' mangled-name='g_param_spec_pool_remove' filepath='../gobject/gparam.c' line='1071' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_pool_remove' hash='e4fcd26e911abfd9'>
      <parameter type-id='type-id-311'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_param_spec_pool_lookup' mangled-name='g_param_spec_pool_lookup' filepath='../gobject/gparam.c' line='1156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_pool_lookup' hash='d64b970520707362'>
      <parameter type-id='type-id-311'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_pool_list_owned' mangled-name='g_param_spec_pool_list_owned' filepath='../gobject/gparam.c' line='1246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_pool_list_owned' hash='96bb19f86bba3955'>
      <parameter type-id='type-id-311'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-152'/>
    </function-decl>
    <function-decl name='g_param_spec_pool_list' mangled-name='g_param_spec_pool_list' filepath='../gobject/gparam.c' line='1377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_pool_list' hash='b395c40f7acf5c2b'>
      <parameter type-id='type-id-311'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-295'/>
      <return type-id='type-id-307'/>
    </function-decl>
    <function-decl name='g_param_type_register_static' mangled-name='g_param_type_register_static' filepath='../gobject/gparam.c' line='1485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_type_register_static' hash='02bcfc435fb4d8c9'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-290'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_value_set_param' mangled-name='g_value_set_param' filepath='../gobject/gparam.c' line='1533' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_param' hash='0c6a4a91e15fa1e1'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_set_param_take_ownership' mangled-name='g_value_set_param_take_ownership' filepath='../gobject/gparam.c' line='1557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_param_take_ownership' hash='0c6a4a91e15fa1e1'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_take_param' mangled-name='g_value_take_param' filepath='../gobject/gparam.c' line='1575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_take_param' hash='0c6a4a91e15fa1e1'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_get_param' mangled-name='g_value_get_param' filepath='../gobject/gparam.c' line='1596' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_param' hash='7cf5d6b18c9263f7'>
      <parameter type-id='type-id-11' name='value' filepath='../gobject/gparam.c' line='1596' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_value_dup_param' mangled-name='g_value_dup_param' filepath='../gobject/gparam.c' line='1614' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_dup_param' hash='7cf5d6b18c9263f7'>
      <parameter type-id='type-id-11' name='value' filepath='../gobject/gparam.c' line='1596' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_get_default_value' mangled-name='g_param_spec_get_default_value' filepath='../gobject/gparam.c' line='1634' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_get_default_value' hash='8aecf1ef4060340a'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='g_param_spec_get_name_quark' mangled-name='g_param_spec_get_name_quark' filepath='../gobject/gparam.c' line='1678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_get_name_quark' hash='971b07260a898fa1'>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='g_param_spec_char' mangled-name='g_param_spec_char' filepath='../gobject/gparamspecs.c' line='1838' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_char' hash='b2a99cf423570f45'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='1838' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='1839' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='1840' column='1'/>
      <parameter type-id='type-id-312' name='minimum' filepath='../gobject/gparamspecs.c' line='1841' column='1'/>
      <parameter type-id='type-id-312' name='maximum' filepath='../gobject/gparamspecs.c' line='1842' column='1'/>
      <parameter type-id='type-id-312' name='default_value' filepath='../gobject/gparamspecs.c' line='1843' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='1844' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_uchar' mangled-name='g_param_spec_uchar' filepath='../gobject/gparamspecs.c' line='1878' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_uchar' hash='cc5782a428c86f45'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='1878' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='1879' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='1880' column='1'/>
      <parameter type-id='type-id-74' name='minimum' filepath='../gobject/gparamspecs.c' line='1881' column='1'/>
      <parameter type-id='type-id-74' name='maximum' filepath='../gobject/gparamspecs.c' line='1882' column='1'/>
      <parameter type-id='type-id-74' name='default_value' filepath='../gobject/gparamspecs.c' line='1883' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='1884' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_boolean' mangled-name='g_param_spec_boolean' filepath='../gobject/gparamspecs.c' line='1922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_boolean' hash='b1e181f2a2fa0329'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='1922' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='1923' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='1924' column='1'/>
      <parameter type-id='type-id-9' name='default_value' filepath='../gobject/gparamspecs.c' line='1925' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='1926' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_int' mangled-name='g_param_spec_int' filepath='../gobject/gparamspecs.c' line='1960' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_int' hash='a76d693025079d4b'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='1960' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='1961' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='1962' column='1'/>
      <parameter type-id='type-id-41' name='minimum' filepath='../gobject/gparamspecs.c' line='1963' column='1'/>
      <parameter type-id='type-id-41' name='maximum' filepath='../gobject/gparamspecs.c' line='1964' column='1'/>
      <parameter type-id='type-id-41' name='default_value' filepath='../gobject/gparamspecs.c' line='1965' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='1966' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_uint' mangled-name='g_param_spec_uint' filepath='../gobject/gparamspecs.c' line='2002' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_uint' hash='bd6ffaa62897df84'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2002' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2003' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2004' column='1'/>
      <parameter type-id='type-id-16' name='minimum' filepath='../gobject/gparamspecs.c' line='2005' column='1'/>
      <parameter type-id='type-id-16' name='maximum' filepath='../gobject/gparamspecs.c' line='2006' column='1'/>
      <parameter type-id='type-id-16' name='default_value' filepath='../gobject/gparamspecs.c' line='2007' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2008' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_long' mangled-name='g_param_spec_long' filepath='../gobject/gparamspecs.c' line='2044' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_long' hash='b26f7094018e862a'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2044' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2045' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2046' column='1'/>
      <parameter type-id='type-id-313' name='minimum' filepath='../gobject/gparamspecs.c' line='2047' column='1'/>
      <parameter type-id='type-id-313' name='maximum' filepath='../gobject/gparamspecs.c' line='2048' column='1'/>
      <parameter type-id='type-id-313' name='default_value' filepath='../gobject/gparamspecs.c' line='2049' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2050' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_ulong' mangled-name='g_param_spec_ulong' filepath='../gobject/gparamspecs.c' line='2087' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_ulong' hash='7693ee3149b0fcc1'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2087' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2088' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2089' column='1'/>
      <parameter type-id='type-id-169' name='minimum' filepath='../gobject/gparamspecs.c' line='2090' column='1'/>
      <parameter type-id='type-id-169' name='maximum' filepath='../gobject/gparamspecs.c' line='2091' column='1'/>
      <parameter type-id='type-id-169' name='default_value' filepath='../gobject/gparamspecs.c' line='2092' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2093' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_int64' mangled-name='g_param_spec_int64' filepath='../gobject/gparamspecs.c' line='2129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_int64' hash='b26f7094018e862a'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2129' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2130' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2131' column='1'/>
      <parameter type-id='type-id-215' name='minimum' filepath='../gobject/gparamspecs.c' line='2132' column='1'/>
      <parameter type-id='type-id-215' name='maximum' filepath='../gobject/gparamspecs.c' line='2133' column='1'/>
      <parameter type-id='type-id-215' name='default_value' filepath='../gobject/gparamspecs.c' line='2134' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2135' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_uint64' mangled-name='g_param_spec_uint64' filepath='../gobject/gparamspecs.c' line='2172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_uint64' hash='7693ee3149b0fcc1'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2172' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2173' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2174' column='1'/>
      <parameter type-id='type-id-314' name='minimum' filepath='../gobject/gparamspecs.c' line='2175' column='1'/>
      <parameter type-id='type-id-314' name='maximum' filepath='../gobject/gparamspecs.c' line='2176' column='1'/>
      <parameter type-id='type-id-314' name='default_value' filepath='../gobject/gparamspecs.c' line='2177' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2178' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_unichar' mangled-name='g_param_spec_unichar' filepath='../gobject/gparamspecs.c' line='2214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_unichar' hash='be48228d229e2090'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2214' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2215' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2216' column='1'/>
      <parameter type-id='type-id-162' name='default_value' filepath='../gobject/gparamspecs.c' line='2217' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2218' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_enum' mangled-name='g_param_spec_enum' filepath='../gobject/gparamspecs.c' line='2250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_enum' hash='35df6da397f6c6da'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2250' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2251' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2252' column='1'/>
      <parameter type-id='type-id-263' name='enum_type' filepath='../gobject/gparamspecs.c' line='2253' column='1'/>
      <parameter type-id='type-id-41' name='default_value' filepath='../gobject/gparamspecs.c' line='2254' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2255' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_flags' mangled-name='g_param_spec_flags' filepath='../gobject/gparamspecs.c' line='2296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_flags' hash='7912bed6fc7be1bd'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_float' mangled-name='g_param_spec_float' filepath='../gobject/gparamspecs.c' line='2342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_float' hash='4c09179b6d18af36'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2342' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2343' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2344' column='1'/>
      <parameter type-id='type-id-315' name='minimum' filepath='../gobject/gparamspecs.c' line='2345' column='1'/>
      <parameter type-id='type-id-315' name='maximum' filepath='../gobject/gparamspecs.c' line='2346' column='1'/>
      <parameter type-id='type-id-315' name='default_value' filepath='../gobject/gparamspecs.c' line='2347' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2348' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_double' mangled-name='g_param_spec_double' filepath='../gobject/gparamspecs.c' line='2385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_double' hash='e308860955abd5ef'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2385' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2386' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2387' column='1'/>
      <parameter type-id='type-id-316' name='minimum' filepath='../gobject/gparamspecs.c' line='2388' column='1'/>
      <parameter type-id='type-id-316' name='maximum' filepath='../gobject/gparamspecs.c' line='2389' column='1'/>
      <parameter type-id='type-id-316' name='default_value' filepath='../gobject/gparamspecs.c' line='2390' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2391' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_string' mangled-name='g_param_spec_string' filepath='../gobject/gparamspecs.c' line='2425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_string' hash='f3e836d26e5379e6'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_param' mangled-name='g_param_spec_param' filepath='../gobject/gparamspecs.c' line='2459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_param' hash='6d0441d7d6a9df59'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_boxed' mangled-name='g_param_spec_boxed' filepath='../gobject/gparamspecs.c' line='2496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_boxed' hash='6d0441d7d6a9df59'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_pointer' mangled-name='g_param_spec_pointer' filepath='../gobject/gparamspecs.c' line='2534' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_pointer' hash='eedb41fd68fc4746'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2534' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2535' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2536' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2537' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_gtype' mangled-name='g_param_spec_gtype' filepath='../gobject/gparamspecs.c' line='2569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_gtype' hash='6d0441d7d6a9df59'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_value_array' mangled-name='g_param_spec_value_array' filepath='../gobject/gparamspecs.c' line='2607' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_value_array' hash='8ec7b3ab06c6cf5d'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2607' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2608' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2609' column='1'/>
      <parameter type-id='type-id-22' name='element_spec' filepath='../gobject/gparamspecs.c' line='2610' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2611' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_object' mangled-name='g_param_spec_object' filepath='../gobject/gparamspecs.c' line='2648' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_object' hash='6d0441d7d6a9df59'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_param_spec_override' mangled-name='g_param_spec_override' filepath='../gobject/gparamspecs.c' line='2683' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_override' hash='6b769432683bff86'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-22'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-type size-in-bits='64' hash='a88560a47b79f56a' id='type-id-293'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='690' column='1'/>
      <parameter type-id='type-id-15' name='value' filepath='../gobject/gparam.c' line='691' column='1'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-294'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' hash='23be2bd3d3c71579' id='type-id-296'>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gparam.c' line='628' column='1'/>
      <parameter type-id='type-id-15' name='value' filepath='../gobject/gparam.c' line='629' column='1'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='6fe16b214fd52931' id='type-id-297'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-284'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='59ad7aac58d4f94c' id='type-id-298'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-284'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-299'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-317'>
      <parameter type-id='type-id-2' name='_object' filepath='../gobject/gobject.c' line='4161' column='1'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='6fe16b214fd52931' id='type-id-318'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='1941' column='1'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='0b2f5f57ef48aa48' id='type-id-319'>
      <parameter type-id='type-id-284' name='object' filepath='../gobject/gobject.c' line='2093' column='1'/>
      <parameter type-id='type-id-22' name='pspec' filepath='../gobject/gobject.c' line='2094' column='1'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='485dbe5a902b1524' id='type-id-320'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-2de21' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <class-decl name='_GArray' is-struct='yes' visibility='default' size-in-bits='128' filepath='../glib/garray.h' line='43' column='1' hash='da1d3f23bd1aae8f' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-42' visibility='default' filepath='../glib/garray.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-16' visibility='default' filepath='../glib/garray.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GRecMutex' is-struct='yes' visibility='default' size-in-bits='128' filepath='../glib/gthread.h' line='81' column='1' hash='d63e8fb0a9d97720' id='type-id-322'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='type-id-2' visibility='default' filepath='../glib/gthread.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='i' type-id='type-id-323' visibility='default' filepath='../glib/gthread.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSignalGroup' is-struct='yes' visibility='default' size-in-bits='640' filepath='../gobject/gsignalgroup.c' line='56' column='1' hash='fff6b082cd8f2cb2' id='type-id-324'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-18' visibility='default' filepath='../gobject/gsignalgroup.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='target_ref' type-id='type-id-325' visibility='default' filepath='../gobject/gsignalgroup.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mutex' type-id='type-id-326' visibility='default' filepath='../gobject/gsignalgroup.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='handlers' type-id='type-id-24' visibility='default' filepath='../gobject/gsignalgroup.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='target_type' type-id='type-id-263' visibility='default' filepath='../gobject/gsignalgroup.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='block_count' type-id='type-id-143' visibility='default' filepath='../gobject/gsignalgroup.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='has_bound_at_least_once' type-id='type-id-16' visibility='default' filepath='../gobject/gsignalgroup.c' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSignalQuery' is-struct='yes' visibility='default' size-in-bits='448' filepath='../gobject/gsignal.h' line='293' column='1' hash='bc605011e78fa2b7' id='type-id-327'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='signal_id' type-id='type-id-16' visibility='default' filepath='../gobject/gsignal.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='signal_name' type-id='type-id-8' visibility='default' filepath='../gobject/gsignal.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='itype' type-id='type-id-263' visibility='default' filepath='../gobject/gsignal.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='signal_flags' type-id='type-id-328' visibility='default' filepath='../gobject/gsignal.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='return_type' type-id='type-id-263' visibility='default' filepath='../gobject/gsignal.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='n_params' type-id='type-id-16' visibility='default' filepath='../gobject/gsignal.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='param_types' type-id='type-id-329' visibility='default' filepath='../gobject/gsignal.h' line='301' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSource' is-struct='yes' visibility='default' size-in-bits='768' filepath='../glib/gmain.h' line='267' column='1' hash='907c8642fe4ab2ed' id='type-id-330'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='callback_data' type-id='type-id-2' visibility='default' filepath='../glib/gmain.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='callback_funcs' type-id='type-id-214' visibility='default' filepath='../glib/gmain.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='source_funcs' type-id='type-id-331' visibility='default' filepath='../glib/gmain.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ref_count' type-id='type-id-16' visibility='default' filepath='../glib/gmain.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='context' type-id='type-id-134' visibility='default' filepath='../glib/gmain.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priority' type-id='type-id-41' visibility='default' filepath='../glib/gmain.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='flags' type-id='type-id-16' visibility='default' filepath='../glib/gmain.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='source_id' type-id='type-id-16' visibility='default' filepath='../glib/gmain.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='poll_fds' type-id='type-id-153' visibility='default' filepath='../glib/gmain.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='prev' type-id='type-id-135' visibility='default' filepath='../glib/gmain.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='next' type-id='type-id-135' visibility='default' filepath='../glib/gmain.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='name' type-id='type-id-332' visibility='default' filepath='../glib/gmain.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='priv' type-id='type-id-333' visibility='default' filepath='../glib/gmain.h' line='289' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSourceCallbackFuncs' is-struct='yes' visibility='default' size-in-bits='192' filepath='../glib/gmain.h' line='292' column='1' hash='5ce4f90a5649308f' id='type-id-334'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref' type-id='type-id-335' visibility='default' filepath='../glib/gmain.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='unref' type-id='type-id-335' visibility='default' filepath='../glib/gmain.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get' type-id='type-id-336' visibility='default' filepath='../glib/gmain.h' line='296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSourceFuncs' is-struct='yes' visibility='default' size-in-bits='384' filepath='../glib/gmain.h' line='399' column='1' hash='4c54e0c20bf56e0d' id='type-id-337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prepare' type-id='type-id-338' visibility='default' filepath='../glib/gmain.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='check' type-id='type-id-339' visibility='default' filepath='../glib/gmain.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dispatch' type-id='type-id-340' visibility='default' filepath='../glib/gmain.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='finalize' type-id='type-id-341' visibility='default' filepath='../glib/gmain.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure_callback' type-id='type-id-342' visibility='default' filepath='../glib/gmain.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='closure_marshal' type-id='type-id-343' visibility='default' filepath='../glib/gmain.h' line='409' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GArray' type-id='type-id-321' size-in-bits='128' filepath='../glib/garray.h' line='39' column='1' id='type-id-344'/>
    <typedef-decl name='GRecMutex' type-id='type-id-322' size-in-bits='128' filepath='../glib/gthread.h' line='54' column='1' id='type-id-326'/>
    <typedef-decl name='GSignalCVaMarshaller' type-id='type-id-345' size-in-bits='64' filepath='../gobject/gsignal.h' line='55' column='1' hash='fd7a63c0c6c822c4' id='type-id-346'/>
    <typedef-decl name='GSignalEmissionHook' type-id='type-id-347' size-in-bits='64' filepath='../gobject/gsignal.h' line='75' column='1' hash='fd7a63c0c6c822c4' id='type-id-348'/>
    <typedef-decl name='GSignalGroup' type-id='type-id-324' size-in-bits='640' filepath='../gobject/gsignalgroup.h' line='39' column='1' id='type-id-349'/>
    <typedef-decl name='GSignalQuery' type-id='type-id-327' size-in-bits='448' filepath='../gobject/gsignal.h' line='34' column='1' id='type-id-350'/>
    <typedef-decl name='GSource' type-id='type-id-330' size-in-bits='768' filepath='../glib/gmain.h' line='86' column='1' id='type-id-351'/>
    <typedef-decl name='GSourceCallbackFuncs' type-id='type-id-334' size-in-bits='192' filepath='../glib/gmain.h' line='99' column='1' id='type-id-352'/>
    <typedef-decl name='GSourceDummyMarshal' type-id='type-id-139' size-in-bits='64' filepath='../glib/gmain.h' line='308' column='1' hash='fd7a63c0c6c822c4' id='type-id-343'/>
    <typedef-decl name='GSourceFunc' type-id='type-id-353' size-in-bits='64' filepath='../glib/gmain.h' line='200' column='1' hash='fd7a63c0c6c822c4' id='type-id-342'/>
    <typedef-decl name='GSourceFuncs' type-id='type-id-337' size-in-bits='384' filepath='../glib/gmain.h' line='158' column='1' id='type-id-213'/>
    <typedef-decl name='GSourceFuncsCheckFunc' type-id='type-id-354' size-in-bits='64' filepath='../glib/gmain.h' line='355' column='1' hash='fd7a63c0c6c822c4' id='type-id-339'/>
    <typedef-decl name='GSourceFuncsDispatchFunc' type-id='type-id-355' size-in-bits='64' filepath='../glib/gmain.h' line='380' column='1' hash='fd7a63c0c6c822c4' id='type-id-340'/>
    <typedef-decl name='GSourceFuncsFinalizeFunc' type-id='type-id-356' size-in-bits='64' filepath='../glib/gmain.h' line='397' column='1' hash='fd7a63c0c6c822c4' id='type-id-341'/>
    <typedef-decl name='GSourceFuncsPrepareFunc' type-id='type-id-357' size-in-bits='64' filepath='../glib/gmain.h' line='334' column='1' hash='fd7a63c0c6c822c4' id='type-id-338'/>
    <typedef-decl name='gssize' type-id='type-id-358' size-in-bits='64' filepath='glib/glibconfig.h' line='82' column='1' hash='b119fe0931d2ee10' id='type-id-143'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' hash='585740f8f9673f95' id='type-id-131'/>
    <pointer-type-def type-id='type-id-326' size-in-bits='64' hash='7d47530124c0ab48' id='type-id-175'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' hash='3558f57bb77efe9a' id='type-id-359'/>
    <pointer-type-def type-id='type-id-350' size-in-bits='64' hash='59141ddda10ff64a' id='type-id-360'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' hash='f75bf6b644ee8e9d' id='type-id-135'/>
    <pointer-type-def type-id='type-id-352' size-in-bits='64' hash='79f28c62b736dcd7' id='type-id-214'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' hash='d22e865d7fe0fe58' id='type-id-361'/>
    <qualified-type-def type-id='type-id-213' const='yes' hash='df2ed216739452ea' id='type-id-362'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' hash='9c0ddb92a32407b0' id='type-id-331'/>
    <qualified-type-def type-id='type-id-263' const='yes' hash='69eacc6a6bca2249' id='type-id-363'/>
    <pointer-type-def type-id='type-id-363' size-in-bits='64' hash='6a09e037e277a8a0' id='type-id-329'/>
    <pointer-type-def type-id='type-id-364' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-347'/>
    <pointer-type-def type-id='type-id-365' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-354'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-355'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-357'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-353'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' hash='7c3bfb2f442d97d9' id='type-id-368'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' hash='d03c3777c89f7c1a' id='type-id-369'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-356'/>
    <pointer-type-def type-id='type-id-370' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-336'/>
    <pointer-type-def type-id='type-id-371' size-in-bits='64' id='type-id-333'/>
    <class-decl name='_GSourcePrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-372'/>
    <typedef-decl name='GSourcePrivate' type-id='type-id-372' filepath='../glib/gmain.h' line='87' column='1' id='type-id-371'/>
    <function-decl name='g_param_spec_variant' mangled-name='g_param_spec_variant' filepath='../gobject/gparamspecs.c' line='2734' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_variant' hash='eedb41fd68fc4746'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gparamspecs.c' line='2734' column='1'/>
      <parameter type-id='type-id-8' name='nick' filepath='../gobject/gparamspecs.c' line='2735' column='1'/>
      <parameter type-id='type-id-8' name='blurb' filepath='../gobject/gparamspecs.c' line='2736' column='1'/>
      <parameter type-id='type-id-53' name='type' filepath='../gobject/gparamspecs.c' line='2737' column='1'/>
      <parameter type-id='type-id-51' name='default_value' filepath='../gobject/gparamspecs.c' line='2738' column='1'/>
      <parameter type-id='type-id-310' name='flags' filepath='../gobject/gparamspecs.c' line='2739' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_signal_is_valid_name' mangled-name='g_signal_is_valid_name' filepath='../gobject/gsignal.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_is_valid_name' hash='d731989df7e70156'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_signal_stop_emission' mangled-name='g_signal_stop_emission' filepath='../gobject/gsignal.c' line='882' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_stop_emission' hash='0389e499374a3f97'>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gsignal.c' line='882' column='1'/>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='883' column='1'/>
      <parameter type-id='type-id-40' name='detail' filepath='../gobject/gsignal.c' line='884' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_add_emission_hook' mangled-name='g_signal_add_emission_hook' filepath='../gobject/gsignal.c' line='950' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_add_emission_hook' hash='e39050cbe836c8a4'>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='950' column='1'/>
      <parameter type-id='type-id-40' name='detail' filepath='../gobject/gsignal.c' line='951' column='1'/>
      <parameter type-id='type-id-348' name='hook_func' filepath='../gobject/gsignal.c' line='952' column='1'/>
      <parameter type-id='type-id-2' name='hook_data' filepath='../gobject/gsignal.c' line='953' column='1'/>
      <parameter type-id='type-id-3' name='data_destroy' filepath='../gobject/gsignal.c' line='954' column='1'/>
      <return type-id='type-id-169'/>
    </function-decl>
    <function-decl name='g_signal_remove_emission_hook' mangled-name='g_signal_remove_emission_hook' filepath='../gobject/gsignal.c' line='1018' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_remove_emission_hook' hash='3f7b79ee24d3110f'>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='1018' column='1'/>
      <parameter type-id='type-id-169' name='hook_id' filepath='../gobject/gsignal.c' line='1019' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_parse_name' mangled-name='g_signal_parse_name' filepath='../gobject/gsignal.c' line='1103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_parse_name' hash='4ac02c0c8c80181b'>
      <parameter type-id='type-id-8' name='detailed_signal' filepath='../gobject/gsignal.c' line='1103' column='1'/>
      <parameter type-id='type-id-263' name='itype' filepath='../gobject/gsignal.c' line='1104' column='1'/>
      <parameter type-id='type-id-295' name='signal_id_p' filepath='../gobject/gsignal.c' line='1105' column='1'/>
      <parameter type-id='type-id-287' name='detail_p' filepath='../gobject/gsignal.c' line='1106' column='1'/>
      <parameter type-id='type-id-9' name='force_detail_quark' filepath='../gobject/gsignal.c' line='1107' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_signal_stop_emission_by_name' mangled-name='g_signal_stop_emission_by_name' filepath='../gobject/gsignal.c' line='1149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_stop_emission_by_name' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gsignal.c' line='1149' column='1'/>
      <parameter type-id='type-id-8' name='detailed_signal' filepath='../gobject/gsignal.c' line='1150' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_lookup' mangled-name='g_signal_lookup' filepath='../gobject/gsignal.c' line='1214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_lookup' hash='73a5d06abe78b71e'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_signal_list_ids' mangled-name='g_signal_list_ids' filepath='../gobject/gsignal.c' line='1250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_list_ids' hash='5f73c9e2946fb202'>
      <parameter type-id='type-id-263' name='itype' filepath='../gobject/gsignal.c' line='1250' column='1'/>
      <parameter type-id='type-id-295' name='n_ids' filepath='../gobject/gsignal.c' line='1251' column='1'/>
      <return type-id='type-id-295'/>
    </function-decl>
    <function-decl name='g_signal_name' mangled-name='g_signal_name' filepath='../gobject/gsignal.c' line='1301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_name' hash='ca1560ab280d758e'>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='1301' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='g_signal_query' mangled-name='g_signal_query' filepath='../gobject/gsignal.c' line='1328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_query' hash='47c8aef2cd2064ce'>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='1328' column='1'/>
      <parameter type-id='type-id-360' name='query' filepath='../gobject/gsignal.c' line='1329' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_new' mangled-name='g_signal_new' filepath='../gobject/gsignal.c' line='1400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_new' hash='b3ff5559dba7a929'>
      <parameter type-id='type-id-8' name='signal_name' filepath='../gobject/gsignal.c' line='1400' column='1'/>
      <parameter type-id='type-id-263' name='itype' filepath='../gobject/gsignal.c' line='1401' column='1'/>
      <parameter type-id='type-id-328' name='signal_flags' filepath='../gobject/gsignal.c' line='1402' column='1'/>
      <parameter type-id='type-id-16' name='class_offset' filepath='../gobject/gsignal.c' line='1403' column='1'/>
      <parameter type-id='type-id-373' name='accumulator' filepath='../gobject/gsignal.c' line='1404' column='1'/>
      <parameter type-id='type-id-2' name='accu_data' filepath='../gobject/gsignal.c' line='1405' column='1'/>
      <parameter type-id='type-id-374' name='c_marshaller' filepath='../gobject/gsignal.c' line='1406' column='1'/>
      <parameter type-id='type-id-263' name='return_type' filepath='../gobject/gsignal.c' line='1407' column='1'/>
      <parameter type-id='type-id-16' name='n_params' filepath='../gobject/gsignal.c' line='1408' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_signal_new_class_handler' mangled-name='g_signal_new_class_handler' filepath='../gobject/gsignal.c' line='1470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_new_class_handler' hash='eff5bea7826eb92b'>
      <parameter type-id='type-id-8' name='signal_name' filepath='../gobject/gsignal.c' line='1470' column='1'/>
      <parameter type-id='type-id-263' name='itype' filepath='../gobject/gsignal.c' line='1471' column='1'/>
      <parameter type-id='type-id-328' name='signal_flags' filepath='../gobject/gsignal.c' line='1472' column='1'/>
      <parameter type-id='type-id-308' name='class_handler' filepath='../gobject/gsignal.c' line='1473' column='1'/>
      <parameter type-id='type-id-373' name='accumulator' filepath='../gobject/gsignal.c' line='1474' column='1'/>
      <parameter type-id='type-id-2' name='accu_data' filepath='../gobject/gsignal.c' line='1475' column='1'/>
      <parameter type-id='type-id-374' name='c_marshaller' filepath='../gobject/gsignal.c' line='1476' column='1'/>
      <parameter type-id='type-id-263' name='return_type' filepath='../gobject/gsignal.c' line='1477' column='1'/>
      <parameter type-id='type-id-16' name='n_params' filepath='../gobject/gsignal.c' line='1478' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_signal_newv' mangled-name='g_signal_newv' filepath='../gobject/gsignal.c' line='1597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_newv' hash='ca4c1051ac33a898'>
      <parameter type-id='type-id-8' name='signal_name' filepath='../gobject/gsignal.c' line='1597' column='1'/>
      <parameter type-id='type-id-263' name='itype' filepath='../gobject/gsignal.c' line='1598' column='1'/>
      <parameter type-id='type-id-328' name='signal_flags' filepath='../gobject/gsignal.c' line='1599' column='1'/>
      <parameter type-id='type-id-14' name='class_closure' filepath='../gobject/gsignal.c' line='1600' column='1'/>
      <parameter type-id='type-id-373' name='accumulator' filepath='../gobject/gsignal.c' line='1601' column='1'/>
      <parameter type-id='type-id-2' name='accu_data' filepath='../gobject/gsignal.c' line='1602' column='1'/>
      <parameter type-id='type-id-374' name='c_marshaller' filepath='../gobject/gsignal.c' line='1603' column='1'/>
      <parameter type-id='type-id-263' name='return_type' filepath='../gobject/gsignal.c' line='1604' column='1'/>
      <parameter type-id='type-id-16' name='n_params' filepath='../gobject/gsignal.c' line='1605' column='1'/>
      <parameter type-id='type-id-173' name='param_types' filepath='../gobject/gsignal.c' line='1606' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_signal_set_va_marshaller' mangled-name='g_signal_set_va_marshaller' filepath='../gobject/gsignal.c' line='1800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_set_va_marshaller' hash='6edabf2e1315b49f'>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='1800' column='1'/>
      <parameter type-id='type-id-263' name='instance_type' filepath='../gobject/gsignal.c' line='1801' column='1'/>
      <parameter type-id='type-id-346' name='va_marshaller' filepath='../gobject/gsignal.c' line='1802' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_new_valist' mangled-name='g_signal_new_valist' filepath='../gobject/gsignal.c' line='1856' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_new_valist' hash='2e77e001d36fc0de'>
      <parameter type-id='type-id-8' name='signal_name' filepath='../gobject/gsignal.c' line='1856' column='1'/>
      <parameter type-id='type-id-263' name='itype' filepath='../gobject/gsignal.c' line='1857' column='1'/>
      <parameter type-id='type-id-328' name='signal_flags' filepath='../gobject/gsignal.c' line='1858' column='1'/>
      <parameter type-id='type-id-14' name='class_closure' filepath='../gobject/gsignal.c' line='1859' column='1'/>
      <parameter type-id='type-id-373' name='accumulator' filepath='../gobject/gsignal.c' line='1860' column='1'/>
      <parameter type-id='type-id-2' name='accu_data' filepath='../gobject/gsignal.c' line='1861' column='1'/>
      <parameter type-id='type-id-374' name='c_marshaller' filepath='../gobject/gsignal.c' line='1862' column='1'/>
      <parameter type-id='type-id-263' name='return_type' filepath='../gobject/gsignal.c' line='1863' column='1'/>
      <parameter type-id='type-id-16' name='n_params' filepath='../gobject/gsignal.c' line='1864' column='1'/>
      <parameter type-id='type-id-172' name='args' filepath='../gobject/gsignal.c' line='1865' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_signal_override_class_closure' mangled-name='g_signal_override_class_closure' filepath='../gobject/gsignal.c' line='1968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_override_class_closure' hash='3f0c8f81a9b0fd3e'>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='1968' column='1'/>
      <parameter type-id='type-id-263' name='instance_type' filepath='../gobject/gsignal.c' line='1969' column='1'/>
      <parameter type-id='type-id-14' name='class_closure' filepath='../gobject/gsignal.c' line='1970' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_override_class_handler' mangled-name='g_signal_override_class_handler' filepath='../gobject/gsignal.c' line='2013' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_override_class_handler' hash='ec411ae03519ca04'>
      <parameter type-id='type-id-8' name='signal_name' filepath='../gobject/gsignal.c' line='2013' column='1'/>
      <parameter type-id='type-id-263' name='instance_type' filepath='../gobject/gsignal.c' line='2014' column='1'/>
      <parameter type-id='type-id-308' name='class_handler' filepath='../gobject/gsignal.c' line='2015' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_chain_from_overridden' mangled-name='g_signal_chain_from_overridden' filepath='../gobject/gsignal.c' line='2047' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_chain_from_overridden' hash='1a25e8acfe50e042'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_chain_from_overridden_handler' mangled-name='g_signal_chain_from_overridden_handler' filepath='../gobject/gsignal.c' line='2122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_chain_from_overridden_handler' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gsignal.c' line='2122' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_get_invocation_hint' mangled-name='g_signal_get_invocation_hint' filepath='../gobject/gsignal.c' line='2277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_get_invocation_hint' hash='0f7f8aeb0017345a'>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gsignal.c' line='2277' column='1'/>
      <return type-id='type-id-375'/>
    </function-decl>
    <function-decl name='g_signal_connect_closure_by_id' mangled-name='g_signal_connect_closure_by_id' filepath='../gobject/gsignal.c' line='2315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_connect_closure_by_id' hash='d2f6ef253129cbe9'>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gsignal.c' line='2315' column='1'/>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='2316' column='1'/>
      <parameter type-id='type-id-40' name='detail' filepath='../gobject/gsignal.c' line='2317' column='1'/>
      <parameter type-id='type-id-14' name='closure' filepath='../gobject/gsignal.c' line='2318' column='1'/>
      <parameter type-id='type-id-9' name='after' filepath='../gobject/gsignal.c' line='2319' column='1'/>
      <return type-id='type-id-169'/>
    </function-decl>
    <function-decl name='g_signal_connect_closure' mangled-name='g_signal_connect_closure' filepath='../gobject/gsignal.c' line='2388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_connect_closure' hash='698fe4e46c757f96'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-169'/>
    </function-decl>
    <function-decl name='g_signal_connect_data' mangled-name='g_signal_connect_data' filepath='../gobject/gsignal.c' line='2492' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_connect_data' hash='b39f1645e57ded98'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-308'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-376'/>
      <parameter type-id='type-id-255'/>
      <return type-id='type-id-169'/>
    </function-decl>
    <function-decl name='g_signal_handler_block' mangled-name='g_signal_handler_block' filepath='../gobject/gsignal.c' line='2573' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_handler_block' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_handler_unblock' mangled-name='g_signal_handler_unblock' filepath='../gobject/gsignal.c' line='2627' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_handler_unblock' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_handler_disconnect' mangled-name='g_signal_handler_disconnect' filepath='../gobject/gsignal.c' line='2673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_handler_disconnect' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_handler_is_connected' mangled-name='g_signal_handler_is_connected' filepath='../gobject/gsignal.c' line='2713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_handler_is_connected' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gsignal.c' line='2713' column='1'/>
      <parameter type-id='type-id-169' name='handler_id' filepath='../gobject/gsignal.c' line='2714' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_signal_handlers_destroy' mangled-name='g_signal_handlers_destroy' filepath='../gobject/gsignal.c' line='2738' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_handlers_destroy' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_handler_find' mangled-name='g_signal_handler_find' filepath='../gobject/gsignal.c' line='2801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_handler_find' hash='62b7f7d4595d3f6a'>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gsignal.c' line='2801' column='1'/>
      <parameter type-id='type-id-257' name='mask' filepath='../gobject/gsignal.c' line='2802' column='1'/>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='2803' column='1'/>
      <parameter type-id='type-id-40' name='detail' filepath='../gobject/gsignal.c' line='2804' column='1'/>
      <parameter type-id='type-id-14' name='closure' filepath='../gobject/gsignal.c' line='2805' column='1'/>
      <parameter type-id='type-id-2' name='func' filepath='../gobject/gsignal.c' line='2806' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gsignal.c' line='2807' column='1'/>
      <return type-id='type-id-169'/>
    </function-decl>
    <function-decl name='g_signal_handlers_block_matched' mangled-name='g_signal_handlers_block_matched' filepath='../gobject/gsignal.c' line='2887' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_handlers_block_matched' hash='1229ce4f6bd08b15'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_signal_handlers_unblock_matched' mangled-name='g_signal_handlers_unblock_matched' filepath='../gobject/gsignal.c' line='2943' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_handlers_unblock_matched' hash='1229ce4f6bd08b15'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_signal_handlers_disconnect_matched' mangled-name='g_signal_handlers_disconnect_matched' filepath='../gobject/gsignal.c' line='2998' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_handlers_disconnect_matched' hash='1229ce4f6bd08b15'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-257'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_signal_has_handler_pending' mangled-name='g_signal_has_handler_pending' filepath='../gobject/gsignal.c' line='3052' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_has_handler_pending' hash='546871c8a73c53ea'>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gsignal.c' line='3052' column='1'/>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='3053' column='1'/>
      <parameter type-id='type-id-40' name='detail' filepath='../gobject/gsignal.c' line='3054' column='1'/>
      <parameter type-id='type-id-9' name='may_be_blocked' filepath='../gobject/gsignal.c' line='3055' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_signal_emitv' mangled-name='g_signal_emitv' filepath='../gobject/gsignal.c' line='3121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_emitv' hash='d9fe081d6d6caa1d'>
      <parameter type-id='type-id-11' name='instance_and_params' filepath='../gobject/gsignal.c' line='3121' column='1'/>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='3122' column='1'/>
      <parameter type-id='type-id-40' name='detail' filepath='../gobject/gsignal.c' line='3123' column='1'/>
      <parameter type-id='type-id-15' name='return_value' filepath='../gobject/gsignal.c' line='3124' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_emit_valist' mangled-name='g_signal_emit_valist' filepath='../gobject/gsignal.c' line='3272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_emit_valist' hash='7eb678f38e16870d'>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gsignal.c' line='3272' column='1'/>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='3273' column='1'/>
      <parameter type-id='type-id-40' name='detail' filepath='../gobject/gsignal.c' line='3274' column='1'/>
      <parameter type-id='type-id-172' name='var_args' filepath='../gobject/gsignal.c' line='3275' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_emit' mangled-name='g_signal_emit' filepath='../gobject/gsignal.c' line='3590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_emit' hash='0389e499374a3f97'>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gsignal.c' line='3590' column='1'/>
      <parameter type-id='type-id-16' name='signal_id' filepath='../gobject/gsignal.c' line='3591' column='1'/>
      <parameter type-id='type-id-40' name='detail' filepath='../gobject/gsignal.c' line='3592' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_emit_by_name' mangled-name='g_signal_emit_by_name' filepath='../gobject/gsignal.c' line='3618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_emit_by_name' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-2' name='_object' filepath='../gobject/gobject.c' line='3650' column='1'/>
      <parameter type-id='type-id-8' name='signal_spec' filepath='../gobject/gobject.c' line='3651' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_accumulator_true_handled' mangled-name='g_signal_accumulator_true_handled' filepath='../gobject/gsignal.c' line='4127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_accumulator_true_handled' hash='ba26ecee52f28ef6'>
      <parameter type-id='type-id-375' name='ihint' filepath='../gobject/gsignal.c' line='4127' column='1'/>
      <parameter type-id='type-id-15' name='return_accu' filepath='../gobject/gsignal.c' line='4128' column='1'/>
      <parameter type-id='type-id-11' name='handler_return' filepath='../gobject/gsignal.c' line='4129' column='1'/>
      <parameter type-id='type-id-2' name='dummy' filepath='../gobject/gsignal.c' line='4130' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_signal_accumulator_first_wins' mangled-name='g_signal_accumulator_first_wins' filepath='../gobject/gsignal.c' line='4165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_accumulator_first_wins' hash='ba26ecee52f28ef6'>
      <parameter type-id='type-id-375' name='ihint' filepath='../gobject/gsignal.c' line='4127' column='1'/>
      <parameter type-id='type-id-15' name='return_accu' filepath='../gobject/gsignal.c' line='4128' column='1'/>
      <parameter type-id='type-id-11' name='handler_return' filepath='../gobject/gsignal.c' line='4129' column='1'/>
      <parameter type-id='type-id-2' name='dummy' filepath='../gobject/gsignal.c' line='4130' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_clear_signal_handler' mangled-name='g_clear_signal_handler' filepath='../gobject/gsignal.c' line='4192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_clear_signal_handler' hash='bc9de03ffff1b3f5'>
      <parameter type-id='type-id-369' name='handler_id_ptr' filepath='../gobject/gsignal.c' line='4192' column='1'/>
      <parameter type-id='type-id-2' name='instance' filepath='../gobject/gsignal.c' line='4193' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_group_get_type' mangled-name='g_signal_group_get_type' filepath='../gobject/gsignalgroup.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_signal_group_block' mangled-name='g_signal_group_block' filepath='../gobject/gsignalgroup.c' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_block' hash='c424712fcb3c8218'>
      <parameter type-id='type-id-359' name='self' filepath='../gobject/gsignalgroup.c' line='333' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_group_unblock' mangled-name='g_signal_group_unblock' filepath='../gobject/gsignalgroup.c' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_unblock' hash='c424712fcb3c8218'>
      <parameter type-id='type-id-359' name='self' filepath='../gobject/gsignalgroup.c' line='333' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_group_dup_target' mangled-name='g_signal_group_dup_target' filepath='../gobject/gsignalgroup.c' line='425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_dup_target' hash='c424712fcb3c8218'>
      <parameter type-id='type-id-359' name='self' filepath='../gobject/gsignalgroup.c' line='425' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_signal_group_set_target' mangled-name='g_signal_group_set_target' filepath='../gobject/gsignalgroup.c' line='454' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_set_target' hash='c424712fcb3c8218'>
      <parameter type-id='type-id-359' name='self' filepath='../gobject/gsignalgroup.c' line='454' column='1'/>
      <parameter type-id='type-id-2' name='target' filepath='../gobject/gsignalgroup.c' line='455' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_group_new' mangled-name='g_signal_group_new' filepath='../gobject/gsignalgroup.c' line='695' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_new' hash='ff4fe4cbbbf91886'>
      <parameter type-id='type-id-263' name='target_type' filepath='../gobject/gsignalgroup.c' line='695' column='1'/>
      <return type-id='type-id-359'/>
    </function-decl>
    <function-decl name='g_signal_group_connect_closure' mangled-name='g_signal_group_connect_closure' filepath='../gobject/gsignalgroup.c' line='776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_connect_closure' hash='0bb629d74aa2d0f8'>
      <parameter type-id='type-id-359' name='self' filepath='../gobject/gsignalgroup.c' line='776' column='1'/>
      <parameter type-id='type-id-8' name='detailed_signal' filepath='../gobject/gsignalgroup.c' line='777' column='1'/>
      <parameter type-id='type-id-14' name='closure' filepath='../gobject/gsignalgroup.c' line='778' column='1'/>
      <parameter type-id='type-id-9' name='after' filepath='../gobject/gsignalgroup.c' line='779' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_group_connect_object' mangled-name='g_signal_group_connect_object' filepath='../gobject/gsignalgroup.c' line='838' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_connect_object' hash='9d80acf73b47f577'>
      <parameter type-id='type-id-359' name='self' filepath='../gobject/gsignalgroup.c' line='838' column='1'/>
      <parameter type-id='type-id-8' name='detailed_signal' filepath='../gobject/gsignalgroup.c' line='839' column='1'/>
      <parameter type-id='type-id-308' name='c_handler' filepath='../gobject/gsignalgroup.c' line='840' column='1'/>
      <parameter type-id='type-id-2' name='object' filepath='../gobject/gsignalgroup.c' line='841' column='1'/>
      <parameter type-id='type-id-255' name='flags' filepath='../gobject/gsignalgroup.c' line='842' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_group_connect_data' mangled-name='g_signal_group_connect_data' filepath='../gobject/gsignalgroup.c' line='867' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_connect_data' hash='3ea9ff82b2decf95'>
      <parameter type-id='type-id-359' name='self' filepath='../gobject/gsignalgroup.c' line='867' column='1'/>
      <parameter type-id='type-id-8' name='detailed_signal' filepath='../gobject/gsignalgroup.c' line='868' column='1'/>
      <parameter type-id='type-id-308' name='c_handler' filepath='../gobject/gsignalgroup.c' line='869' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gsignalgroup.c' line='870' column='1'/>
      <parameter type-id='type-id-376' name='notify' filepath='../gobject/gsignalgroup.c' line='871' column='1'/>
      <parameter type-id='type-id-255' name='flags' filepath='../gobject/gsignalgroup.c' line='872' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_group_connect' mangled-name='g_signal_group_connect' filepath='../gobject/gsignalgroup.c' line='893' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_connect' hash='fc868dc3429aa2ab'>
      <parameter type-id='type-id-359' name='self' filepath='../gobject/gsignalgroup.c' line='893' column='1'/>
      <parameter type-id='type-id-8' name='detailed_signal' filepath='../gobject/gsignalgroup.c' line='894' column='1'/>
      <parameter type-id='type-id-308' name='c_handler' filepath='../gobject/gsignalgroup.c' line='895' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gsignalgroup.c' line='896' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_group_connect_after' mangled-name='g_signal_group_connect_after' filepath='../gobject/gsignalgroup.c' line='919' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_connect_after' hash='fc868dc3429aa2ab'>
      <parameter type-id='type-id-359' name='self' filepath='../gobject/gsignalgroup.c' line='893' column='1'/>
      <parameter type-id='type-id-8' name='detailed_signal' filepath='../gobject/gsignalgroup.c' line='894' column='1'/>
      <parameter type-id='type-id-308' name='c_handler' filepath='../gobject/gsignalgroup.c' line='895' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gsignalgroup.c' line='896' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_signal_group_connect_swapped' mangled-name='g_signal_group_connect_swapped' filepath='../gobject/gsignalgroup.c' line='946' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_group_connect_swapped' hash='fc868dc3429aa2ab'>
      <parameter type-id='type-id-359' name='self' filepath='../gobject/gsignalgroup.c' line='893' column='1'/>
      <parameter type-id='type-id-8' name='detailed_signal' filepath='../gobject/gsignalgroup.c' line='894' column='1'/>
      <parameter type-id='type-id-308' name='c_handler' filepath='../gobject/gsignalgroup.c' line='895' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gsignalgroup.c' line='896' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_io_channel_get_type' mangled-name='g_io_channel_get_type' filepath='../gobject/gsourceclosure.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_channel_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_io_condition_get_type' mangled-name='g_io_condition_get_type' filepath='../gobject/gsourceclosure.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_condition_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_source_set_closure' mangled-name='g_source_set_closure' filepath='../gobject/gsourceclosure.c' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_set_closure' hash='63ddba8df32616cb'>
      <parameter type-id='type-id-135' name='source' filepath='../gobject/gsourceclosure.c' line='248' column='1'/>
      <parameter type-id='type-id-14' name='closure' filepath='../gobject/gsourceclosure.c' line='249' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_source_set_dummy_callback' mangled-name='g_source_set_dummy_callback' filepath='../gobject/gsourceclosure.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_source_set_dummy_callback' hash='09b40bdb5c9eca2e'>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_get_type_registration_serial' mangled-name='g_type_get_type_registration_serial' filepath='../gobject/gtype.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_get_type_registration_serial' hash='2bb88322482ae81c'>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-type size-in-bits='64' hash='4d89f7935355100c' id='type-id-364'>
      <parameter type-id='type-id-375'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='9bf85a3103476e3b' id='type-id-365'>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='b86a3fbf0c1c4489' id='type-id-366'>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-342'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='f75be2b044a05568' id='type-id-367'>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-368'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='1aabc1389fe8af95' id='type-id-370'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-361'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='ba26ecee52f28ef6' id='type-id-377'>
      <parameter type-id='type-id-375' name='ihint' filepath='../gobject/gsignal.c' line='4127' column='1'/>
      <parameter type-id='type-id-15' name='return_accu' filepath='../gobject/gsignal.c' line='4128' column='1'/>
      <parameter type-id='type-id-11' name='handler_return' filepath='../gobject/gsignal.c' line='4129' column='1'/>
      <parameter type-id='type-id-2' name='dummy' filepath='../gobject/gsignal.c' line='4130' column='1'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-3fc78' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <enum-decl name='GTypeDebugFlags' naming-typedef-id='type-id-378' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gtype.h' line='725' column='1' hash='054a2234a00b121e' id='type-id-379'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_TYPE_DEBUG_NONE' value='0'/>
      <enumerator name='G_TYPE_DEBUG_OBJECTS' value='1'/>
      <enumerator name='G_TYPE_DEBUG_SIGNALS' value='2'/>
      <enumerator name='G_TYPE_DEBUG_INSTANCE_COUNT' value='4'/>
      <enumerator name='G_TYPE_DEBUG_MASK' value='7'/>
    </enum-decl>
    <enum-decl name='GTypeFlags' naming-typedef-id='type-id-380' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gtype.h' line='1088' column='1' hash='083256a7c37501b7' id='type-id-381'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_TYPE_FLAG_NONE' value='0'/>
      <enumerator name='G_TYPE_FLAG_ABSTRACT' value='16'/>
      <enumerator name='G_TYPE_FLAG_VALUE_ABSTRACT' value='32'/>
      <enumerator name='G_TYPE_FLAG_FINAL' value='64'/>
      <enumerator name='G_TYPE_FLAG_DEPRECATED' value='128'/>
    </enum-decl>
    <enum-decl name='GTypeFundamentalFlags' naming-typedef-id='type-id-382' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gtype.h' line='1063' column='1' hash='0159675e42a0ff60' id='type-id-383'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_TYPE_FLAG_CLASSED' value='1'/>
      <enumerator name='G_TYPE_FLAG_INSTANTIATABLE' value='2'/>
      <enumerator name='G_TYPE_FLAG_DERIVABLE' value='4'/>
      <enumerator name='G_TYPE_FLAG_DEEP_DERIVABLE' value='8'/>
    </enum-decl>
    <class-decl name='_GDebugKey' is-struct='yes' visibility='default' size-in-bits='128' filepath='../glib/gutils.h' line='266' column='1' hash='9595ca71b225b12e' id='type-id-384'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-8' visibility='default' filepath='../glib/gutils.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-16' visibility='default' filepath='../glib/gutils.h' line='269' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GInterfaceInfo' is-struct='yes' visibility='default' size-in-bits='192' filepath='../gobject/gtype.h' line='1167' column='1' hash='d5441722a8a88030' id='type-id-385'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='interface_init' type-id='type-id-386' visibility='default' filepath='../gobject/gtype.h' line='1169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='interface_finalize' type-id='type-id-387' visibility='default' filepath='../gobject/gtype.h' line='1170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interface_data' type-id='type-id-2' visibility='default' filepath='../gobject/gtype.h' line='1171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GRWLock' is-struct='yes' visibility='default' size-in-bits='128' filepath='../glib/gthread.h' line='67' column='1' hash='279ec19bdae0c34b' id='type-id-388'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='type-id-2' visibility='default' filepath='../glib/gthread.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='i' type-id='type-id-323' visibility='default' filepath='../glib/gthread.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeFundamentalInfo' is-struct='yes' visibility='default' size-in-bits='32' filepath='../gobject/gtype.h' line='1154' column='1' hash='6eb447d07b1c58bd' id='type-id-389'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type_flags' type-id='type-id-382' visibility='default' filepath='../gobject/gtype.h' line='1156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeModule' is-struct='yes' visibility='default' size-in-bits='448' filepath='../gobject/gtypemodule.h' line='43' column='1' hash='70f007a39b150db2' id='type-id-390'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-18' visibility='default' filepath='../gobject/gtypemodule.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='use_count' type-id='type-id-16' visibility='default' filepath='../gobject/gtypemodule.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='type_infos' type-id='type-id-153' visibility='default' filepath='../gobject/gtypemodule.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='interface_infos' type-id='type-id-153' visibility='default' filepath='../gobject/gtypemodule.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='name' type-id='type-id-42' visibility='default' filepath='../gobject/gtypemodule.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeQuery' is-struct='yes' visibility='default' size-in-bits='192' filepath='../gobject/gtype.h' line='488' column='1' hash='b56c6b80d28b2175' id='type-id-391'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-263' visibility='default' filepath='../gobject/gtype.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type_name' type-id='type-id-8' visibility='default' filepath='../gobject/gtype.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='class_size' type-id='type-id-16' visibility='default' filepath='../gobject/gtype.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='instance_size' type-id='type-id-16' visibility='default' filepath='../gobject/gtype.h' line='493' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GDebugKey' type-id='type-id-384' size-in-bits='128' filepath='../glib/gutils.h' line='265' column='1' id='type-id-392'/>
    <typedef-decl name='GInterfaceFinalizeFunc' type-id='type-id-393' size-in-bits='64' filepath='../gobject/gtype.h' line='1014' column='1' hash='fd7a63c0c6c822c4' id='type-id-387'/>
    <typedef-decl name='GInterfaceInfo' type-id='type-id-385' size-in-bits='192' filepath='../gobject/gtype.h' line='439' column='1' id='type-id-394'/>
    <typedef-decl name='GInterfaceInitFunc' type-id='type-id-393' size-in-bits='64' filepath='../gobject/gtype.h' line='1002' column='1' hash='fd7a63c0c6c822c4' id='type-id-386'/>
    <typedef-decl name='GRWLock' type-id='type-id-388' size-in-bits='128' filepath='../glib/gthread.h' line='55' column='1' id='type-id-395'/>
    <typedef-decl name='GTypeClassCacheFunc' type-id='type-id-396' size-in-bits='64' filepath='../gobject/gtype.h' line='1036' column='1' hash='fd7a63c0c6c822c4' id='type-id-397'/>
    <typedef-decl name='GTypeDebugFlags' type-id='type-id-379' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gtype.h' line='731' column='1' hash='054a2234a00b121e' id='type-id-378'/>
    <typedef-decl name='GTypeFlags' type-id='type-id-381' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gtype.h' line='1094' column='1' hash='083256a7c37501b7' id='type-id-380'/>
    <typedef-decl name='GTypeFundamentalFlags' type-id='type-id-383' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gtype.h' line='1070' column='1' hash='0159675e42a0ff60' id='type-id-382'/>
    <typedef-decl name='GTypeFundamentalInfo' type-id='type-id-389' size-in-bits='32' filepath='../gobject/gtype.h' line='438' column='1' id='type-id-398'/>
    <typedef-decl name='GTypeModule' type-id='type-id-390' size-in-bits='448' filepath='../gobject/gtypemodule.h' line='31' column='1' id='type-id-399'/>
    <typedef-decl name='GTypeQuery' type-id='type-id-391' size-in-bits='192' filepath='../gobject/gtype.h' line='441' column='1' id='type-id-400'/>
    <typedef-decl name='GValueTransform' type-id='type-id-401' size-in-bits='64' filepath='../gobject/gvalue.h' line='105' column='1' hash='fd7a63c0c6c822c4' id='type-id-402'/>
    <pointer-type-def type-id='type-id-394' size-in-bits='64' hash='cf72746eb9ea2888' id='type-id-403'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' hash='b17a04b2d3e3e56b' id='type-id-241'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' hash='49850acb9c05d5c6' id='type-id-404'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' hash='8c3d783ad9aaab80' id='type-id-405'/>
    <pointer-type-def type-id='type-id-406' size-in-bits='64' hash='b02bab5040801f33' id='type-id-407'/>
    <qualified-type-def type-id='type-id-392' const='yes' hash='6945fc8fc9bfd985' id='type-id-408'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' hash='2f08ce4fda8b7ebb' id='type-id-242'/>
    <qualified-type-def type-id='type-id-394' const='yes' hash='8e6c9cef00505fe4' id='type-id-409'/>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' hash='0d3ff5dc39d1a94d' id='type-id-410'/>
    <qualified-type-def type-id='type-id-398' const='yes' hash='54527153392add81' id='type-id-411'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' hash='28a40e73aff8f5ea' id='type-id-412'/>
    <qualified-type-def type-id='type-id-413' const='yes' hash='6329185c1bf5479b' id='type-id-414'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' hash='8ff10a39020ad6df' id='type-id-415'/>
    <qualified-type-def type-id='type-id-279' const='yes' hash='6662ecbb00ed7b1c' id='type-id-416'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' hash='c0ee7b0abe6ce609' id='type-id-417'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-396'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' id='type-id-420'/>
    <function-decl name='__builtin_strcat' mangled-name='strcat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-4'/>
    </function-decl>
    <class-decl name='_GTypePlugin' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-421'/>
    <function-decl name='g_type_interface_add_prerequisite' mangled-name='g_type_interface_add_prerequisite' filepath='../gobject/gtype.c' line='1520' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_interface_add_prerequisite' hash='91495cdf6321a116'>
      <parameter type-id='type-id-263' name='interface_type' filepath='../gobject/gtype.c' line='1520' column='1'/>
      <parameter type-id='type-id-263' name='prerequisite_type' filepath='../gobject/gtype.c' line='1521' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_interface_prerequisites' mangled-name='g_type_interface_prerequisites' filepath='../gobject/gtype.c' line='1609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_interface_prerequisites' hash='8b0c65002997e720'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='3395' column='1'/>
      <parameter type-id='type-id-295' name='n_children' filepath='../gobject/gtype.c' line='3396' column='1'/>
      <return type-id='type-id-173'/>
    </function-decl>
    <function-decl name='g_type_interface_instantiatable_prerequisite' mangled-name='g_type_interface_instantiatable_prerequisite' filepath='../gobject/gtype.c' line='1671' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_interface_instantiatable_prerequisite' hash='91495cdf6321a116'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_create_instance' mangled-name='g_type_create_instance' filepath='../gobject/gtype.c' line='1817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_create_instance' hash='0b6944c9432c2256'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='1817' column='1'/>
      <return type-id='type-id-422'/>
    </function-decl>
    <function-decl name='g_type_free_instance' mangled-name='g_type_free_instance' filepath='../gobject/gtype.c' line='1925' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_free_instance' hash='2911603b4030dcc0'>
      <parameter type-id='type-id-422' name='instance' filepath='../gobject/gtype.c' line='1925' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_add_class_cache_func' mangled-name='g_type_add_class_cache_func' filepath='../gobject/gtype.c' line='2283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_add_class_cache_func' hash='5695f5ce05a4c55f'>
      <parameter type-id='type-id-2' name='cache_data' filepath='../gobject/gtype.c' line='2283' column='1'/>
      <parameter type-id='type-id-397' name='cache_func' filepath='../gobject/gtype.c' line='2284' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_remove_class_cache_func' mangled-name='g_type_remove_class_cache_func' filepath='../gobject/gtype.c' line='2308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_remove_class_cache_func' hash='5695f5ce05a4c55f'>
      <parameter type-id='type-id-2' name='cache_data' filepath='../gobject/gtype.c' line='2283' column='1'/>
      <parameter type-id='type-id-397' name='cache_func' filepath='../gobject/gtype.c' line='2284' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_add_interface_check' mangled-name='g_type_add_interface_check' filepath='../gobject/gtype.c' line='2356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_add_interface_check' hash='5695f5ce05a4c55f'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-423'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_remove_interface_check' mangled-name='g_type_remove_interface_check' filepath='../gobject/gtype.c' line='2382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_remove_interface_check' hash='5695f5ce05a4c55f'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-423'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_register_fundamental' mangled-name='g_type_register_fundamental' filepath='../gobject/gtype.c' line='2430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_register_fundamental' hash='05bd4f6cee0e2f78'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-415'/>
      <parameter type-id='type-id-412'/>
      <parameter type-id='type-id-380'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_register_static_simple' mangled-name='g_type_register_static_simple' filepath='../gobject/gtype.c' line='2501' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_register_static_simple' hash='b0b99f3726d526d3'>
      <parameter type-id='type-id-263' name='parent_type' filepath='../gobject/gtype.c' line='2501' column='1'/>
      <parameter type-id='type-id-8' name='type_name' filepath='../gobject/gtype.c' line='2502' column='1'/>
      <parameter type-id='type-id-16' name='class_size' filepath='../gobject/gtype.c' line='2503' column='1'/>
      <parameter type-id='type-id-424' name='class_init' filepath='../gobject/gtype.c' line='2504' column='1'/>
      <parameter type-id='type-id-16' name='instance_size' filepath='../gobject/gtype.c' line='2505' column='1'/>
      <parameter type-id='type-id-425' name='instance_init' filepath='../gobject/gtype.c' line='2506' column='1'/>
      <parameter type-id='type-id-380' name='flags' filepath='../gobject/gtype.c' line='2507' column='1'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_register_static' mangled-name='g_type_register_static' filepath='../gobject/gtype.c' line='2547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_register_static' hash='ae8e43686b1c43a0'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-415'/>
      <parameter type-id='type-id-380'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_register_dynamic' mangled-name='g_type_register_dynamic' filepath='../gobject/gtype.c' line='2602' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_register_dynamic' hash='6d0fee80994fdbc9'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-420'/>
      <parameter type-id='type-id-380'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_add_interface_static' mangled-name='g_type_add_interface_static' filepath='../gobject/gtype.c' line='2642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_add_interface_static' hash='9e097a50aab4a591'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-410'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_add_interface_dynamic' mangled-name='g_type_add_interface_dynamic' filepath='../gobject/gtype.c' line='2678' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_add_interface_dynamic' hash='91495cdf6321a116'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-420'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_class_get' mangled-name='g_type_class_get' filepath='../gobject/gtype.c' line='2723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_get' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_class_ref' mangled-name='g_type_class_ref' filepath='../gobject/gtype.c' line='2784' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_ref' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_class_unref' mangled-name='g_type_class_unref' filepath='../gobject/gtype.c' line='2803' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_class_unref_uncached' mangled-name='g_type_class_unref_uncached' filepath='../gobject/gtype.c' line='2822' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_unref_uncached' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_class_peek' mangled-name='g_type_class_peek' filepath='../gobject/gtype.c' line='2844' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_peek' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_class_peek_static' mangled-name='g_type_class_peek_static' filepath='../gobject/gtype.c' line='2875' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_peek_static' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_class_peek_parent' mangled-name='g_type_class_peek_parent' filepath='../gobject/gtype.c' line='2916' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_peek_parent' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_interface_peek' mangled-name='g_type_interface_peek' filepath='../gobject/gtype.c' line='2955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_interface_peek' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_interface_peek_parent' mangled-name='g_type_interface_peek_parent' filepath='../gobject/gtype.c' line='2991' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_interface_peek_parent' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_default_interface_ref' mangled-name='g_type_default_interface_ref' filepath='../gobject/gtype.c' line='3036' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_default_interface_ref' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_default_interface_get' mangled-name='g_type_default_interface_get' filepath='../gobject/gtype.c' line='3065' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_default_interface_get' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_default_interface_peek' mangled-name='g_type_default_interface_peek' filepath='../gobject/gtype.c' line='3112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_default_interface_peek' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_default_interface_unref' mangled-name='g_type_default_interface_unref' filepath='../gobject/gtype.c' line='3145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_default_interface_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_name' mangled-name='g_type_name' filepath='../gobject/gtype.c' line='3163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_name' hash='030dbd579933d942'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='3163' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='g_type_qname' mangled-name='g_type_qname' filepath='../gobject/gtype.c' line='3183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_qname' hash='3f7b79ee24d3110f'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='3183' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='g_type_from_name' mangled-name='g_type_from_name' filepath='../gobject/gtype.c' line='3204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_from_name' hash='5ae21ed5468382fc'>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gtype.c' line='3204' column='1'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_parent' mangled-name='g_type_parent' filepath='../gobject/gtype.c' line='3227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_parent' hash='91495cdf6321a116'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_depth' mangled-name='g_type_depth' filepath='../gobject/gtype.c' line='3246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_depth' hash='3f7b79ee24d3110f'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_type_next_base' mangled-name='g_type_next_base' filepath='../gobject/gtype.c' line='3271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_next_base' hash='a46227d8770aeeb5'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='3271' column='1'/>
      <parameter type-id='type-id-263' name='base_type' filepath='../gobject/gtype.c' line='3272' column='1'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_is_a' mangled-name='g_type_is_a' filepath='../gobject/gtype.c' line='3366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_is_a' hash='ccc0e5595ea688d4'>
      <parameter type-id='type-id-263' name='src_type' filepath='../gobject/gvalue.c' line='527' column='1'/>
      <parameter type-id='type-id-263' name='dest_type' filepath='../gobject/gvalue.c' line='528' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_type_children' mangled-name='g_type_children' filepath='../gobject/gtype.c' line='3395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_children' hash='8b0c65002997e720'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='3395' column='1'/>
      <parameter type-id='type-id-295' name='n_children' filepath='../gobject/gtype.c' line='3396' column='1'/>
      <return type-id='type-id-173'/>
    </function-decl>
    <function-decl name='g_type_interfaces' mangled-name='g_type_interfaces' filepath='../gobject/gtype.c' line='3439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_interfaces' hash='8b0c65002997e720'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='3395' column='1'/>
      <parameter type-id='type-id-295' name='n_children' filepath='../gobject/gtype.c' line='3396' column='1'/>
      <return type-id='type-id-173'/>
    </function-decl>
    <function-decl name='g_type_get_qdata' mangled-name='g_type_get_qdata' filepath='../gobject/gtype.c' line='3541' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_get_qdata' hash='ef8d4a673fef6caa'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='3541' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gtype.c' line='3542' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_set_qdata' mangled-name='g_type_set_qdata' filepath='../gobject/gtype.c' line='3606' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_set_qdata' hash='ef8d4a673fef6caa'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='3606' column='1'/>
      <parameter type-id='type-id-40' name='quark' filepath='../gobject/gtype.c' line='3607' column='1'/>
      <parameter type-id='type-id-2' name='data' filepath='../gobject/gtype.c' line='3608' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_query' mangled-name='g_type_query' filepath='../gobject/gtype.c' line='3663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_query' hash='414c324b4e5cfd4d'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='3663' column='1'/>
      <parameter type-id='type-id-405' name='query' filepath='../gobject/gtype.c' line='3664' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_get_instance_count' mangled-name='g_type_get_instance_count' filepath='../gobject/gtype.c' line='3703' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_get_instance_count' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='3703' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_type_test_flags' mangled-name='g_type_test_flags' filepath='../gobject/gtype.c' line='3776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_test_flags' hash='6837c62f479ec868'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='3776' column='1'/>
      <parameter type-id='type-id-16' name='flags' filepath='../gobject/gtype.c' line='3777' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_type_get_plugin' mangled-name='g_type_get_plugin' filepath='../gobject/gtype.c' line='3792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_get_plugin' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-420'/>
    </function-decl>
    <function-decl name='g_type_interface_get_plugin' mangled-name='g_type_interface_get_plugin' filepath='../gobject/gtype.c' line='3815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_interface_get_plugin' hash='91495cdf6321a116'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-420'/>
    </function-decl>
    <function-decl name='g_type_fundamental_next' mangled-name='g_type_fundamental_next' filepath='../gobject/gtype.c' line='3862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_fundamental_next' hash='e0055d99adb0e173'>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_fundamental' mangled-name='g_type_fundamental' filepath='../gobject/gtype.c' line='3883' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_fundamental' hash='91495cdf6321a116'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_check_instance_is_a' mangled-name='g_type_check_instance_is_a' filepath='../gobject/gtype.c' line='3891' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_instance_is_a' hash='c163f18f9c9ace88'>
      <parameter type-id='type-id-422' name='type_instance' filepath='../gobject/gtype.c' line='3891' column='1'/>
      <parameter type-id='type-id-263' name='iface_type' filepath='../gobject/gtype.c' line='3892' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_type_check_instance_is_fundamentally_a' mangled-name='g_type_check_instance_is_fundamentally_a' filepath='../gobject/gtype.c' line='3911' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_instance_is_fundamentally_a' hash='c163f18f9c9ace88'>
      <parameter type-id='type-id-422' name='type_instance' filepath='../gobject/gtype.c' line='3891' column='1'/>
      <parameter type-id='type-id-263' name='iface_type' filepath='../gobject/gtype.c' line='3892' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_type_check_class_is_a' mangled-name='g_type_check_class_is_a' filepath='../gobject/gtype.c' line='3922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_class_is_a' hash='58b6b299a1e057b1'>
      <parameter type-id='type-id-426'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_type_check_instance_cast' mangled-name='g_type_check_instance_cast' filepath='../gobject/gtype.c' line='3939' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_instance_cast' hash='00331772bb7c3881'>
      <parameter type-id='type-id-422' name='type_instance' filepath='../gobject/gtype.c' line='3939' column='1'/>
      <parameter type-id='type-id-263' name='iface_type' filepath='../gobject/gtype.c' line='3940' column='1'/>
      <return type-id='type-id-422'/>
    </function-decl>
    <function-decl name='g_type_check_class_cast' mangled-name='g_type_check_class_cast' filepath='../gobject/gtype.c' line='3974' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_class_cast' hash='61e430179d3aca05'>
      <parameter type-id='type-id-426' name='type_class' filepath='../gobject/gtype.c' line='3974' column='1'/>
      <parameter type-id='type-id-263' name='is_a_type' filepath='../gobject/gtype.c' line='3975' column='1'/>
      <return type-id='type-id-426'/>
    </function-decl>
    <function-decl name='g_type_check_instance' mangled-name='g_type_check_instance' filepath='../gobject/gtype.c' line='4014' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_instance' hash='2650de0d26873df6'>
      <parameter type-id='type-id-422' name='type_instance' filepath='../gobject/gtype.c' line='4014' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_type_check_is_value_type' mangled-name='g_type_check_is_value_type' filepath='../gobject/gtype.c' line='4082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_is_value_type' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-263' name='type' filepath='../gobject/gtype.c' line='4082' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_type_check_value' mangled-name='g_type_check_value' filepath='../gobject/gtype.c' line='4088' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_value' hash='d48515f4487a3a65'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_type_check_value_holds' mangled-name='g_type_check_value_holds' filepath='../gobject/gtype.c' line='4094' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_value_holds' hash='26083f2199cfb26d'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_type_value_table_peek' mangled-name='g_type_value_table_peek' filepath='../gobject/gtype.c' line='4115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_value_table_peek' hash='561c14dd9c388641'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-407'/>
    </function-decl>
    <function-decl name='g_type_name_from_instance' mangled-name='g_type_name_from_instance' filepath='../gobject/gtype.c' line='4167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_name_from_instance' hash='828efa8f6e345afa'>
      <parameter type-id='type-id-422' name='instance' filepath='../gobject/gtype.c' line='4167' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='g_type_name_from_class' mangled-name='g_type_name_from_class' filepath='../gobject/gtype.c' line='4176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_name_from_class' hash='e6678baa5b8e00cb'>
      <parameter type-id='type-id-426' name='g_class' filepath='../gobject/gtype.c' line='4176' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='g_type_init_with_debug_flags' mangled-name='g_type_init_with_debug_flags' filepath='../gobject/gtype.c' line='4230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_init_with_debug_flags' hash='348946b9f3f23cd2'>
      <parameter type-id='type-id-378' name='debug_flags' filepath='../gobject/gtype.c' line='4230' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_init' mangled-name='g_type_init' filepath='../gobject/gtype.c' line='4249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_init' hash='7f32ffea222edbe7'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_class_add_private' mangled-name='g_type_class_add_private' filepath='../gobject/gtype.c' line='4514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_add_private' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-2' name='g_class' filepath='../gobject/gtype.c' line='4514' column='1'/>
      <parameter type-id='type-id-1' name='private_size' filepath='../gobject/gtype.c' line='4515' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_add_instance_private' mangled-name='g_type_add_instance_private' filepath='../gobject/gtype.c' line='4551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_add_instance_private' hash='ccc0e5595ea688d4'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='g_type_class_adjust_private_offset' mangled-name='g_type_class_adjust_private_offset' filepath='../gobject/gtype.c' line='4608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_adjust_private_offset' hash='2f6ad53d291bc7fa'>
      <parameter type-id='type-id-2' name='g_class' filepath='../gobject/gtype.c' line='4608' column='1'/>
      <parameter type-id='type-id-368' name='private_size_or_offset' filepath='../gobject/gtype.c' line='4609' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_instance_get_private' mangled-name='g_type_instance_get_private' filepath='../gobject/gtype.c' line='4657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_instance_get_private' hash='0b6944c9432c2256'>
      <parameter type-id='type-id-422' name='instance' filepath='../gobject/gtype.c' line='4657' column='1'/>
      <parameter type-id='type-id-263' name='private_type' filepath='../gobject/gtype.c' line='4658' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_class_get_instance_private_offset' mangled-name='g_type_class_get_instance_private_offset' filepath='../gobject/gtype.c' line='4693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_get_instance_private_offset' hash='388da3fa973fde78'>
      <parameter type-id='type-id-2' name='g_class' filepath='../gobject/gtype.c' line='4693' column='1'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='g_type_add_class_private' mangled-name='g_type_add_class_private' filepath='../gobject/gtype.c' line='4742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_add_class_private' hash='91495cdf6321a116'>
      <parameter type-id='type-id-263' name='class_type' filepath='../gobject/gtype.c' line='4742' column='1'/>
      <parameter type-id='type-id-1' name='private_size' filepath='../gobject/gtype.c' line='4743' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_class_get_private' mangled-name='g_type_class_get_private' filepath='../gobject/gtype.c' line='4776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_get_private' hash='b45f6a13168ffc1b'>
      <parameter type-id='type-id-426' name='klass' filepath='../gobject/gtype.c' line='4776' column='1'/>
      <parameter type-id='type-id-263' name='private_type' filepath='../gobject/gtype.c' line='4777' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_type_ensure' mangled-name='g_type_ensure' filepath='../gobject/gtype.c' line='4841' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_ensure' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-263'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='GTypePlugin' type-id='type-id-421' filepath='../gobject/gtype.h' line='433' column='1' id='type-id-419'/>
    <function-decl name='g_type_module_get_type' mangled-name='g_type_module_get_type' filepath='../gobject/gtypemodule.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_module_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_module_set_name' mangled-name='g_type_module_set_name' filepath='../gobject/gtypemodule.c' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_module_set_name' hash='cbece65f4b59ea5d'>
      <parameter type-id='type-id-404' name='module' filepath='../gobject/gtypemodule.c' line='186' column='1'/>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gtypemodule.c' line='187' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_module_use' mangled-name='g_type_module_use' filepath='../gobject/gtypemodule.c' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_module_use' hash='17fa0e4845d97be6'>
      <parameter type-id='type-id-404' name='module' filepath='../gobject/gtypemodule.c' line='244' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_type_module_unuse' mangled-name='g_type_module_unuse' filepath='../gobject/gtypemodule.c' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_module_unuse' hash='61b908fd37f83c4b'>
      <parameter type-id='type-id-404' name='module' filepath='../gobject/gtypemodule.c' line='290' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_module_register_type' mangled-name='g_type_module_register_type' filepath='../gobject/gtypemodule.c' line='379' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_module_register_type' hash='7893f19f092c6607'>
      <parameter type-id='type-id-404' name='module' filepath='../gobject/gtypemodule.c' line='379' column='1'/>
      <parameter type-id='type-id-263' name='parent_type' filepath='../gobject/gtypemodule.c' line='380' column='1'/>
      <parameter type-id='type-id-8' name='type_name' filepath='../gobject/gtypemodule.c' line='381' column='1'/>
      <parameter type-id='type-id-415' name='type_info' filepath='../gobject/gtypemodule.c' line='382' column='1'/>
      <parameter type-id='type-id-380' name='flags' filepath='../gobject/gtypemodule.c' line='383' column='1'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_module_add_interface' mangled-name='g_type_module_add_interface' filepath='../gobject/gtypemodule.c' line='471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_module_add_interface' hash='5c49a52191439830'>
      <parameter type-id='type-id-404' name='module' filepath='../gobject/gtypemodule.c' line='471' column='1'/>
      <parameter type-id='type-id-263' name='instance_type' filepath='../gobject/gtypemodule.c' line='472' column='1'/>
      <parameter type-id='type-id-263' name='interface_type' filepath='../gobject/gtypemodule.c' line='473' column='1'/>
      <parameter type-id='type-id-410' name='interface_info' filepath='../gobject/gtypemodule.c' line='474' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_module_register_enum' mangled-name='g_type_module_register_enum' filepath='../gobject/gtypemodule.c' line='548' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_module_register_enum' hash='4f54f45c678f8260'>
      <parameter type-id='type-id-404' name='module' filepath='../gobject/gtypemodule.c' line='548' column='1'/>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gtypemodule.c' line='549' column='1'/>
      <parameter type-id='type-id-427' name='const_static_values' filepath='../gobject/gtypemodule.c' line='550' column='1'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_module_register_flags' mangled-name='g_type_module_register_flags' filepath='../gobject/gtypemodule.c' line='589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_module_register_flags' hash='3a740ce02374824d'>
      <parameter type-id='type-id-404' name='module' filepath='../gobject/gtypemodule.c' line='589' column='1'/>
      <parameter type-id='type-id-8' name='name' filepath='../gobject/gtypemodule.c' line='590' column='1'/>
      <parameter type-id='type-id-428' name='const_static_values' filepath='../gobject/gtypemodule.c' line='591' column='1'/>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_plugin_get_type' mangled-name='g_type_plugin_get_type' filepath='../gobject/gtypeplugin.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_plugin_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-263'/>
    </function-decl>
    <function-decl name='g_type_plugin_use' mangled-name='g_type_plugin_use' filepath='../gobject/gtypeplugin.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_plugin_use' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-420'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_plugin_unuse' mangled-name='g_type_plugin_unuse' filepath='../gobject/gtypeplugin.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_plugin_unuse' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-420'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_plugin_complete_type_info' mangled-name='g_type_plugin_complete_type_info' filepath='../gobject/gtypeplugin.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_plugin_complete_type_info' hash='5e89148d62f31e57'>
      <parameter type-id='type-id-420'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-429'/>
      <parameter type-id='type-id-407'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_type_plugin_complete_interface_info' mangled-name='g_type_plugin_complete_interface_info' filepath='../gobject/gtypeplugin.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_plugin_complete_interface_info' hash='ca8a9de0f7c42b7e'>
      <parameter type-id='type-id-420'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-403'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_init' mangled-name='g_value_init' filepath='../gobject/gvalue.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_init' hash='d8be554399b10fe2'>
      <parameter type-id='type-id-15' name='value' filepath='../gobject/gvalue.c' line='94' column='1'/>
      <parameter type-id='type-id-263' name='g_type' filepath='../gobject/gvalue.c' line='95' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='g_value_copy' mangled-name='g_value_copy' filepath='../gobject/gvalue.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_copy' hash='1a25e8acfe50e042'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_reset' mangled-name='g_value_reset' filepath='../gobject/gvalue.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_reset' hash='f9bcf32d1cd07f6d'>
      <parameter type-id='type-id-15' name='value' filepath='../gobject/gvalue.c' line='167' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='g_value_unset' mangled-name='g_value_unset' filepath='../gobject/gvalue.c' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_unset' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-15' name='value' filepath='../gobject/gvalue.c' line='200' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_fits_pointer' mangled-name='g_value_fits_pointer' filepath='../gobject/gvalue.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_fits_pointer' hash='d48515f4487a3a65'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_value_peek_pointer' mangled-name='g_value_peek_pointer' filepath='../gobject/gvalue.c' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_peek_pointer' hash='fe8357e11df9e46f'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_value_set_instance' mangled-name='g_value_set_instance' filepath='../gobject/gvalue.c' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_instance' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_init_from_instance' mangled-name='g_value_init_from_instance' filepath='../gobject/gvalue.c' line='345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_init_from_instance' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_register_transform_func' mangled-name='g_value_register_transform_func' filepath='../gobject/gvalue.c' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_register_transform_func' hash='3aa907ea60dd12ba'>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-263'/>
      <parameter type-id='type-id-402'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_type_transformable' mangled-name='g_value_type_transformable' filepath='../gobject/gvalue.c' line='506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_type_transformable' hash='ccc0e5595ea688d4'>
      <parameter type-id='type-id-263' name='src_type' filepath='../gobject/gvalue.c' line='527' column='1'/>
      <parameter type-id='type-id-263' name='dest_type' filepath='../gobject/gvalue.c' line='528' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_value_type_compatible' mangled-name='g_value_type_compatible' filepath='../gobject/gvalue.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_type_compatible' hash='ccc0e5595ea688d4'>
      <parameter type-id='type-id-263' name='src_type' filepath='../gobject/gvalue.c' line='527' column='1'/>
      <parameter type-id='type-id-263' name='dest_type' filepath='../gobject/gvalue.c' line='528' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_value_transform' mangled-name='g_value_transform' filepath='../gobject/gvalue.c' line='562' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_transform' hash='f07f313a21fba8e1'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_value_array_get_nth' mangled-name='g_value_array_get_nth' filepath='../gobject/gvaluearray.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_array_get_nth' hash='2fbbc06e9bdcc1c7'>
      <parameter type-id='type-id-288' name='value_array' filepath='../gobject/gvaluearray.c' line='81' column='1'/>
      <parameter type-id='type-id-16' name='index' filepath='../gobject/gvaluearray.c' line='82' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='g_value_array_new' mangled-name='g_value_array_new' filepath='../gobject/gvaluearray.c' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_array_new' hash='5772ebd2f1740ddb'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-288'/>
    </function-decl>
    <function-decl name='g_value_array_free' mangled-name='g_value_array_free' filepath='../gobject/gvaluearray.c' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_array_free' hash='e39deccbb3551c7e'>
      <parameter type-id='type-id-288'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_value_array_copy' mangled-name='g_value_array_copy' filepath='../gobject/gvaluearray.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_array_copy' hash='9a8de22073217c09'>
      <parameter type-id='type-id-417'/>
      <return type-id='type-id-288'/>
    </function-decl>
    <function-type size-in-bits='64' hash='0b6acd30c91a791f' id='type-id-418'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-426'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='e7a9fd9868345a8f' id='type-id-430'>
      <parameter type-id='type-id-15' name='value' filepath='../gobject/gvalue.c' line='200' column='1'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-40d5' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-431'/>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-432'/>
    <enum-decl name='GBindingFlags' naming-typedef-id='type-id-23' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gbinding.h' line='91' column='1' hash='90f07c91c341ef70' id='type-id-433'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_BINDING_DEFAULT' value='0'/>
      <enumerator name='G_BINDING_BIDIRECTIONAL' value='1'/>
      <enumerator name='G_BINDING_SYNC_CREATE' value='2'/>
      <enumerator name='G_BINDING_INVERT_BOOLEAN' value='4'/>
    </enum-decl>
    <enum-decl name='GParamFlags' naming-typedef-id='type-id-310' size-in-bits='32' alignment-in-bits='32' filepath='../gobject/gparam.h' line='157' column='1' hash='0d731ff2ef6aeaf8' id='type-id-434'>
      <underlying-type type-id='type-id-29'/>
      <enumerator name='G_PARAM_READABLE' value='1'/>
      <enumerator name='G_PARAM_WRITABLE' value='2'/>
      <enumerator name='G_PARAM_READWRITE' value='3'/>
      <enumerator name='G_PARAM_CONSTRUCT' value='4'/>
      <enumerator name='G_PARAM_CONSTRUCT_ONLY' value='8'/>
      <enumerator name='G_PARAM_LAX_VALIDATION' value='16'/>
      <enumerator name='G_PARAM_STATIC_NAME' value='32'/>
      <enumerator name='G_PARAM_PRIVATE' value='32'/>
      <enumerator name='G_PARAM_STATIC_NICK' value='64'/>
      <enumerator name='G_PARAM_STATIC_BLURB' value='128'/>
      <enumerator name='G_PARAM_EXPLICIT_NOTIFY' value='1073741824'/>
      <enumerator name='G_PARAM_DEPRECATED' value='-2147483648'/>
    </enum-decl>
