<abi-corpus version='2.4' architecture='elf-amd-x86_64' soname='libxkbcommon.so.0'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='xkb_components_names_from_rules' version='V_1.9.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xkb_compose_state_feed' version='V_0.5.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xkb_compose_state_get_compose_table' version='V_0.5.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xkb_compose_state_get_one_sym' version='V_0.5.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xkb_compose_state_get_status' version='V_0.5.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xkb_compose_state_get_utf8' version='V_0.5.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='xkb_compose_state_new' version='V_0.5.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='memcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memmove' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='mmap64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='munmap' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='open64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='secure_getenv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='snprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stat64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stpcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strndup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strpbrk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='../src/keymap.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='../src/state.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='../src/xkbcomp/action.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='unknown' hash='aff9c39e2ef3dbea' id='type-id-2'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-3'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' hash='e24def43c7e4b3b5' id='type-id-5'/>
  </abi-instr>
  <abi-instr address-size='64' path='../src/xkbcomp/compat.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='4742219a026c0661' id='type-id-7'/>
  </abi-instr>
  <abi-instr address-size='64' path='../src/xkbcomp/include.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <function-decl name='strpbrk' filepath='/usr/include/string.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strpbrk' hash='21babdbcb7a34ebe'>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/xkbcomp/keymap-dump.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='../src/xkbcomp/scanner.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='../src/xkbcomp/symbols.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <qualified-type-def type-id='type-id-10' const='yes' hash='e7c60574e36eb5b5' id='type-id-11'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' hash='c753746ab53a00f6' id='type-id-12'/>
    <qualified-type-def type-id='type-id-13' const='yes' hash='e95298c9114cfe09' id='type-id-14'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' hash='2d8ddc3c18cdd7c0' id='type-id-15'/>
  </abi-instr>
  <abi-instr address-size='64' path='../src/xkbcomp/types.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='../src/xkbcomp/vmod.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='../src/xkbcomp/xkbcomp.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-18989' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' hash='184fdb40ce346ace' id='type-id-17'/>
    <function-decl name='__builtin___vsnprintf_chk' mangled-name='__vsnprintf_chk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__vsnprintf_chk' hash='7f32ffea222edbe7'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove' hash='7f32ffea222edbe7'>
      <return type-id='type-id-18'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-1fa27' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <function-decl name='__builtin___memcpy_chk' mangled-name='__memcpy_chk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__memcpy_chk' hash='7f32ffea222edbe7'>
      <return type-id='type-id-18'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-2b02d' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='192' hash='9904ddbe9e0e1da6' id='type-id-20'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-22'/>
    </array-type-def>
    <enum-decl name='RMLVO' size-in-bits='32' alignment-in-bits='32' filepath='../src/rmlvo.h' line='14' column='1' hash='9e905117a4443f5c' id='type-id-23'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='RMLVO_RULES' value='1'/>
      <enumerator name='RMLVO_MODEL' value='2'/>
      <enumerator name='RMLVO_LAYOUT' value='4'/>
      <enumerator name='RMLVO_VARIANT' value='8'/>
      <enumerator name='RMLVO_OPTIONS' value='16'/>
    </enum-decl>
    <enum-decl name='xkb_consumed_mode' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='2326' column='1' hash='cf0995d4f05c545e' id='type-id-25'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_CONSUMED_MODE_XKB' value='0'/>
      <enumerator name='XKB_CONSUMED_MODE_GTK' value='1'/>
    </enum-decl>
    <enum-decl name='xkb_context_flags' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='785' column='1' hash='7f3ccf7d6790a9cd' id='type-id-26'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_CONTEXT_NO_FLAGS' value='0'/>
      <enumerator name='XKB_CONTEXT_NO_DEFAULT_INCLUDES' value='1'/>
      <enumerator name='XKB_CONTEXT_NO_ENVIRONMENT_NAMES' value='2'/>
      <enumerator name='XKB_CONTEXT_NO_SECURE_GETENV' value='4'/>
    </enum-decl>
    <enum-decl name='xkb_key_direction' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='1786' column='1' hash='77856ab894c2375e' id='type-id-27'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_KEY_UP' value='0'/>
      <enumerator name='XKB_KEY_DOWN' value='1'/>
    </enum-decl>
    <enum-decl name='xkb_keysym_flags' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='629' column='1' hash='57df32fc0f625917' id='type-id-28'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_KEYSYM_NO_FLAGS' value='0'/>
      <enumerator name='XKB_KEYSYM_CASE_INSENSITIVE' value='1'/>
    </enum-decl>
    <enum-decl name='xkb_rmlvo_builder_flags' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='316' column='1' hash='b602fe4452a7636b' id='type-id-29'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_RMLVO_BUILDER_NO_FLAGS' value='0'/>
    </enum-decl>
    <enum-decl name='xkb_state_match' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='2091' column='1' hash='a14af1ad19a403c8' id='type-id-30'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_STATE_MATCH_ANY' value='1'/>
      <enumerator name='XKB_STATE_MATCH_ALL' value='2'/>
      <enumerator name='XKB_STATE_MATCH_NON_EXCLUSIVE' value='65536'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-31' size-in-bits='512' hash='aa4673ad2aaa4732' id='type-id-32'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-33'/>
    </array-type-def>
    <class-decl name='VModDef' is-struct='yes' naming-typedef-id='type-id-34' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='219' column='1' hash='b1e58bce7f6c4180' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='name' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='value' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='223' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' is-struct='yes' visibility='default' size-in-bits='1152' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' hash='4f24305487cf2e09' id='type-id-40'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-41' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-42' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-43' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-44' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-45' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-41' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-48' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-49' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-50' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-20' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='state_components' is-struct='yes' visibility='default' size-in-bits='288' filepath='../src/state.c' line='44' column='1' hash='5875b70d1a05e5d2' id='type-id-52'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='base_group' type-id='type-id-53' visibility='default' filepath='../src/state.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='latched_group' type-id='type-id-53' visibility='default' filepath='../src/state.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='locked_group' type-id='type-id-53' visibility='default' filepath='../src/state.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='group' type-id='type-id-54' visibility='default' filepath='../src/state.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='base_mods' type-id='type-id-55' visibility='default' filepath='../src/state.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='latched_mods' type-id='type-id-55' visibility='default' filepath='../src/state.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='locked_mods' type-id='type-id-55' visibility='default' filepath='../src/state.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='mods' type-id='type-id-55' visibility='default' filepath='../src/state.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='leds' type-id='type-id-56' visibility='default' filepath='../src/state.c' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' hash='7451f9a3207df4f1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-57' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_filter' is-struct='yes' visibility='default' size-in-bits='384' filepath='../src/state.c' line='33' column='1' hash='3844084c47770b48' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='action' type-id='type-id-59' visibility='default' filepath='../src/state.c' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key' type-id='type-id-60' visibility='default' filepath='../src/state.c' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-61' visibility='default' filepath='../src/state.c' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='func' type-id='type-id-62' visibility='default' filepath='../src/state.c' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='refcnt' type-id='type-id-47' visibility='default' filepath='../src/state.c' line='41' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_rmlvo_builder' is-struct='yes' visibility='default' size-in-bits='512' filepath='../src/rmlvo.h' line='36' column='1' hash='fa812039134b21f2' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rules' type-id='type-id-9' visibility='default' filepath='../src/rmlvo.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='model' type-id='type-id-9' visibility='default' filepath='../src/rmlvo.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='layouts' type-id='type-id-64' visibility='default' filepath='../src/rmlvo.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='options' type-id='type-id-65' visibility='default' filepath='../src/rmlvo.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='refcnt' type-id='type-id-47' visibility='default' filepath='../src/rmlvo.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ctx' type-id='type-id-66' visibility='default' filepath='../src/rmlvo.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_rmlvo_builder_layout' is-struct='yes' visibility='default' size-in-bits='128' filepath='../src/rmlvo.h' line='22' column='1' hash='a663b2d5bc29082e' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='layout' type-id='type-id-9' visibility='default' filepath='../src/rmlvo.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='variant' type-id='type-id-9' visibility='default' filepath='../src/rmlvo.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_rmlvo_builder_layouts' is-struct='yes' naming-typedef-id='type-id-64' visibility='default' size-in-bits='128' filepath='../src/rmlvo.h' line='27' column='1' hash='a91c809bbc039280' id='type-id-68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='item' type-id='type-id-69' visibility='default' filepath='../src/rmlvo.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-70' visibility='default' filepath='../src/rmlvo.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alloc' type-id='type-id-70' visibility='default' filepath='../src/rmlvo.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_rmlvo_builder_option' is-struct='yes' visibility='default' size-in-bits='128' filepath='../src/rmlvo.h' line='29' column='1' hash='83452077d400166f' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='option' type-id='type-id-9' visibility='default' filepath='../src/rmlvo.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='layout' type-id='type-id-54' visibility='default' filepath='../src/rmlvo.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_rmlvo_builder_options' is-struct='yes' naming-typedef-id='type-id-65' visibility='default' size-in-bits='128' filepath='../src/rmlvo.h' line='34' column='1' hash='869acd4d12eef5d8' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='item' type-id='type-id-73' visibility='default' filepath='../src/rmlvo.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-70' visibility='default' filepath='../src/rmlvo.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alloc' type-id='type-id-70' visibility='default' filepath='../src/rmlvo.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_state' is-struct='yes' visibility='default' size-in-bits='1088' filepath='../src/state.c' line='59' column='1' hash='cf48be8f118afdbf' id='type-id-74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='components' type-id='type-id-52' visibility='default' filepath='../src/state.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='set_mods' type-id='type-id-55' visibility='default' filepath='../src/state.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='clear_mods' type-id='type-id-55' visibility='default' filepath='../src/state.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='mod_key_count' type-id='type-id-32' visibility='default' filepath='../src/state.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='refcnt' type-id='type-id-47' visibility='default' filepath='../src/state.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='filters' type-id='type-id-75' visibility='default' filepath='../src/state.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='keymap' type-id='type-id-76' visibility='default' filepath='../src/state.c' line='83' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../src/state.c' line='82' column='1' hash='bc2f7f8f6ea30e40#12' id='type-id-75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='item' type-id='type-id-77' visibility='default' filepath='../src/state.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-70' visibility='default' filepath='../src/state.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alloc' type-id='type-id-70' visibility='default' filepath='../src/state.c' line='82' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='VModDef' type-id='type-id-35' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='224' column='1' id='type-id-34'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-78' size-in-bits='64' filepath='/usr/include/bits/types.h' line='180' column='1' hash='b119fe0931d2ee10' id='type-id-50'/>
    <typedef-decl name='__blksize_t' type-id='type-id-78' size-in-bits='64' filepath='/usr/include/bits/types.h' line='175' column='1' hash='b119fe0931d2ee10' id='type-id-49'/>
    <typedef-decl name='__dev_t' type-id='type-id-21' size-in-bits='64' filepath='/usr/include/bits/types.h' line='145' column='1' hash='8fdc5eea2983a729' id='type-id-41'/>
    <typedef-decl name='__gid_t' type-id='type-id-79' size-in-bits='32' filepath='/usr/include/bits/types.h' line='147' column='1' hash='e66b43f97c38e87a' id='type-id-46'/>
    <typedef-decl name='__ino_t' type-id='type-id-21' size-in-bits='64' filepath='/usr/include/bits/types.h' line='148' column='1' hash='8fdc5eea2983a729' id='type-id-42'/>
    <typedef-decl name='__mode_t' type-id='type-id-79' size-in-bits='32' filepath='/usr/include/bits/types.h' line='150' column='1' hash='e66b43f97c38e87a' id='type-id-44'/>
    <typedef-decl name='__nlink_t' type-id='type-id-21' size-in-bits='64' filepath='/usr/include/bits/types.h' line='151' column='1' hash='8fdc5eea2983a729' id='type-id-43'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-78' size-in-bits='64' filepath='/usr/include/bits/types.h' line='197' column='1' hash='b119fe0931d2ee10' id='type-id-19'/>
    <typedef-decl name='__time_t' type-id='type-id-78' size-in-bits='64' filepath='/usr/include/bits/types.h' line='160' column='1' hash='b119fe0931d2ee10' id='type-id-57'/>
    <typedef-decl name='__uid_t' type-id='type-id-79' size-in-bits='32' filepath='/usr/include/bits/types.h' line='146' column='1' hash='e66b43f97c38e87a' id='type-id-45'/>
    <typedef-decl name='xkb_keymap_key_iter_t' type-id='type-id-80' size-in-bits='64' filepath='../include/xkbcommon/xkbcommon.h' line='1388' column='1' hash='fd7a63c0c6c822c4' id='type-id-81'/>
    <typedef-decl name='xkb_led_mask_t' type-id='type-id-61' size-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='257' column='1' hash='e66b43f97c38e87a' id='type-id-56'/>
    <typedef-decl name='xkb_rmlvo_builder_layouts' type-id='type-id-68' size-in-bits='128' filepath='../src/rmlvo.h' line='27' column='1' id='type-id-64'/>
    <typedef-decl name='xkb_rmlvo_builder_options' type-id='type-id-72' size-in-bits='128' filepath='../src/rmlvo.h' line='34' column='1' id='type-id-65'/>
    <qualified-type-def type-id='type-id-82' restrict='yes' hash='6a2cf982d0fba87f' id='type-id-83'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' hash='4661d5771cebecb0' id='type-id-84'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-62'/>
    <qualified-type-def type-id='type-id-8' const='yes' hash='ec42cf78a9d93a8c' id='type-id-86'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' hash='b529075cb120abc3' id='type-id-87'/>
    <qualified-type-def type-id='type-id-59' const='yes' hash='50e01e921b82b541' id='type-id-88'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' hash='e72c4d2f094b9e20' id='type-id-89'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' hash='b5d43b2d4097117e' id='type-id-90'/>
    <qualified-type-def type-id='type-id-91' const='yes' hash='e6b0aa2e0c764442' id='type-id-92'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' hash='158af475838636b1' id='type-id-60'/>
    <qualified-type-def type-id='type-id-63' const='yes' hash='b93aa9976114d534' id='type-id-93'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' hash='15278a4b6da47a03' id='type-id-94'/>
    <qualified-type-def type-id='type-id-95' const='yes' hash='5accd14ca09c87e6' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' hash='e5ae1b9ff0ed81d1' id='type-id-97'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='925ad1338878bb49' id='type-id-98'/>
    <qualified-type-def type-id='type-id-98' restrict='yes' hash='625d51349de39d13' id='type-id-99'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-80'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' hash='c77c4910d67f8835' id='type-id-102'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' hash='88159253bd37bac0' id='type-id-77'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' hash='832ca6f724cb6a80' id='type-id-103'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' hash='c0483abe2bfba937' id='type-id-104'/>
    <pointer-type-def type-id='type-id-67' size-in-bits='64' hash='dc3ebccdcb60c890' id='type-id-69'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' hash='85351116d6fe3419' id='type-id-73'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' hash='a9a0ce823d5a11f0' id='type-id-105'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' hash='546aba70e7d40c90' id='type-id-106'/>
    <function-decl name='__builtin___memset_chk' mangled-name='__memset_chk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__memset_chk' hash='7f32ffea222edbe7'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='__builtin_snprintf' mangled-name='snprintf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprintf' hash='7f32ffea222edbe7'>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_context_include_path_append' mangled-name='xkb_context_include_path_append' filepath='../src/context.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_include_path_append@@V_0.5.0' hash='7f0a70dbdef576dd'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/context.c' line='25' column='1'/>
      <parameter type-id='type-id-8' name='path' filepath='../src/context.c' line='25' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_context_include_path_append_default' mangled-name='xkb_context_include_path_append_default' filepath='../src/context.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_include_path_append_default@@V_0.5.0' hash='90362b79c9fca7f6'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/context.c' line='332' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_context_include_path_clear' mangled-name='xkb_context_include_path_clear' filepath='../src/context.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_include_path_clear@@V_0.5.0' hash='a4c24fe0db1b8e10'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_context_include_path_reset_defaults' mangled-name='xkb_context_include_path_reset_defaults' filepath='../src/context.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_include_path_reset_defaults@@V_0.5.0' hash='90362b79c9fca7f6'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/context.c' line='332' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_context_num_include_paths' mangled-name='xkb_context_num_include_paths' filepath='../src/context.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_num_include_paths@@V_0.5.0' hash='45c884b474bceff6'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-79'/>
    </function-decl>
    <function-decl name='xkb_context_include_path_get' mangled-name='xkb_context_include_path_get' filepath='../src/context.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_include_path_get@@V_0.5.0' hash='7c72a81d630da8e4'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-79'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='xkb_context_ref' mangled-name='xkb_context_ref' filepath='../src/context.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_ref@@V_0.5.0' hash='c3a79ff901958dd7'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='xkb_context_unref' mangled-name='xkb_context_unref' filepath='../src/context.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_unref@@V_0.5.0' hash='a4c24fe0db1b8e10'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_context_new' mangled-name='xkb_context_new' filepath='../src/context.c' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_new@@V_0.5.0' hash='8638cf60bd97d40d'>
      <parameter type-id='type-id-26' name='flags' filepath='../src/context.c' line='266' column='1'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='xkb_context_set_log_fn' mangled-name='xkb_context_set_log_fn' filepath='../src/context.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_set_log_fn@@V_0.5.0' hash='dd6a90709b7cf596'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/context.c' line='311' column='1'/>
      <parameter type-id='type-id-107' name='log_fn' filepath='../src/context.c' line='312' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_context_get_log_level' mangled-name='xkb_context_get_log_level' filepath='../src/context.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_get_log_level@@V_0.5.0' hash='80aa7afe2998dd54'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/context.c' line='320' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='xkb_context_set_log_level' mangled-name='xkb_context_set_log_level' filepath='../src/context.c' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_set_log_level@@V_0.5.0' hash='eb33ba4a05e6ecc9'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/context.c' line='326' column='1'/>
      <parameter type-id='type-id-108' name='level' filepath='../src/context.c' line='326' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_context_get_log_verbosity' mangled-name='xkb_context_get_log_verbosity' filepath='../src/context.c' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_get_log_verbosity@@V_0.5.0' hash='90362b79c9fca7f6'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/context.c' line='332' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_context_set_log_verbosity' mangled-name='xkb_context_set_log_verbosity' filepath='../src/context.c' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_set_log_verbosity@@V_0.5.0' hash='c004c7fba863e583'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/context.c' line='338' column='1'/>
      <parameter type-id='type-id-47' name='verbosity' filepath='../src/context.c' line='338' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_context_get_user_data' mangled-name='xkb_context_get_user_data' filepath='../src/context.c' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_get_user_data@@V_0.5.0' hash='a4c24fe0db1b8e10'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/context.c' line='344' column='1'/>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='xkb_context_set_user_data' mangled-name='xkb_context_set_user_data' filepath='../src/context.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_context_set_user_data@@V_0.5.0' hash='a4c24fe0db1b8e10'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/context.c' line='352' column='1'/>
      <parameter type-id='type-id-109' name='user_data' filepath='../src/context.c' line='352' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_keymap_ref' mangled-name='xkb_keymap_ref' filepath='../src/keymap.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_ref@@V_0.5.0' hash='7332614e2a962b2f'>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='xkb_keymap_unref' mangled-name='xkb_keymap_unref' filepath='../src/keymap.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_unref@@V_0.5.0' hash='df76bd109f53f809'>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_keymap_new_from_rmlvo' mangled-name='xkb_keymap_new_from_rmlvo' filepath='../src/keymap.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_new_from_rmlvo@@V_1.11.0' hash='d9f1c6b02ef387a9'>
      <parameter type-id='type-id-94' name='rmlvo' filepath='../src/keymap.c' line='108' column='1'/>
      <parameter type-id='type-id-110' name='format' filepath='../src/keymap.c' line='109' column='1'/>
      <parameter type-id='type-id-111' name='flags' filepath='../src/keymap.c' line='110' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='xkb_keymap_new_from_names2' mangled-name='xkb_keymap_new_from_names2' filepath='../src/keymap.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_new_from_names2@@V_1.11.0' hash='8f2c7b1d6b519407'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/keymap.c' line='141' column='1'/>
      <parameter type-id='type-id-97' name='rmlvo_in' filepath='../src/keymap.c' line='142' column='1'/>
      <parameter type-id='type-id-110' name='format' filepath='../src/keymap.c' line='143' column='1'/>
      <parameter type-id='type-id-111' name='flags' filepath='../src/keymap.c' line='144' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='xkb_keymap_new_from_names' mangled-name='xkb_keymap_new_from_names' filepath='../src/keymap.c' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_new_from_names@@V_0.5.0' hash='2294ff31d0b5d380'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/keymap.c' line='183' column='1'/>
      <parameter type-id='type-id-97' name='rmlvo_in' filepath='../src/keymap.c' line='184' column='1'/>
      <parameter type-id='type-id-111' name='flags' filepath='../src/keymap.c' line='185' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='xkb_keymap_new_from_string' mangled-name='xkb_keymap_new_from_string' filepath='../src/keymap.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_new_from_string@@V_0.5.0' hash='6053cb46bbb53190'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/keymap.c' line='192' column='1'/>
      <parameter type-id='type-id-8' name='string' filepath='../src/keymap.c' line='193' column='1'/>
      <parameter type-id='type-id-110' name='format' filepath='../src/keymap.c' line='194' column='1'/>
      <parameter type-id='type-id-111' name='flags' filepath='../src/keymap.c' line='195' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='xkb_keymap_new_from_buffer' mangled-name='xkb_keymap_new_from_buffer' filepath='../src/keymap.c' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_new_from_buffer@@V_0.5.0' hash='3f937ff28402755a'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/keymap.c' line='202' column='1'/>
      <parameter type-id='type-id-8' name='buffer' filepath='../src/keymap.c' line='203' column='1'/>
      <parameter type-id='type-id-112' name='length' filepath='../src/keymap.c' line='203' column='1'/>
      <parameter type-id='type-id-110' name='format' filepath='../src/keymap.c' line='204' column='1'/>
      <parameter type-id='type-id-111' name='flags' filepath='../src/keymap.c' line='205' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='xkb_keymap_new_from_file' mangled-name='xkb_keymap_new_from_file' filepath='../src/keymap.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_new_from_file@@V_0.5.0' hash='8a381de77f262281'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/keymap.c' line='246' column='1'/>
      <parameter type-id='type-id-82' name='file' filepath='../src/keymap.c' line='247' column='1'/>
      <parameter type-id='type-id-110' name='format' filepath='../src/keymap.c' line='248' column='1'/>
      <parameter type-id='type-id-111' name='flags' filepath='../src/keymap.c' line='249' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='xkb_keymap_get_as_string' mangled-name='xkb_keymap_get_as_string' filepath='../src/keymap.c' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_get_as_string@@V_0.5.0' hash='9748556a946b2b79'>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-110'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='xkb_keymap_num_mods' mangled-name='xkb_keymap_num_mods' filepath='../src/keymap.c' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_num_mods@@V_0.5.0' hash='8d3e8093d8e474e6'>
      <parameter type-id='type-id-76'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='xkb_keymap_mod_get_name' mangled-name='xkb_keymap_mod_get_name' filepath='../src/keymap.c' line='317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_mod_get_name@@V_0.5.0' hash='636cf6f815ddf7f5'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='317' column='1'/>
      <parameter type-id='type-id-6' name='idx' filepath='../src/keymap.c' line='317' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='xkb_keymap_mod_get_index' mangled-name='xkb_keymap_mod_get_index' filepath='../src/keymap.c' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_mod_get_index@@V_0.5.0' hash='20c633a3dac49ccc'>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='xkb_keymap_mod_get_mask' mangled-name='xkb_keymap_mod_get_mask' filepath='../src/keymap.c' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_mod_get_mask@@V_1.10.0' hash='20c633a3dac49ccc'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='341' column='1'/>
      <parameter type-id='type-id-8' name='name' filepath='../src/keymap.c' line='341' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='xkb_keymap_mod_get_mask2' mangled-name='xkb_keymap_mod_get_mask2' filepath='../src/keymap.c' line='353' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_mod_get_mask2@@V_1.11.0' hash='774aacbca7585aa5'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='353' column='1'/>
      <parameter type-id='type-id-6' name='idx' filepath='../src/keymap.c' line='353' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='xkb_keymap_num_layouts' mangled-name='xkb_keymap_num_layouts' filepath='../src/keymap.c' line='364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_num_layouts@@V_0.5.0' hash='8d3e8093d8e474e6'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='364' column='1'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='xkb_keymap_layout_get_name' mangled-name='xkb_keymap_layout_get_name' filepath='../src/keymap.c' line='373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_layout_get_name@@V_0.5.0' hash='636cf6f815ddf7f5'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='373' column='1'/>
      <parameter type-id='type-id-54' name='idx' filepath='../src/keymap.c' line='373' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='xkb_keymap_layout_get_index' mangled-name='xkb_keymap_layout_get_index' filepath='../src/keymap.c' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_layout_get_index@@V_0.5.0' hash='20c633a3dac49ccc'>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='xkb_keymap_num_layouts_for_key' mangled-name='xkb_keymap_num_layouts_for_key' filepath='../src/keymap.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_num_layouts_for_key@@V_0.5.0' hash='774aacbca7585aa5'>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-113'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='xkb_keymap_num_levels_for_key' mangled-name='xkb_keymap_num_levels_for_key' filepath='../src/keymap.c' line='418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_num_levels_for_key@@V_0.5.0' hash='a1523ee7251b5a41'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='418' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/keymap.c' line='418' column='1'/>
      <parameter type-id='type-id-54' name='layout' filepath='../src/keymap.c' line='419' column='1'/>
      <return type-id='type-id-114'/>
    </function-decl>
    <function-decl name='xkb_keymap_num_leds' mangled-name='xkb_keymap_num_leds' filepath='../src/keymap.c' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_num_leds@@V_0.5.0' hash='8d3e8093d8e474e6'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='440' column='1'/>
      <return type-id='type-id-115'/>
    </function-decl>
    <function-decl name='xkb_keymap_led_get_name' mangled-name='xkb_keymap_led_get_name' filepath='../src/keymap.c' line='449' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_led_get_name@@V_0.5.0' hash='636cf6f815ddf7f5'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='449' column='1'/>
      <parameter type-id='type-id-115' name='idx' filepath='../src/keymap.c' line='449' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='xkb_keymap_led_get_index' mangled-name='xkb_keymap_led_get_index' filepath='../src/keymap.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_led_get_index@@V_0.5.0' hash='20c633a3dac49ccc'>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-115'/>
    </function-decl>
    <function-decl name='xkb_keysym_to_lower' mangled-name='xkb_keysym_to_lower' filepath='../src/keysym-case-mappings.c' line='582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keysym_to_lower@@V_0.8.0' hash='0389e499374a3f97'>
      <parameter type-id='type-id-116' name='ks' filepath='../src/keysym-case-mappings.c' line='601' column='1'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='xkb_keysym_to_upper' mangled-name='xkb_keysym_to_upper' filepath='../src/keysym-case-mappings.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keysym_to_upper@@V_0.8.0' hash='0389e499374a3f97'>
      <parameter type-id='type-id-116' name='ks' filepath='../src/keysym-case-mappings.c' line='601' column='1'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='xkb_keysym_to_utf32' mangled-name='xkb_keysym_to_utf32' filepath='../src/keysym-utf.c' line='860' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keysym_to_utf32@@V_0.5.0' hash='0389e499374a3f97'>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='xkb_utf32_to_keysym' mangled-name='xkb_utf32_to_keysym' filepath='../src/keysym-utf.c' line='902' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_utf32_to_keysym@@V_1.0.0' hash='0389e499374a3f97'>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='xkb_keysym_get_name' mangled-name='xkb_keysym_get_name' filepath='../src/keysym.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keysym_get_name@@V_0.5.0' hash='cabd930c42b09bca'>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_keysym_from_name' mangled-name='xkb_keysym_from_name' filepath='../src/keysym.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keysym_from_name@@V_0.5.0' hash='6b69227f77ce5452'>
      <parameter type-id='type-id-8' name='name' filepath='../src/keysym.c' line='237' column='1'/>
      <parameter type-id='type-id-28' name='flags' filepath='../src/keysym.c' line='237' column='1'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='xkb_components_names_from_rules' mangled-name='xkb_components_names_from_rules' filepath='../src/xkbcomp/xkbcomp.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_components_names_from_rules@@V_1.9.0' hash='0758774b13b9c119'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/xkbcomp/xkbcomp.c' line='25' column='1'/>
      <parameter type-id='type-id-97' name='rmlvo_in' filepath='../src/xkbcomp/xkbcomp.c' line='26' column='1'/>
      <parameter type-id='type-id-105' name='rmlvo_out' filepath='../src/xkbcomp/xkbcomp.c' line='27' column='1'/>
      <parameter type-id='type-id-102' name='components_out' filepath='../src/xkbcomp/xkbcomp.c' line='28' column='1'/>
      <return type-id='type-id-117'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-118'/>
    <function-decl name='xkb_keymap_key_get_mods_for_level' mangled-name='xkb_keymap_key_get_mods_for_level' filepath='../src/keymap.c' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_key_get_mods_for_level@@V_1.0.0' hash='00631c91c6e634c5'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='478' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/keymap.c' line='479' column='1'/>
      <parameter type-id='type-id-54' name='layout' filepath='../src/keymap.c' line='480' column='1'/>
      <parameter type-id='type-id-114' name='level' filepath='../src/keymap.c' line='481' column='1'/>
      <parameter type-id='type-id-103' name='masks_out' filepath='../src/keymap.c' line='482' column='1'/>
      <parameter type-id='type-id-112' name='masks_size' filepath='../src/keymap.c' line='483' column='1'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='xkb_keymap_key_get_syms_by_level' mangled-name='xkb_keymap_key_get_syms_by_level' filepath='../src/keymap.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_key_get_syms_by_level@@V_0.5.0' hash='0a1c6626986bd042'>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-114'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_keymap_min_keycode' mangled-name='xkb_keymap_min_keycode' filepath='../src/keymap.c' line='593' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_min_keycode@@V_0.5.0' hash='8d3e8093d8e474e6'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='593' column='1'/>
      <return type-id='type-id-113'/>
    </function-decl>
    <function-decl name='xkb_keymap_max_keycode' mangled-name='xkb_keymap_max_keycode' filepath='../src/keymap.c' line='599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_max_keycode@@V_0.5.0' hash='8d3e8093d8e474e6'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='593' column='1'/>
      <return type-id='type-id-113'/>
    </function-decl>
    <function-decl name='xkb_keymap_key_for_each' mangled-name='xkb_keymap_key_for_each' filepath='../src/keymap.c' line='605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_key_for_each@@V_0.5.0' hash='325104931bfeebf2'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='605' column='1'/>
      <parameter type-id='type-id-81' name='iter' filepath='../src/keymap.c' line='605' column='1'/>
      <parameter type-id='type-id-109' name='data' filepath='../src/keymap.c' line='606' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_keymap_key_get_name' mangled-name='xkb_keymap_key_get_name' filepath='../src/keymap.c' line='615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_key_get_name@@V_0.6.0' hash='636cf6f815ddf7f5'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='615' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/keymap.c' line='615' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='xkb_keymap_key_by_name' mangled-name='xkb_keymap_key_by_name' filepath='../src/keymap.c' line='626' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_key_by_name@@V_0.6.0' hash='20c633a3dac49ccc'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='626' column='1'/>
      <parameter type-id='type-id-8' name='name' filepath='../src/keymap.c' line='626' column='1'/>
      <return type-id='type-id-113'/>
    </function-decl>
    <function-decl name='xkb_keymap_key_repeats' mangled-name='xkb_keymap_key_repeats' filepath='../src/keymap.c' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keymap_key_repeats@@V_0.5.0' hash='1dbcbfa2e644c89d'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/keymap.c' line='652' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/keymap.c' line='652' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_keysym_to_utf8' mangled-name='xkb_keysym_to_utf8' filepath='../src/keysym-utf.c' line='945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_keysym_to_utf8@@V_0.5.0' hash='cabd930c42b09bca'>
      <parameter type-id='type-id-116'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_rmlvo_builder_new' mangled-name='xkb_rmlvo_builder_new' filepath='../src/rmlvo.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_rmlvo_builder_new@@V_1.11.0' hash='4f0765e3d1a41487'>
      <parameter type-id='type-id-66' name='context' filepath='../src/rmlvo.c' line='21' column='1'/>
      <parameter type-id='type-id-8' name='rules' filepath='../src/rmlvo.c' line='22' column='1'/>
      <parameter type-id='type-id-8' name='model' filepath='../src/rmlvo.c' line='22' column='1'/>
      <parameter type-id='type-id-29' name='flags' filepath='../src/rmlvo.c' line='23' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='xkb_rmlvo_builder_append_layout' mangled-name='xkb_rmlvo_builder_append_layout' filepath='../src/rmlvo.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_rmlvo_builder_append_layout@@V_1.11.0' hash='1a98ebab588fc37f'>
      <parameter type-id='type-id-104' name='rmlvo' filepath='../src/rmlvo.c' line='53' column='1'/>
      <parameter type-id='type-id-8' name='layout' filepath='../src/rmlvo.c' line='54' column='1'/>
      <parameter type-id='type-id-8' name='variant' filepath='../src/rmlvo.c' line='54' column='1'/>
      <parameter type-id='type-id-87' name='options' filepath='../src/rmlvo.c' line='55' column='1'/>
      <parameter type-id='type-id-112' name='options_len' filepath='../src/rmlvo.c' line='55' column='1'/>
      <return type-id='type-id-117'/>
    </function-decl>
    <function-decl name='xkb_rmlvo_builder_append_option' mangled-name='xkb_rmlvo_builder_append_option' filepath='../src/rmlvo.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_rmlvo_builder_append_option@@V_1.11.0' hash='9bdbba0253b4c82d'>
      <parameter type-id='type-id-104' name='rmlvo' filepath='../src/rmlvo.c' line='111' column='1'/>
      <parameter type-id='type-id-8' name='option' filepath='../src/rmlvo.c' line='112' column='1'/>
      <return type-id='type-id-117'/>
    </function-decl>
    <function-decl name='xkb_rmlvo_builder_ref' mangled-name='xkb_rmlvo_builder_ref' filepath='../src/rmlvo.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_rmlvo_builder_ref@@V_1.11.0' hash='4eb97cfc98d1184a'>
      <parameter type-id='type-id-104' name='rmlvo' filepath='../src/rmlvo.c' line='141' column='1'/>
      <return type-id='type-id-104'/>
    </function-decl>
    <function-decl name='xkb_rmlvo_builder_unref' mangled-name='xkb_rmlvo_builder_unref' filepath='../src/rmlvo.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_rmlvo_builder_unref@@V_1.11.0' hash='4df83dda2d3407f4'>
      <parameter type-id='type-id-104' name='rmlvo' filepath='../src/rmlvo.c' line='149' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_state_key_get_level' mangled-name='xkb_state_key_get_level' filepath='../src/state.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_key_get_level@@V_0.5.0' hash='26918bd74b0ac834'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='124' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='124' column='1'/>
      <parameter type-id='type-id-54' name='layout' filepath='../src/state.c' line='125' column='1'/>
      <return type-id='type-id-114'/>
    </function-decl>
    <function-decl name='xkb_state_key_get_layout' mangled-name='xkb_state_key_get_layout' filepath='../src/state.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_key_get_layout@@V_0.5.0' hash='140f068fb6cd71bc'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='149' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='149' column='1'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='xkb_state_new' mangled-name='xkb_state_new' filepath='../src/state.c' line='871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_new@@V_0.5.0' hash='468193d741810203'>
      <parameter type-id='type-id-76' name='keymap' filepath='../src/state.c' line='871' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='xkb_state_ref' mangled-name='xkb_state_ref' filepath='../src/state.c' line='884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_ref@@V_0.5.0' hash='6eaa20e189316a3a'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='884' column='1'/>
      <return type-id='type-id-106'/>
    </function-decl>
    <function-decl name='xkb_state_unref' mangled-name='xkb_state_unref' filepath='../src/state.c' line='892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_unref@@V_0.5.0' hash='86bcd8c59ed0fa84'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='892' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_state_get_keymap' mangled-name='xkb_state_get_keymap' filepath='../src/state.c' line='904' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_get_keymap@@V_0.5.0' hash='19c359271cf01d2a'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='904' column='1'/>
      <return type-id='type-id-76'/>
    </function-decl>
    <function-decl name='xkb_state_update_key' mangled-name='xkb_state_update_key' filepath='../src/state.c' line='1050' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_update_key@@V_0.5.0' hash='493be1b933ca0af8'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1050' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='1050' column='1'/>
      <parameter type-id='type-id-27' name='direction' filepath='../src/state.c' line='1051' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='xkb_state_update_latched_locked' mangled-name='xkb_state_update_latched_locked' filepath='../src/state.c' line='1220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_update_latched_locked@@V_1.10.0' hash='568dacb582577f82'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1220' column='1'/>
      <parameter type-id='type-id-55' name='affect_latched_mods' filepath='../src/state.c' line='1221' column='1'/>
      <parameter type-id='type-id-55' name='latched_mods' filepath='../src/state.c' line='1222' column='1'/>
      <parameter type-id='type-id-117' name='affect_latched_layout' filepath='../src/state.c' line='1223' column='1'/>
      <parameter type-id='type-id-53' name='latched_layout' filepath='../src/state.c' line='1224' column='1'/>
      <parameter type-id='type-id-55' name='affect_locked_mods' filepath='../src/state.c' line='1225' column='1'/>
      <parameter type-id='type-id-55' name='locked_mods' filepath='../src/state.c' line='1226' column='1'/>
      <parameter type-id='type-id-117' name='affect_locked_layout' filepath='../src/state.c' line='1227' column='1'/>
      <parameter type-id='type-id-53' name='locked_layout' filepath='../src/state.c' line='1228' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='xkb_state_update_mask' mangled-name='xkb_state_update_mask' filepath='../src/state.c' line='1267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_update_mask@@V_0.5.0' hash='a7aac1c7613cca46'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1267' column='1'/>
      <parameter type-id='type-id-55' name='base_mods' filepath='../src/state.c' line='1268' column='1'/>
      <parameter type-id='type-id-55' name='latched_mods' filepath='../src/state.c' line='1269' column='1'/>
      <parameter type-id='type-id-55' name='locked_mods' filepath='../src/state.c' line='1270' column='1'/>
      <parameter type-id='type-id-54' name='base_group' filepath='../src/state.c' line='1271' column='1'/>
      <parameter type-id='type-id-54' name='latched_group' filepath='../src/state.c' line='1272' column='1'/>
      <parameter type-id='type-id-54' name='locked_group' filepath='../src/state.c' line='1273' column='1'/>
      <return type-id='type-id-119'/>
    </function-decl>
    <function-decl name='xkb_state_key_get_syms' mangled-name='xkb_state_key_get_syms' filepath='../src/state.c' line='1337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_key_get_syms@@V_0.5.0' hash='9c3635851af6af5c'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1337' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='1337' column='1'/>
      <parameter type-id='type-id-17' name='syms_out' filepath='../src/state.c' line='1338' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_key_get_one_sym' mangled-name='xkb_state_key_get_one_sym' filepath='../src/state.c' line='1433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_key_get_one_sym@@V_0.5.0' hash='140f068fb6cd71bc'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1433' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='1433' column='1'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='xkb_state_key_get_utf8' mangled-name='xkb_state_key_get_utf8' filepath='../src/state.c' line='1494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_key_get_utf8@@V_0.5.0' hash='cdf5a0df96069620'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1494' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='1494' column='1'/>
      <parameter type-id='type-id-9' name='buffer' filepath='../src/state.c' line='1495' column='1'/>
      <parameter type-id='type-id-112' name='size' filepath='../src/state.c' line='1495' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_key_get_utf32' mangled-name='xkb_state_key_get_utf32' filepath='../src/state.c' line='1546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_key_get_utf32@@V_0.5.0' hash='140f068fb6cd71bc'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1546' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='1546' column='1'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='xkb_state_serialize_mods' mangled-name='xkb_state_serialize_mods' filepath='../src/state.c' line='1562' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_serialize_mods@@V_0.5.0' hash='dd155c38680ca89e'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1562' column='1'/>
      <parameter type-id='type-id-119' name='type' filepath='../src/state.c' line='1563' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='xkb_state_serialize_layout' mangled-name='xkb_state_serialize_layout' filepath='../src/state.c' line='1585' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_serialize_layout@@V_0.5.0' hash='dd155c38680ca89e'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1585' column='1'/>
      <parameter type-id='type-id-119' name='type' filepath='../src/state.c' line='1586' column='1'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='xkb_state_mod_index_is_active' mangled-name='xkb_state_mod_index_is_active' filepath='../src/state.c' line='1629' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_mod_index_is_active@@V_0.5.0' hash='087eb0b0d457f30d'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1629' column='1'/>
      <parameter type-id='type-id-6' name='idx' filepath='../src/state.c' line='1630' column='1'/>
      <parameter type-id='type-id-119' name='type' filepath='../src/state.c' line='1631' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_mod_indices_are_active' mangled-name='xkb_state_mod_indices_are_active' filepath='../src/state.c' line='1671' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_mod_indices_are_active@@V_0.5.0' hash='3d4883ee9a933044'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1671' column='1'/>
      <parameter type-id='type-id-119' name='type' filepath='../src/state.c' line='1672' column='1'/>
      <parameter type-id='type-id-30' name='match' filepath='../src/state.c' line='1673' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_mod_name_is_active' mangled-name='xkb_state_mod_name_is_active' filepath='../src/state.c' line='1710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_mod_name_is_active@@V_0.5.0' hash='0cae30fc4b1e300d'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1710' column='1'/>
      <parameter type-id='type-id-8' name='name' filepath='../src/state.c' line='1710' column='1'/>
      <parameter type-id='type-id-119' name='type' filepath='../src/state.c' line='1711' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_mod_names_are_active' mangled-name='xkb_state_mod_names_are_active' filepath='../src/state.c' line='1726' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_mod_names_are_active@@V_0.5.0' hash='3d4883ee9a933044'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1671' column='1'/>
      <parameter type-id='type-id-119' name='type' filepath='../src/state.c' line='1672' column='1'/>
      <parameter type-id='type-id-30' name='match' filepath='../src/state.c' line='1673' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_layout_index_is_active' mangled-name='xkb_state_layout_index_is_active' filepath='../src/state.c' line='1765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_layout_index_is_active@@V_0.5.0' hash='087eb0b0d457f30d'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1765' column='1'/>
      <parameter type-id='type-id-54' name='idx' filepath='../src/state.c' line='1766' column='1'/>
      <parameter type-id='type-id-119' name='type' filepath='../src/state.c' line='1767' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_layout_name_is_active' mangled-name='xkb_state_layout_name_is_active' filepath='../src/state.c' line='1790' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_layout_name_is_active@@V_0.5.0' hash='0cae30fc4b1e300d'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1710' column='1'/>
      <parameter type-id='type-id-8' name='name' filepath='../src/state.c' line='1710' column='1'/>
      <parameter type-id='type-id-119' name='type' filepath='../src/state.c' line='1711' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_led_index_is_active' mangled-name='xkb_state_led_index_is_active' filepath='../src/state.c' line='1806' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_led_index_is_active@@V_0.5.0' hash='ae78328375754ef3'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1806' column='1'/>
      <parameter type-id='type-id-115' name='idx' filepath='../src/state.c' line='1806' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_led_name_is_active' mangled-name='xkb_state_led_name_is_active' filepath='../src/state.c' line='1819' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_led_name_is_active@@V_0.5.0' hash='1f3256e71bead28c'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1819' column='1'/>
      <parameter type-id='type-id-8' name='name' filepath='../src/state.c' line='1819' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_mod_index_is_consumed2' mangled-name='xkb_state_mod_index_is_consumed2' filepath='../src/state.c' line='1887' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_mod_index_is_consumed2@@V_0.7.0' hash='7dd768783c1f94ac'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1887' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='1887' column='1'/>
      <parameter type-id='type-id-6' name='idx' filepath='../src/state.c' line='1888' column='1'/>
      <parameter type-id='type-id-25' name='mode' filepath='../src/state.c' line='1889' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_mod_index_is_consumed' mangled-name='xkb_state_mod_index_is_consumed' filepath='../src/state.c' line='1905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_mod_index_is_consumed@@V_0.5.0' hash='d8a2dc1f282da18e'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1905' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='1905' column='1'/>
      <parameter type-id='type-id-6' name='idx' filepath='../src/state.c' line='1906' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_state_mod_mask_remove_consumed' mangled-name='xkb_state_mod_mask_remove_consumed' filepath='../src/state.c' line='1913' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_mod_mask_remove_consumed@@V_0.5.0' hash='26918bd74b0ac834'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1913' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='1913' column='1'/>
      <parameter type-id='type-id-55' name='mask' filepath='../src/state.c' line='1914' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='xkb_state_key_get_consumed_mods2' mangled-name='xkb_state_key_get_consumed_mods2' filepath='../src/state.c' line='1926' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_key_get_consumed_mods2@@V_0.7.0' hash='00e5c3da0b864a80'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1926' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='1926' column='1'/>
      <parameter type-id='type-id-25' name='mode' filepath='../src/state.c' line='1927' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='xkb_state_key_get_consumed_mods' mangled-name='xkb_state_key_get_consumed_mods' filepath='../src/state.c' line='1947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_state_key_get_consumed_mods@@V_0.5.0' hash='140f068fb6cd71bc'>
      <parameter type-id='type-id-106' name='state' filepath='../src/state.c' line='1947' column='1'/>
      <parameter type-id='type-id-113' name='kc' filepath='../src/state.c' line='1947' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-type size-in-bits='64' hash='e35bd9c65cb53349' id='type-id-85'>
      <parameter type-id='type-id-106'/>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-60'/>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-117'/>
    </function-type>
    <function-type size-in-bits='64' hash='d81c54bb35b39c29' id='type-id-100'>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-109'/>
      <return type-id='type-id-18'/>
    </function-type>
    <function-type size-in-bits='64' hash='a0f04773a3f92473' id='type-id-120'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-121'/>
      <return type-id='type-id-18'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-5543' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='type-id-117'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-122'/>
    <array-type-def dimensions='1' type-id='type-id-122' size-in-bits='8192' hash='228e81584cfb686d' id='type-id-123'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='type-id-124'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-122' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='type-id-125'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-126'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-122' size-in-bits='16384' hash='0310f3b158c068da' id='type-id-127'>
      <subrange length='2048' lower-bound='0' upper-bound='2047' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='2d269dd0371d392d' id='type-id-128'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-122' size-in-bits='64' hash='e1c8b625c73024c4' id='type-id-129'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-130'/>
    </array-type-def>
    <enum-decl name='merge_mode' size-in-bits='32' alignment-in-bits='32' filepath='../src/xkbcomp/ast.h' line='82' column='1' hash='7151f3aca950569c' id='type-id-37'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='MERGE_DEFAULT' value='0'/>
      <enumerator name='MERGE_AUGMENT' value='1'/>
      <enumerator name='MERGE_OVERRIDE' value='2'/>
      <enumerator name='MERGE_REPLACE' value='3'/>
    </enum-decl>
    <enum-decl name='mod_type' size-in-bits='32' alignment-in-bits='32' filepath='../src/keymap.h' line='58' column='1' hash='156228d9239ca9fd' id='type-id-131'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='MOD_REAL' value='1'/>
      <enumerator name='MOD_VIRT' value='2'/>
      <enumerator name='MOD_BOTH' value='3'/>
    </enum-decl>
    <enum-decl name='stmt_type' size-in-bits='32' alignment-in-bits='32' filepath='../src/xkbcomp/ast.h' line='41' column='1' hash='546ac9b5504484ad' id='type-id-132'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='STMT_UNKNOWN' value='0'/>
      <enumerator name='STMT_INCLUDE' value='1'/>
      <enumerator name='STMT_KEYCODE' value='2'/>
      <enumerator name='STMT_ALIAS' value='3'/>
      <enumerator name='STMT_EXPR_STRING_LITERAL' value='4'/>
      <enumerator name='STMT_EXPR_INTEGER_LITERAL' value='5'/>
      <enumerator name='STMT_EXPR_FLOAT_LITERAL' value='6'/>
      <enumerator name='STMT_EXPR_BOOLEAN_LITERAL' value='7'/>
      <enumerator name='STMT_EXPR_KEYNAME_LITERAL' value='8'/>
      <enumerator name='STMT_EXPR_KEYSYM_LITERAL' value='9'/>
      <enumerator name='STMT_EXPR_IDENT' value='10'/>
      <enumerator name='STMT_EXPR_ACTION_DECL' value='11'/>
      <enumerator name='STMT_EXPR_FIELD_REF' value='12'/>
      <enumerator name='STMT_EXPR_ARRAY_REF' value='13'/>
      <enumerator name='STMT_EXPR_EMPTY_LIST' value='14'/>
      <enumerator name='STMT_EXPR_KEYSYM_LIST' value='15'/>
      <enumerator name='STMT_EXPR_ACTION_LIST' value='16'/>
      <enumerator name='STMT_EXPR_ADD' value='17'/>
      <enumerator name='STMT_EXPR_SUBTRACT' value='18'/>
      <enumerator name='STMT_EXPR_MULTIPLY' value='19'/>
      <enumerator name='STMT_EXPR_DIVIDE' value='20'/>
      <enumerator name='STMT_EXPR_ASSIGN' value='21'/>
      <enumerator name='STMT_EXPR_NOT' value='22'/>
      <enumerator name='STMT_EXPR_NEGATE' value='23'/>
      <enumerator name='STMT_EXPR_INVERT' value='24'/>
      <enumerator name='STMT_EXPR_UNARY_PLUS' value='25'/>
      <enumerator name='STMT_VAR' value='26'/>
      <enumerator name='STMT_TYPE' value='27'/>
      <enumerator name='STMT_INTERP' value='28'/>
      <enumerator name='STMT_VMOD' value='29'/>
      <enumerator name='STMT_SYMBOLS' value='30'/>
      <enumerator name='STMT_MODMAP' value='31'/>
      <enumerator name='STMT_GROUP_COMPAT' value='32'/>
      <enumerator name='STMT_LED_MAP' value='33'/>
      <enumerator name='STMT_LED_NAME' value='34'/>
      <enumerator name='_STMT_NUM_VALUES' value='35'/>
    </enum-decl>
    <enum-decl name='xkb_action_controls' size-in-bits='32' alignment-in-bits='32' filepath='../src/keymap.h' line='121' column='1' hash='801c50186ca8103f' id='type-id-133'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='CONTROL_REPEAT' value='1'/>
      <enumerator name='CONTROL_SLOW' value='2'/>
      <enumerator name='CONTROL_DEBOUNCE' value='4'/>
      <enumerator name='CONTROL_STICKY' value='8'/>
      <enumerator name='CONTROL_MOUSEKEYS' value='16'/>
      <enumerator name='CONTROL_MOUSEKEYS_ACCEL' value='32'/>
      <enumerator name='CONTROL_AX' value='64'/>
      <enumerator name='CONTROL_AX_TIMEOUT' value='128'/>
      <enumerator name='CONTROL_AX_FEEDBACK' value='256'/>
      <enumerator name='CONTROL_BELL' value='512'/>
      <enumerator name='CONTROL_IGNORE_GROUP_LOCK' value='1024'/>
      <enumerator name='CONTROL_ALL' value='2047'/>
    </enum-decl>
    <enum-decl name='xkb_action_flags' size-in-bits='32' alignment-in-bits='32' filepath='../src/keymap.h' line='105' column='1' hash='2ea9497b09fb7bca' id='type-id-134'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='ACTION_LOCK_CLEAR' value='1'/>
      <enumerator name='ACTION_LATCH_TO_LOCK' value='2'/>
      <enumerator name='ACTION_LOCK_NO_LOCK' value='4'/>
      <enumerator name='ACTION_LOCK_NO_UNLOCK' value='8'/>
      <enumerator name='ACTION_MODS_LOOKUP_MODMAP' value='16'/>
      <enumerator name='ACTION_ABSOLUTE_SWITCH' value='32'/>
      <enumerator name='ACTION_ABSOLUTE_X' value='64'/>
      <enumerator name='ACTION_ABSOLUTE_Y' value='128'/>
      <enumerator name='ACTION_ACCEL' value='256'/>
      <enumerator name='ACTION_SAME_SCREEN' value='512'/>
      <enumerator name='ACTION_LOCK_ON_RELEASE' value='1024'/>
      <enumerator name='ACTION_UNLOCK_ON_PRESS' value='2048'/>
      <enumerator name='ACTION_LATCH_ON_PRESS' value='4096'/>
    </enum-decl>
    <enum-decl name='xkb_action_type' size-in-bits='32' alignment-in-bits='32' filepath='../src/keymap.h' line='82' column='1' hash='d492929076b42a7b' id='type-id-135'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='ACTION_TYPE_NONE' value='0'/>
      <enumerator name='ACTION_TYPE_VOID' value='1'/>
      <enumerator name='ACTION_TYPE_MOD_SET' value='2'/>
      <enumerator name='ACTION_TYPE_MOD_LATCH' value='3'/>
      <enumerator name='ACTION_TYPE_MOD_LOCK' value='4'/>
      <enumerator name='ACTION_TYPE_GROUP_SET' value='5'/>
      <enumerator name='ACTION_TYPE_GROUP_LATCH' value='6'/>
      <enumerator name='ACTION_TYPE_GROUP_LOCK' value='7'/>
      <enumerator name='ACTION_TYPE_PTR_MOVE' value='8'/>
      <enumerator name='ACTION_TYPE_PTR_BUTTON' value='9'/>
      <enumerator name='ACTION_TYPE_PTR_LOCK' value='10'/>
      <enumerator name='ACTION_TYPE_PTR_DEFAULT' value='11'/>
      <enumerator name='ACTION_TYPE_TERMINATE' value='12'/>
      <enumerator name='ACTION_TYPE_SWITCH_VT' value='13'/>
      <enumerator name='ACTION_TYPE_CTRL_SET' value='14'/>
      <enumerator name='ACTION_TYPE_CTRL_LOCK' value='15'/>
      <enumerator name='ACTION_TYPE_UNSUPPORTED_LEGACY' value='16'/>
      <enumerator name='ACTION_TYPE_PRIVATE' value='17'/>
      <enumerator name='ACTION_TYPE_INTERNAL' value='18'/>
      <enumerator name='_ACTION_TYPE_NUM_ENTRIES' value='19'/>
    </enum-decl>
    <enum-decl name='xkb_compose_compile_flags' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon-compose.h' line='120' column='1' hash='b610b02d2eaa0eea' id='type-id-136'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_COMPOSE_COMPILE_NO_FLAGS' value='0'/>
    </enum-decl>
    <enum-decl name='xkb_compose_feed_result' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon-compose.h' line='489' column='1' hash='518e06e132ae9401' id='type-id-137'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_COMPOSE_FEED_IGNORED' value='0'/>
      <enumerator name='XKB_COMPOSE_FEED_ACCEPTED' value='1'/>
    </enum-decl>
    <enum-decl name='xkb_compose_format' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon-compose.h' line='126' column='1' hash='f0042e395f6c889d' id='type-id-138'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_COMPOSE_FORMAT_TEXT_V1' value='1'/>
    </enum-decl>
    <enum-decl name='xkb_compose_state_flags' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon-compose.h' line='420' column='1' hash='31a755fc8b4f6325' id='type-id-139'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_COMPOSE_STATE_NO_FLAGS' value='0'/>
    </enum-decl>
    <enum-decl name='xkb_compose_status' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon-compose.h' line='477' column='1' hash='f4efe61be2b5a41f' id='type-id-140'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_COMPOSE_NOTHING' value='0'/>
      <enumerator name='XKB_COMPOSE_COMPOSING' value='1'/>
      <enumerator name='XKB_COMPOSE_COMPOSED' value='2'/>
      <enumerator name='XKB_COMPOSE_CANCELLED' value='3'/>
    </enum-decl>
    <enum-decl name='xkb_explicit_components' size-in-bits='32' alignment-in-bits='32' filepath='../src/keymap.h' line='302' column='1' hash='954cae3ebb426e4d' id='type-id-141'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='EXPLICIT_SYMBOLS' value='1'/>
      <enumerator name='EXPLICIT_INTERP' value='2'/>
      <enumerator name='EXPLICIT_TYPES' value='4'/>
      <enumerator name='EXPLICIT_VMODMAP' value='8'/>
      <enumerator name='EXPLICIT_REPEAT' value='16'/>
    </enum-decl>
    <enum-decl name='xkb_file_type' size-in-bits='32' alignment-in-bits='32' filepath='../src/xkbcomp/ast.h' line='19' column='1' hash='d9d932bff9b287a9' id='type-id-142'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='FILE_TYPE_KEYCODES' value='0'/>
      <enumerator name='FILE_TYPE_TYPES' value='1'/>
      <enumerator name='FILE_TYPE_COMPAT' value='2'/>
      <enumerator name='FILE_TYPE_SYMBOLS' value='3'/>
      <enumerator name='FILE_TYPE_GEOMETRY' value='4'/>
      <enumerator name='FILE_TYPE_KEYMAP' value='5'/>
      <enumerator name='FILE_TYPE_RULES' value='6'/>
      <enumerator name='_FILE_TYPE_NUM_ENTRIES' value='7'/>
    </enum-decl>
    <enum-decl name='xkb_internal_action_flags' size-in-bits='32' alignment-in-bits='32' filepath='../src/keymap.h' line='202' column='1' hash='92e7702f87777cd1' id='type-id-143'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='INTERNAL_BREAKS_GROUP_LATCH' value='1'/>
      <enumerator name='INTERNAL_BREAKS_MOD_LATCH' value='2'/>
    </enum-decl>
    <enum-decl name='xkb_keymap_compile_flags' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='1055' column='1' hash='ce40338596c30c72' id='type-id-111'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_KEYMAP_COMPILE_NO_FLAGS' value='0'/>
    </enum-decl>
    <enum-decl name='xkb_keymap_format' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='1137' column='1' hash='d670b1519521f2a8' id='type-id-110'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_KEYMAP_FORMAT_TEXT_V1' value='1'/>
      <enumerator name='XKB_KEYMAP_FORMAT_TEXT_V2' value='2'/>
    </enum-decl>
    <enum-decl name='xkb_log_level' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='956' column='1' hash='67c6b95f0a6fd320' id='type-id-108'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_LOG_LEVEL_CRITICAL' value='10'/>
      <enumerator name='XKB_LOG_LEVEL_ERROR' value='20'/>
      <enumerator name='XKB_LOG_LEVEL_WARNING' value='30'/>
      <enumerator name='XKB_LOG_LEVEL_INFO' value='40'/>
      <enumerator name='XKB_LOG_LEVEL_DEBUG' value='50'/>
    </enum-decl>
    <enum-decl name='xkb_map_flags' size-in-bits='32' alignment-in-bits='32' filepath='../src/xkbcomp/ast.h' line='292' column='1' hash='389ed4d307327f74' id='type-id-144'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='MAP_IS_DEFAULT' value='1'/>
      <enumerator name='MAP_IS_PARTIAL' value='2'/>
      <enumerator name='MAP_IS_HIDDEN' value='4'/>
      <enumerator name='MAP_HAS_ALPHANUMERIC' value='8'/>
      <enumerator name='MAP_HAS_MODIFIER' value='16'/>
      <enumerator name='MAP_HAS_KEYPAD' value='32'/>
      <enumerator name='MAP_HAS_FN' value='64'/>
      <enumerator name='MAP_IS_ALTGR' value='128'/>
    </enum-decl>
    <enum-decl name='xkb_match_operation' size-in-bits='32' alignment-in-bits='32' filepath='../src/keymap.h' line='140' column='1' hash='343a5ba86ee445a5' id='type-id-145'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='MATCH_NONE' value='0'/>
      <enumerator name='MATCH_ANY_OR_NONE' value='1'/>
      <enumerator name='MATCH_ANY' value='2'/>
      <enumerator name='MATCH_ALL' value='3'/>
      <enumerator name='MATCH_EXACTLY' value='4'/>
    </enum-decl>
    <enum-decl name='xkb_range_exceed_type' size-in-bits='32' alignment-in-bits='32' filepath='../src/keymap.h' line='296' column='1' hash='df830feaa3c41871' id='type-id-146'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='RANGE_WRAP' value='0'/>
      <enumerator name='RANGE_SATURATE' value='1'/>
      <enumerator name='RANGE_REDIRECT' value='2'/>
    </enum-decl>
    <enum-decl name='xkb_state_component' size-in-bits='32' alignment-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='1798' column='1' hash='2569762e59ac0297' id='type-id-119'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='XKB_STATE_MODS_DEPRESSED' value='1'/>
      <enumerator name='XKB_STATE_MODS_LATCHED' value='2'/>
      <enumerator name='XKB_STATE_MODS_LOCKED' value='4'/>
      <enumerator name='XKB_STATE_MODS_EFFECTIVE' value='8'/>
      <enumerator name='XKB_STATE_LAYOUT_DEPRESSED' value='16'/>
      <enumerator name='XKB_STATE_LAYOUT_LATCHED' value='32'/>
      <enumerator name='XKB_STATE_LAYOUT_LOCKED' value='64'/>
      <enumerator name='XKB_STATE_LAYOUT_EFFECTIVE' value='128'/>
      <enumerator name='XKB_STATE_LEDS' value='256'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-47'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-78'/>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='type-id-147'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-148'/>
    <class-decl name='ActionsInfo' is-struct='yes' naming-typedef-id='type-id-149' visibility='default' size-in-bits='2432' filepath='../src/xkbcomp/action.h' line='17' column='1' hash='769c12a5ea796538' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='actions' type-id='type-id-151' visibility='default' filepath='../src/xkbcomp/action.h' line='18' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprAction' is-struct='yes' naming-typedef-id='type-id-152' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='177' column='1' hash='d9e4ec274188986d' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='args' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='180' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprActionList' is-struct='yes' naming-typedef-id='type-id-154' visibility='default' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='183' column='1' hash='45b746bf7280d700' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='actions' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprArrayRef' is-struct='yes' naming-typedef-id='type-id-156' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='170' column='1' hash='99a0516a5457616e' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='element' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='field' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='entry' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprBinary' is-struct='yes' naming-typedef-id='type-id-158' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='153' column='1' hash='ff88d9d83dc7bfda' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='left' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='right' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprBoolean' is-struct='yes' naming-typedef-id='type-id-160' visibility='default' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='125' column='1' hash='8e8646f5b633e57b' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-117' visibility='default' filepath='../src/xkbcomp/ast.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprFieldRef' is-struct='yes' naming-typedef-id='type-id-162' visibility='default' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='164' column='1' hash='00fe427a4de67179' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='element' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='field' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='167' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprIdent' is-struct='yes' naming-typedef-id='type-id-164' visibility='default' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='115' column='1' hash='3b1f5090be198a3c' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ident' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='117' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprInteger' is-struct='yes' naming-typedef-id='type-id-166' visibility='default' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='130' column='1' hash='1a620145a436e830' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ival' type-id='type-id-4' visibility='default' filepath='../src/xkbcomp/ast.h' line='132' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprKeyName' is-struct='yes' naming-typedef-id='type-id-168' visibility='default' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='141' column='1' hash='aa0c036c1b28d700' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key_name' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='143' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprKeySym' is-struct='yes' naming-typedef-id='type-id-170' visibility='default' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='146' column='1' hash='91af568d3bc8f37b' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='keysym' type-id='type-id-116' visibility='default' filepath='../src/xkbcomp/ast.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprKeysymList' is-struct='yes' naming-typedef-id='type-id-172' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='189' column='1' hash='f9fad6dc8c59f000' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='syms' type-id='type-id-174' visibility='default' filepath='../src/xkbcomp/ast.h' line='192' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprString' is-struct='yes' naming-typedef-id='type-id-175' visibility='default' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='120' column='1' hash='c1f98dcc7339f35b' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='str' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ExprUnary' is-struct='yes' naming-typedef-id='type-id-177' visibility='default' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='159' column='1' hash='926b9f3a0c18f1d8' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='child' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='161' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='LookupEntry' is-struct='yes' naming-typedef-id='type-id-179' visibility='default' size-in-bits='128' filepath='../src/text.h' line='15' column='1' hash='38ff78c6a8409df3' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-8' visibility='default' filepath='../src/text.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-61' visibility='default' filepath='../src/text.h' line='17' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='VarDef' is-struct='yes' naming-typedef-id='type-id-181' visibility='default' size-in-bits='320' filepath='../src/xkbcomp/ast.h' line='212' column='1' hash='9c292340159c987c' id='type-id-182'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='value' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='XkbFile' is-struct='yes' naming-typedef-id='type-id-183' visibility='default' size-in-bits='384' filepath='../src/xkbcomp/ast.h' line='303' column='1' hash='14b434f1a578efb4' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='file_type' type-id='type-id-142' visibility='default' filepath='../src/xkbcomp/ast.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='type-id-9' visibility='default' filepath='../src/xkbcomp/ast.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='defs' type-id='type-id-185' visibility='default' filepath='../src/xkbcomp/ast.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='flags' type-id='type-id-144' visibility='default' filepath='../src/xkbcomp/ast.h' line='308' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1' hash='dedab36ee0ea6582' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-9' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-187' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-188' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_short_backupbuf' type-id='type-id-125' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-48' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-148' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-125' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-190' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-191' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-192' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-193' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-188' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-109' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='type-id-194' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused3' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_total_written' type-id='type-id-195' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_unused2' type-id='type-id-129' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IncludeStmt' is-struct='yes' visibility='default' size-in-bits='512' filepath='../src/xkbcomp/ast.h' line='103' column='1' hash='edc249bfadf7e241' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stmt' type-id='type-id-9' visibility='default' filepath='../src/xkbcomp/ast.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='file' type-id='type-id-9' visibility='default' filepath='../src/xkbcomp/ast.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='map' type-id='type-id-9' visibility='default' filepath='../src/xkbcomp/ast.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='modifier' type-id='type-id-9' visibility='default' filepath='../src/xkbcomp/ast.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='next_incl' type-id='type-id-197' visibility='default' filepath='../src/xkbcomp/ast.h' line='110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_ParseCommon' is-struct='yes' visibility='default' size-in-bits='128' filepath='../src/xkbcomp/ast.h' line='98' column='1' hash='097f896ade4427ed' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-199' visibility='default' filepath='../src/xkbcomp/ast.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-132' visibility='default' filepath='../src/xkbcomp/ast.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-109' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='atom_table' is-struct='yes' visibility='default' size-in-bits='256' filepath='../src/atom.c' line='42' column='1' hash='ff47d6ea0304728d' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index' type-id='type-id-202' visibility='default' filepath='../src/atom.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='index_size' type-id='type-id-112' visibility='default' filepath='../src/atom.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='strings' type-id='type-id-203' visibility='default' filepath='../src/atom.c' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='compose_node' is-struct='yes' visibility='default' size-in-bits='160' filepath='../src/compose/table.h' line='65' column='1' hash='0038eec59fae7ead' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keysym' type-id='type-id-116' visibility='default' filepath='../src/compose/table.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='lokid' type-id='type-id-61' visibility='default' filepath='../src/compose/table.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hikid' type-id='type-id-61' visibility='default' filepath='../src/compose/table.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='' type-id='type-id-205' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='darray_char' is-struct='yes' naming-typedef-id='type-id-206' visibility='default' size-in-bits='128' filepath='../src/darray.h' line='63' column='1' hash='09f5298155661a11' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='item' type-id='type-id-9' visibility='default' filepath='../src/darray.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-70' visibility='default' filepath='../src/darray.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alloc' type-id='type-id-70' visibility='default' filepath='../src/darray.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='scanner' is-struct='yes' visibility='default' size-in-bits='8896' filepath='../src/scanner-utils.h' line='55' column='1' hash='351ab4717045088a' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='type-id-8' visibility='default' filepath='../src/scanner-utils.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pos' type-id='type-id-112' visibility='default' filepath='../src/scanner-utils.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-112' visibility='default' filepath='../src/scanner-utils.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='buf' type-id='type-id-123' visibility='default' filepath='../src/scanner-utils.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='buf_pos' type-id='type-id-112' visibility='default' filepath='../src/scanner-utils.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='token_pos' type-id='type-id-112' visibility='default' filepath='../src/scanner-utils.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='cached_pos' type-id='type-id-112' visibility='default' filepath='../src/scanner-utils.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='cached_loc' type-id='type-id-209' visibility='default' filepath='../src/scanner-utils.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='file_name' type-id='type-id-8' visibility='default' filepath='../src/scanner-utils.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='ctx' type-id='type-id-66' visibility='default' filepath='../src/scanner-utils.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='priv' type-id='type-id-109' visibility='default' filepath='../src/scanner-utils.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='scanner_loc' is-struct='yes' visibility='default' size-in-bits='128' filepath='../src/scanner-utils.h' line='51' column='1' hash='d22cf8adad15372c' id='type-id-209'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='line' type-id='type-id-112' visibility='default' filepath='../src/scanner-utils.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='column' type-id='type-id-112' visibility='default' filepath='../src/scanner-utils.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_component_names' is-struct='yes' visibility='default' size-in-bits='320' filepath='../include/xkbcommon/xkbcommon.h' line='513' column='1' hash='81ecbeb0e06835cb' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keycodes' type-id='type-id-9' visibility='default' filepath='../include/xkbcommon/xkbcommon.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='compatibility' type-id='type-id-9' visibility='default' filepath='../include/xkbcommon/xkbcommon.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='geometry' type-id='type-id-9' visibility='default' filepath='../include/xkbcommon/xkbcommon.h' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='symbols' type-id='type-id-9' visibility='default' filepath='../include/xkbcommon/xkbcommon.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='types' type-id='type-id-9' visibility='default' filepath='../include/xkbcommon/xkbcommon.h' line='518' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_compose_state' is-struct='yes' visibility='default' size-in-bits='192' filepath='../src/compose/state.c' line='14' column='1' hash='0c2d0ec744b39da9' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcnt' type-id='type-id-47' visibility='default' filepath='../src/compose/state.c' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-139' visibility='default' filepath='../src/compose/state.c' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='table' type-id='type-id-211' visibility='default' filepath='../src/compose/state.c' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prev_context' type-id='type-id-61' visibility='default' filepath='../src/compose/state.c' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='context' type-id='type-id-61' visibility='default' filepath='../src/compose/state.c' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_compose_table' is-struct='yes' visibility='default' size-in-bits='512' filepath='../src/compose/table.h' line='93' column='1' hash='b49963e85d3f596c' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcnt' type-id='type-id-47' visibility='default' filepath='../src/compose/table.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='format' type-id='type-id-138' visibility='default' filepath='../src/compose/table.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='type-id-136' visibility='default' filepath='../src/compose/table.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctx' type-id='type-id-66' visibility='default' filepath='../src/compose/table.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='locale' type-id='type-id-9' visibility='default' filepath='../src/compose/table.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='utf8' type-id='type-id-206' visibility='default' filepath='../src/compose/table.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nodes' type-id='type-id-213' visibility='default' filepath='../src/compose/table.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_compose_table_entry' is-struct='yes' visibility='default' size-in-bits='256' filepath='../src/compose/table.h' line='105' column='1' hash='e9226f28404dc7f6' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sequence' type-id='type-id-215' visibility='default' filepath='../src/compose/table.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sequence_length' type-id='type-id-112' visibility='default' filepath='../src/compose/table.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='keysym' type-id='type-id-116' visibility='default' filepath='../src/compose/table.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='utf8' type-id='type-id-8' visibility='default' filepath='../src/compose/table.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_compose_table_iterator' is-struct='yes' visibility='default' size-in-bits='448' filepath='../src/compose/table.c' line='246' column='1' hash='abe8ac8f78d5b025' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='table' type-id='type-id-211' visibility='default' filepath='../src/compose/table.c' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entry' type-id='type-id-214' visibility='default' filepath='../src/compose/table.c' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pending_nodes' type-id='type-id-217' visibility='default' filepath='../src/compose/table.c' line='251' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_compose_table_iterator_pending_node' is-struct='yes' visibility='default' size-in-bits='32' filepath='../src/compose/table.c' line='241' column='1' hash='d73c7b89362ac016' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='type-id-61' visibility='default' filepath='../src/compose/table.c' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='processed' type-id='type-id-117' visibility='default' filepath='../src/compose/table.c' line='243' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_context' is-struct='yes' visibility='default' size-in-bits='17472' filepath='../src/context.h' line='20' column='1' hash='1d598b6fd5f01af9' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='refcnt' type-id='type-id-47' visibility='default' filepath='../src/context.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='log_fn' type-id='type-id-107' visibility='default' filepath='../src/context.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='log_level' type-id='type-id-108' visibility='default' filepath='../src/context.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='log_verbosity' type-id='type-id-47' visibility='default' filepath='../src/context.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='user_data' type-id='type-id-109' visibility='default' filepath='../src/context.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='names_dflt' type-id='type-id-95' visibility='default' filepath='../src/context.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='includes' type-id='type-id-203' visibility='default' filepath='../src/context.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='failed_includes' type-id='type-id-203' visibility='default' filepath='../src/context.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='atom_table' type-id='type-id-220' visibility='default' filepath='../src/context.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='x11_atom_cache' type-id='type-id-109' visibility='default' filepath='../src/context.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='text_buffer' type-id='type-id-127' visibility='default' filepath='../src/context.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17344'>
        <var-decl name='text_next' type-id='type-id-112' visibility='default' filepath='../src/context.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17408'>
        <var-decl name='use_environment_names' type-id='type-id-79' visibility='default' filepath='../src/context.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17409'>
        <var-decl name='use_secure_getenv' type-id='type-id-79' visibility='default' filepath='../src/context.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_controls_action' is-struct='yes' visibility='default' size-in-bits='96' filepath='../src/keymap.h' line='165' column='1' hash='2f6d78b809737aec' id='type-id-221'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-135' visibility='default' filepath='../src/keymap.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-134' visibility='default' filepath='../src/keymap.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctrls' type-id='type-id-133' visibility='default' filepath='../src/keymap.h' line='168' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_group' is-struct='yes' visibility='default' size-in-bits='192' filepath='../src/keymap.h' line='342' column='1' hash='dabe68a86e8600ff' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='explicit_actions' type-id='type-id-117' visibility='default' filepath='../src/keymap.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='explicit_type' type-id='type-id-117' visibility='default' filepath='../src/keymap.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-223' visibility='default' filepath='../src/keymap.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='levels' type-id='type-id-224' visibility='default' filepath='../src/keymap.h' line='361' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_group_action' is-struct='yes' visibility='default' size-in-bits='96' filepath='../src/keymap.h' line='159' column='1' hash='e8cfcd0ea944f83a' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-135' visibility='default' filepath='../src/keymap.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-134' visibility='default' filepath='../src/keymap.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='group' type-id='type-id-53' visibility='default' filepath='../src/keymap.h' line='162' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_internal_action' is-struct='yes' visibility='default' size-in-bits='96' filepath='../src/keymap.h' line='208' column='1' hash='ab7ed89479ee3cea' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-135' visibility='default' filepath='../src/keymap.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-143' visibility='default' filepath='../src/keymap.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='type-id-227' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_key' is-struct='yes' visibility='default' size-in-bits='384' filepath='../src/keymap.h' line='364' column='1' hash='c5f373550a75715f' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='keycode' type-id='type-id-113' visibility='default' filepath='../src/keymap.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='type-id-38' visibility='default' filepath='../src/keymap.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='explicit' type-id='type-id-141' visibility='default' filepath='../src/keymap.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='modmap' type-id='type-id-55' visibility='default' filepath='../src/keymap.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vmodmap' type-id='type-id-55' visibility='default' filepath='../src/keymap.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='repeats' type-id='type-id-117' visibility='default' filepath='../src/keymap.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='out_of_range_group_action' type-id='type-id-146' visibility='default' filepath='../src/keymap.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='out_of_range_group_number' type-id='type-id-54' visibility='default' filepath='../src/keymap.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='num_groups' type-id='type-id-54' visibility='default' filepath='../src/keymap.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='groups' type-id='type-id-228' visibility='default' filepath='../src/keymap.h' line='379' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_key_alias' is-struct='yes' visibility='default' size-in-bits='64' filepath='../src/keymap.h' line='274' column='1' hash='838bb46cbe279546' id='type-id-229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='real' type-id='type-id-38' visibility='default' filepath='../src/keymap.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='alias' type-id='type-id-38' visibility='default' filepath='../src/keymap.h' line='276' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_key_type' is-struct='yes' visibility='default' size-in-bits='384' filepath='../src/keymap.h' line='236' column='1' hash='3859ff55fa1215d3' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-38' visibility='default' filepath='../src/keymap.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mods' type-id='type-id-231' visibility='default' filepath='../src/keymap.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='num_levels' type-id='type-id-114' visibility='default' filepath='../src/keymap.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='num_level_names' type-id='type-id-114' visibility='default' filepath='../src/keymap.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='level_names' type-id='type-id-202' visibility='default' filepath='../src/keymap.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='num_entries' type-id='type-id-70' visibility='default' filepath='../src/keymap.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='entries' type-id='type-id-232' visibility='default' filepath='../src/keymap.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_key_type_entry' is-struct='yes' visibility='default' size-in-bits='160' filepath='../src/keymap.h' line='230' column='1' hash='526a26a57b219201' id='type-id-233'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='level' type-id='type-id-114' visibility='default' filepath='../src/keymap.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mods' type-id='type-id-231' visibility='default' filepath='../src/keymap.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='preserve' type-id='type-id-231' visibility='default' filepath='../src/keymap.h' line='233' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_keymap' is-struct='yes' visibility='default' size-in-bits='11456' filepath='../src/keymap.h' line='425' column='1' hash='347828295c714190' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='type-id-66' visibility='default' filepath='../src/keymap.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='refcnt' type-id='type-id-47' visibility='default' filepath='../src/keymap.h' line='428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-111' visibility='default' filepath='../src/keymap.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='format' type-id='type-id-110' visibility='default' filepath='../src/keymap.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='enabled_ctrls' type-id='type-id-133' visibility='default' filepath='../src/keymap.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='min_key_code' type-id='type-id-113' visibility='default' filepath='../src/keymap.h' line='434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='max_key_code' type-id='type-id-113' visibility='default' filepath='../src/keymap.h' line='435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='keys' type-id='type-id-234' visibility='default' filepath='../src/keymap.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_key_aliases' type-id='type-id-70' visibility='default' filepath='../src/keymap.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='key_aliases' type-id='type-id-235' visibility='default' filepath='../src/keymap.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='types' type-id='type-id-236' visibility='default' filepath='../src/keymap.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='num_types' type-id='type-id-70' visibility='default' filepath='../src/keymap.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='num_sym_interprets' type-id='type-id-70' visibility='default' filepath='../src/keymap.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sym_interprets' type-id='type-id-237' visibility='default' filepath='../src/keymap.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='mods' type-id='type-id-238' visibility='default' filepath='../src/keymap.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='canonical_state_mask' type-id='type-id-55' visibility='default' filepath='../src/keymap.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3808'>
        <var-decl name='num_groups' type-id='type-id-54' visibility='default' filepath='../src/keymap.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='num_group_names' type-id='type-id-54' visibility='default' filepath='../src/keymap.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='group_names' type-id='type-id-202' visibility='default' filepath='../src/keymap.h' line='486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='leds' type-id='type-id-239' visibility='default' filepath='../src/keymap.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11136'>
        <var-decl name='num_leds' type-id='type-id-115' visibility='default' filepath='../src/keymap.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11200'>
        <var-decl name='keycodes_section_name' type-id='type-id-9' visibility='default' filepath='../src/keymap.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11264'>
        <var-decl name='symbols_section_name' type-id='type-id-9' visibility='default' filepath='../src/keymap.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11328'>
        <var-decl name='types_section_name' type-id='type-id-9' visibility='default' filepath='../src/keymap.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11392'>
        <var-decl name='compat_section_name' type-id='type-id-9' visibility='default' filepath='../src/keymap.h' line='494' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_led' is-struct='yes' visibility='default' size-in-bits='224' filepath='../src/keymap.h' line='265' column='1' hash='c71c9ae2534b0edc' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-38' visibility='default' filepath='../src/keymap.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='which_groups' type-id='type-id-119' visibility='default' filepath='../src/keymap.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='groups' type-id='type-id-241' visibility='default' filepath='../src/keymap.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='which_mods' type-id='type-id-119' visibility='default' filepath='../src/keymap.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mods' type-id='type-id-231' visibility='default' filepath='../src/keymap.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ctrls' type-id='type-id-133' visibility='default' filepath='../src/keymap.h' line='271' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_level' is-struct='yes' visibility='default' size-in-bits='256' filepath='../src/keymap.h' line='314' column='1' hash='a0af1c5b4184f687' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_syms' type-id='type-id-242' visibility='default' filepath='../src/keymap.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='num_actions' type-id='type-id-243' visibility='default' filepath='../src/keymap.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='' type-id='type-id-244' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s' type-id='type-id-245' visibility='default' filepath='../src/keymap.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='a' type-id='type-id-246' visibility='default' filepath='../src/keymap.h' line='336' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_mod' is-struct='yes' visibility='default' size-in-bits='96' filepath='../src/keymap.h' line='382' column='1' hash='0437814823e910f0' id='type-id-247'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-38' visibility='default' filepath='../src/keymap.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='type' type-id='type-id-131' visibility='default' filepath='../src/keymap.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mapping' type-id='type-id-55' visibility='default' filepath='../src/keymap.h' line='385' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_mod_action' is-struct='yes' visibility='default' size-in-bits='128' filepath='../src/keymap.h' line='153' column='1' hash='9472b8e3c5d984d5' id='type-id-248'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-135' visibility='default' filepath='../src/keymap.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-134' visibility='default' filepath='../src/keymap.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mods' type-id='type-id-231' visibility='default' filepath='../src/keymap.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_mod_set' is-struct='yes' visibility='default' size-in-bits='3136' filepath='../src/keymap.h' line='388' column='1' hash='d8a75d6d65eafbfa' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mods' type-id='type-id-249' visibility='default' filepath='../src/keymap.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='num_mods' type-id='type-id-6' visibility='default' filepath='../src/keymap.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='explicit_vmods' type-id='type-id-55' visibility='default' filepath='../src/keymap.h' line='391' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_mods' is-struct='yes' visibility='default' size-in-bits='64' filepath='../src/keymap.h' line='148' column='1' hash='ea72edad21aa7b93' id='type-id-231'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mods' type-id='type-id-55' visibility='default' filepath='../src/keymap.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mask' type-id='type-id-55' visibility='default' filepath='../src/keymap.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_pointer_action' is-struct='yes' visibility='default' size-in-bits='96' filepath='../src/keymap.h' line='183' column='1' hash='baa3bb5109433b15' id='type-id-250'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-135' visibility='default' filepath='../src/keymap.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-134' visibility='default' filepath='../src/keymap.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='x' type-id='type-id-31' visibility='default' filepath='../src/keymap.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='y' type-id='type-id-31' visibility='default' filepath='../src/keymap.h' line='187' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_pointer_button_action' is-struct='yes' visibility='default' size-in-bits='96' filepath='../src/keymap.h' line='190' column='1' hash='cfa3572a3104194a' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-135' visibility='default' filepath='../src/keymap.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-134' visibility='default' filepath='../src/keymap.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='count' type-id='type-id-252' visibility='default' filepath='../src/keymap.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='button' type-id='type-id-252' visibility='default' filepath='../src/keymap.h' line='194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_pointer_default_action' is-struct='yes' visibility='default' size-in-bits='96' filepath='../src/keymap.h' line='171' column='1' hash='62f4842b847f6eae' id='type-id-253'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-135' visibility='default' filepath='../src/keymap.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-134' visibility='default' filepath='../src/keymap.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='type-id-254' visibility='default' filepath='../src/keymap.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_private_action' is-struct='yes' visibility='default' size-in-bits='96' filepath='../src/keymap.h' line='197' column='1' hash='27f7f14bac0e040f' id='type-id-255'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-135' visibility='default' filepath='../src/keymap.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='data' type-id='type-id-256' visibility='default' filepath='../src/keymap.h' line='199' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_rule_names' is-struct='yes' visibility='default' size-in-bits='320' filepath='../include/xkbcommon/xkbcommon.h' line='434' column='1' hash='4d64997ee275ed70' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rules' type-id='type-id-8' visibility='default' filepath='../include/xkbcommon/xkbcommon.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='model' type-id='type-id-8' visibility='default' filepath='../include/xkbcommon/xkbcommon.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='layout' type-id='type-id-8' visibility='default' filepath='../include/xkbcommon/xkbcommon.h' line='460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='variant' type-id='type-id-8' visibility='default' filepath='../include/xkbcommon/xkbcommon.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='options' type-id='type-id-8' visibility='default' filepath='../include/xkbcommon/xkbcommon.h' line='498' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_switch_screen_action' is-struct='yes' visibility='default' size-in-bits='96' filepath='../src/keymap.h' line='177' column='1' hash='db4510142d3a14e6' id='type-id-257'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-135' visibility='default' filepath='../src/keymap.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='type-id-134' visibility='default' filepath='../src/keymap.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='screen' type-id='type-id-254' visibility='default' filepath='../src/keymap.h' line='180' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='xkb_sym_interpret' is-struct='yes' visibility='default' size-in-bits='320' filepath='../src/keymap.h' line='249' column='1' hash='0361df0a8ddc7da0' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sym' type-id='type-id-116' visibility='default' filepath='../src/keymap.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='match' type-id='type-id-145' visibility='default' filepath='../src/keymap.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mods' type-id='type-id-55' visibility='default' filepath='../src/keymap.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='virtual_mod' type-id='type-id-6' visibility='default' filepath='../src/keymap.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='level_one_only' type-id='type-id-117' visibility='default' filepath='../src/keymap.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='repeat' type-id='type-id-117' visibility='default' filepath='../src/keymap.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='num_actions' type-id='type-id-243' visibility='default' filepath='../src/keymap.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='a' type-id='type-id-246' visibility='default' filepath='../src/keymap.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../src/atom.c' line='45' column='1' hash='18b7ff58a7feaead#6' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='item' type-id='type-id-259' visibility='default' filepath='../src/atom.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-70' visibility='default' filepath='../src/atom.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alloc' type-id='type-id-70' visibility='default' filepath='../src/atom.c' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../src/compose/table.h' line='102' column='1' hash='1e5152ce063da13f#7' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='item' type-id='type-id-260' visibility='default' filepath='../src/compose/table.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-70' visibility='default' filepath='../src/compose/table.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alloc' type-id='type-id-70' visibility='default' filepath='../src/compose/table.h' line='102' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../src/compose/table.h' line='78' column='1' hash='45d01c2b9f018b18#8' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_pad' type-id='type-id-61' visibility='default' filepath='../src/compose/table.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='is_leaf' type-id='type-id-117' visibility='default' filepath='../src/compose/table.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='eqkid' type-id='type-id-61' visibility='default' filepath='../src/compose/table.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='../src/compose/table.h' line='74' column='1' hash='0b0030e066d854c2#9' id='type-id-262'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_pad' type-id='type-id-61' visibility='default' filepath='../src/compose/table.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='is_leaf' type-id='type-id-117' visibility='default' filepath='../src/compose/table.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../src/compose/table.h' line='84' column='1' hash='e7cbe97a52857af4#10' id='type-id-263'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='utf8' type-id='type-id-61' visibility='default' filepath='../src/compose/table.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='is_leaf' type-id='type-id-117' visibility='default' filepath='../src/compose/table.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='keysym' type-id='type-id-116' visibility='default' filepath='../src/compose/table.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../src/compose/table.c' line='251' column='1' hash='d63199862ce6398b#11' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='item' type-id='type-id-264' visibility='default' filepath='../src/compose/table.c' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-70' visibility='default' filepath='../src/compose/table.c' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alloc' type-id='type-id-70' visibility='default' filepath='../src/compose/table.c' line='251' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../src/xkbcomp/ast.h' line='192' column='1' hash='523f7d2086caa9db#13' id='type-id-174'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='item' type-id='type-id-215' visibility='default' filepath='../src/xkbcomp/ast.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-70' visibility='default' filepath='../src/xkbcomp/ast.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='alloc' type-id='type-id-70' visibility='default' filepath='../src/xkbcomp/ast.h' line='192' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ActionsInfo' type-id='type-id-150' size-in-bits='2432' filepath='../src/xkbcomp/action.h' line='19' column='1' id='type-id-149'/>
    <typedef-decl name='ExprAction' type-id='type-id-153' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='181' column='1' id='type-id-152'/>
    <typedef-decl name='ExprActionList' type-id='type-id-155' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='187' column='1' id='type-id-154'/>
    <typedef-decl name='ExprArrayRef' type-id='type-id-157' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='175' column='1' id='type-id-156'/>
    <typedef-decl name='ExprBinary' type-id='type-id-159' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='157' column='1' id='type-id-158'/>
    <typedef-decl name='ExprBoolean' type-id='type-id-161' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='128' column='1' id='type-id-160'/>
    <typedef-decl name='ExprDef' type-id='type-id-265' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='113' column='1' id='type-id-266'/>
    <typedef-decl name='ExprFieldRef' type-id='type-id-163' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='168' column='1' id='type-id-162'/>
    <typedef-decl name='ExprIdent' type-id='type-id-165' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='118' column='1' id='type-id-164'/>
    <typedef-decl name='ExprInteger' type-id='type-id-167' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='133' column='1' id='type-id-166'/>
    <typedef-decl name='ExprKeyName' type-id='type-id-169' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='144' column='1' id='type-id-168'/>
    <typedef-decl name='ExprKeySym' type-id='type-id-171' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='151' column='1' id='type-id-170'/>
    <typedef-decl name='ExprKeysymList' type-id='type-id-173' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='193' column='1' id='type-id-172'/>
    <typedef-decl name='ExprString' type-id='type-id-176' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='123' column='1' id='type-id-175'/>
    <typedef-decl name='ExprUnary' type-id='type-id-178' size-in-bits='192' filepath='../src/xkbcomp/ast.h' line='162' column='1' id='type-id-177'/>
    <typedef-decl name='FILE' type-id='type-id-186' size-in-bits='1728' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-267'/>
    <typedef-decl name='IncludeStmt' type-id='type-id-196' size-in-bits='512' filepath='../src/xkbcomp/ast.h' line='111' column='1' id='type-id-268'/>
    <typedef-decl name='LookupEntry' type-id='type-id-180' size-in-bits='128' filepath='../src/text.h' line='18' column='1' id='type-id-179'/>
    <typedef-decl name='ParseCommon' type-id='type-id-198' size-in-bits='128' filepath='../src/xkbcomp/ast.h' line='101' column='1' id='type-id-36'/>
    <typedef-decl name='VarDef' type-id='type-id-182' size-in-bits='320' filepath='../src/xkbcomp/ast.h' line='217' column='1' id='type-id-181'/>
    <typedef-decl name='XkbFile' type-id='type-id-184' size-in-bits='384' filepath='../src/xkbcomp/ast.h' line='309' column='1' id='type-id-183'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-18' filepath='/usr/include/bits/types/struct_FILE.h' line='45' column='1' id='type-id-269'/>
    <typedef-decl name='__int16_t' type-id='type-id-147' size-in-bits='16' filepath='/usr/include/bits/types.h' line='39' column='1' hash='6c2352eccdcd3eea' id='type-id-270'/>
    <typedef-decl name='__int32_t' type-id='type-id-47' size-in-bits='32' filepath='/usr/include/bits/types.h' line='41' column='1' hash='09d17c08f594edc7' id='type-id-271'/>
    <typedef-decl name='__int64_t' type-id='type-id-78' size-in-bits='64' filepath='/usr/include/bits/types.h' line='44' column='1' hash='b119fe0931d2ee10' id='type-id-272'/>
    <typedef-decl name='__int8_t' type-id='type-id-148' size-in-bits='8' filepath='/usr/include/bits/types.h' line='37' column='1' hash='3c595c3350588f18' id='type-id-273'/>
    <typedef-decl name='__off64_t' type-id='type-id-78' size-in-bits='64' filepath='/usr/include/bits/types.h' line='153' column='1' hash='b119fe0931d2ee10' id='type-id-191'/>
    <typedef-decl name='__off_t' type-id='type-id-78' size-in-bits='64' filepath='/usr/include/bits/types.h' line='152' column='1' hash='b119fe0931d2ee10' id='type-id-48'/>
    <typedef-decl name='__ssize_t' type-id='type-id-78' size-in-bits='64' filepath='/usr/include/bits/types.h' line='194' column='1' hash='b119fe0931d2ee10' id='type-id-274'/>
    <typedef-decl name='__uint16_t' type-id='type-id-189' size-in-bits='16' filepath='/usr/include/bits/types.h' line='40' column='1' hash='d7723bb93a30b11d' id='type-id-275'/>
    <typedef-decl name='__uint32_t' type-id='type-id-79' size-in-bits='32' filepath='/usr/include/bits/types.h' line='42' column='1' hash='e66b43f97c38e87a' id='type-id-276'/>
    <typedef-decl name='__uint64_t' type-id='type-id-21' size-in-bits='64' filepath='/usr/include/bits/types.h' line='45' column='1' hash='8fdc5eea2983a729' id='type-id-195'/>
    <typedef-decl name='__uint8_t' type-id='type-id-277' size-in-bits='8' filepath='/usr/include/bits/types.h' line='38' column='1' hash='6ebac62b3366db68' id='type-id-278'/>
    <typedef-decl name='darray_char' type-id='type-id-207' size-in-bits='128' filepath='../src/darray.h' line='63' column='1' id='type-id-206'/>
    <typedef-decl name='darray_size_t' type-id='type-id-79' size-in-bits='32' filepath='../src/darray.h' line='17' column='1' hash='e66b43f97c38e87a' id='type-id-70'/>
    <typedef-decl name='int16_t' type-id='type-id-270' size-in-bits='16' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' hash='6c2352eccdcd3eea' id='type-id-31'/>
    <typedef-decl name='int32_t' type-id='type-id-271' size-in-bits='32' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='type-id-53'/>
    <typedef-decl name='int64_t' type-id='type-id-272' size-in-bits='64' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' hash='b119fe0931d2ee10' id='type-id-4'/>
    <typedef-decl name='int8_t' type-id='type-id-273' size-in-bits='8' filepath='/usr/include/bits/stdint-intn.h' line='24' column='1' hash='3c595c3350588f18' id='type-id-254'/>
    <typedef-decl name='size_t' type-id='type-id-21' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='type-id-112'/>
    <typedef-decl name='ssize_t' type-id='type-id-274' size-in-bits='64' filepath='/usr/include/stdio.h' line='78' column='1' hash='b119fe0931d2ee10' id='type-id-279'/>
    <typedef-decl name='uint16_t' type-id='type-id-275' size-in-bits='16' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='type-id-280'/>
    <typedef-decl name='uint32_t' type-id='type-id-276' size-in-bits='32' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='type-id-61'/>
    <typedef-decl name='uint8_t' type-id='type-id-278' size-in-bits='8' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='type-id-252'/>
    <typedef-decl name='xkb_action_count_t' type-id='type-id-280' size-in-bits='16' filepath='../src/keymap.h' line='246' column='1' hash='d7723bb93a30b11d' id='type-id-243'/>
    <typedef-decl name='xkb_atom_t' type-id='type-id-61' size-in-bits='32' filepath='../src/atom.h' line='15' column='1' hash='e66b43f97c38e87a' id='type-id-38'/>
    <typedef-decl name='xkb_keycode_t' type-id='type-id-61' size-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='113' column='1' hash='e66b43f97c38e87a' id='type-id-113'/>
    <typedef-decl name='xkb_keysym_count_t' type-id='type-id-280' size-in-bits='16' filepath='../src/keymap.h' line='310' column='1' hash='d7723bb93a30b11d' id='type-id-242'/>
    <typedef-decl name='xkb_keysym_t' type-id='type-id-61' size-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='153' column='1' hash='e66b43f97c38e87a' id='type-id-116'/>
    <typedef-decl name='xkb_layout_index_t' type-id='type-id-61' size-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='183' column='1' hash='e66b43f97c38e87a' id='type-id-54'/>
    <typedef-decl name='xkb_layout_mask_t' type-id='type-id-61' size-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='185' column='1' hash='e66b43f97c38e87a' id='type-id-241'/>
    <typedef-decl name='xkb_led_index_t' type-id='type-id-61' size-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='255' column='1' hash='e66b43f97c38e87a' id='type-id-115'/>
    <typedef-decl name='xkb_level_index_t' type-id='type-id-61' size-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='199' column='1' hash='e66b43f97c38e87a' id='type-id-114'/>
    <typedef-decl name='xkb_mod_index_t' type-id='type-id-61' size-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='224' column='1' hash='e66b43f97c38e87a' id='type-id-6'/>
    <typedef-decl name='xkb_mod_mask_t' type-id='type-id-61' size-in-bits='32' filepath='../include/xkbcommon/xkbcommon.h' line='226' column='1' hash='e66b43f97c38e87a' id='type-id-55'/>
    <array-type-def dimensions='1' type-id='type-id-252' size-in-bits='56' hash='b2afc7891a8b4aa4' id='type-id-256'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='type-id-281'/>
    </array-type-def>
    <union-decl name='ExprDef' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='195' column='1' hash='a2cd813d4823ddb5' id='type-id-265'>
      <data-member access='public'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='196' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ident' type-id='type-id-164' visibility='default' filepath='../src/xkbcomp/ast.h' line='197' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='string' type-id='type-id-175' visibility='default' filepath='../src/xkbcomp/ast.h' line='198' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='boolean' type-id='type-id-160' visibility='default' filepath='../src/xkbcomp/ast.h' line='199' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='integer' type-id='type-id-166' visibility='default' filepath='../src/xkbcomp/ast.h' line='200' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='key_name' type-id='type-id-168' visibility='default' filepath='../src/xkbcomp/ast.h' line='201' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keysym' type-id='type-id-170' visibility='default' filepath='../src/xkbcomp/ast.h' line='202' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='binary' type-id='type-id-158' visibility='default' filepath='../src/xkbcomp/ast.h' line='203' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='unary' type-id='type-id-177' visibility='default' filepath='../src/xkbcomp/ast.h' line='204' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='field_ref' type-id='type-id-162' visibility='default' filepath='../src/xkbcomp/ast.h' line='205' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='array_ref' type-id='type-id-156' visibility='default' filepath='../src/xkbcomp/ast.h' line='206' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='action' type-id='type-id-152' visibility='default' filepath='../src/xkbcomp/ast.h' line='207' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='actions' type-id='type-id-154' visibility='default' filepath='../src/xkbcomp/ast.h' line='208' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keysym_list' type-id='type-id-172' visibility='default' filepath='../src/xkbcomp/ast.h' line='209' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='xkb_action' visibility='default' size-in-bits='128' filepath='../src/keymap.h' line='217' column='1' hash='8906f52d06c89a8b' id='type-id-59'>
      <data-member access='public'>
        <var-decl name='type' type-id='type-id-135' visibility='default' filepath='../src/keymap.h' line='218' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mods' type-id='type-id-248' visibility='default' filepath='../src/keymap.h' line='219' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='group' type-id='type-id-225' visibility='default' filepath='../src/keymap.h' line='220' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ctrls' type-id='type-id-221' visibility='default' filepath='../src/keymap.h' line='221' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dflt' type-id='type-id-253' visibility='default' filepath='../src/keymap.h' line='222' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='screen' type-id='type-id-257' visibility='default' filepath='../src/keymap.h' line='223' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ptr' type-id='type-id-250' visibility='default' filepath='../src/keymap.h' line='224' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='btn' type-id='type-id-251' visibility='default' filepath='../src/keymap.h' line='225' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='priv' type-id='type-id-255' visibility='default' filepath='../src/keymap.h' line='226' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='internal' type-id='type-id-226' visibility='default' filepath='../src/keymap.h' line='227' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../src/compose/table.h' line='73' column='1' hash='de67da9dcc6d3886' id='type-id-205'>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-262' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='internal' type-id='type-id-261' visibility='default' filepath='../src/compose/table.h' line='83' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='leaf' type-id='type-id-263' visibility='default' filepath='../src/compose/table.h' line='89' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../src/keymap.h' line='257' column='1' hash='cd36f9953bff39ae#2' id='type-id-246'>
      <data-member access='public'>
        <var-decl name='action' type-id='type-id-59' visibility='default' filepath='../src/keymap.h' line='259' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='actions' type-id='type-id-282' visibility='default' filepath='../src/keymap.h' line='261' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../src/keymap.h' line='328' column='1' hash='2b7d5023245147cb#3' id='type-id-245'>
      <data-member access='public'>
        <var-decl name='sym' type-id='type-id-116' visibility='default' filepath='../src/keymap.h' line='329' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='syms' type-id='type-id-215' visibility='default' filepath='../src/keymap.h' line='330' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='../src/keymap.h' line='320' column='1' hash='89d73cbf1699e44c#4' id='type-id-244'>
      <data-member access='public'>
        <var-decl name='upper' type-id='type-id-116' visibility='default' filepath='../src/keymap.h' line='322' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='has_upper' type-id='type-id-117' visibility='default' filepath='../src/keymap.h' line='325' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='../src/keymap.h' line='211' column='1' hash='938bea29031d5669#5' id='type-id-227'>
      <data-member access='public'>
        <var-decl name='clear_latched_mods' type-id='type-id-55' visibility='default' filepath='../src/keymap.h' line='213' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='type-id-24'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-277'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-79'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-21'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='type-id-189'/>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='2432' hash='0c1514cb5c066a66' id='type-id-151'>
      <subrange length='19' lower-bound='0' upper-bound='18' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='7545b01b1bd22246' id='type-id-283'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-240' size-in-bits='7168' hash='08f57c77ad0fc4cf' id='type-id-239'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-33'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-247' size-in-bits='3072' hash='48430bcb86d4b568' id='type-id-249'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-21' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-33'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-149' size-in-bits='64' hash='a260d7eecb4a1710' id='type-id-284'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' hash='e613085eadf723e4' id='type-id-39'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' hash='92f2b933118dc777' id='type-id-285'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' hash='4cdc26b379a5c62d' id='type-id-82'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' hash='4fffd3ed38edecb8' id='type-id-286'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' hash='871138f08e800b41' id='type-id-185'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' hash='09425ab2e457e5e1' id='type-id-287'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' hash='388a0e06ad26eb67' id='type-id-288'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' hash='071f36dcbe00ad00' id='type-id-188'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' hash='e8c018048121152c' id='type-id-194'/>
    <pointer-type-def type-id='type-id-196' size-in-bits='64' hash='59374d9cfef69148' id='type-id-197'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' hash='92b203fbc81a31ec' id='type-id-199'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' hash='39fc40d7ba4ca689' id='type-id-121'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' hash='12ea43dcb5e2be7c' id='type-id-220'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' hash='9c0e3f8596726a0b' id='type-id-289'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-9'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-259'/>
    <qualified-type-def type-id='type-id-259' restrict='yes' hash='b04f089b5ae14a6d' id='type-id-290'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' hash='e20a7dbfbcbc0f36' id='type-id-260'/>
    <qualified-type-def type-id='type-id-266' const='yes' hash='426231b5af3eb92c' id='type-id-291'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' hash='39c2b1ff9c07b38f' id='type-id-292'/>
    <qualified-type-def type-id='type-id-268' const='yes' hash='470c501d410a924e' id='type-id-293'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' hash='36c7416a0482d939' id='type-id-294'/>
    <qualified-type-def type-id='type-id-179' const='yes' hash='8ae31a625cccd8b8' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' hash='92b40e578eed6db2' id='type-id-295'/>
    <qualified-type-def type-id='type-id-122' const='yes' hash='3e50fd33f9bb78d9' id='type-id-296'/>
    <pointer-type-def type-id='type-id-296' size-in-bits='64' hash='c44743f354f6a443' id='type-id-8'/>
    <qualified-type-def type-id='type-id-8' restrict='yes' hash='b7d5472019e79b5f' id='type-id-297'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-298'/>
    <qualified-type-def type-id='type-id-101' const='yes' hash='3708a1b1fd43a8ae' id='type-id-299'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' hash='73d5e284bfc5a21b' id='type-id-300'/>
    <qualified-type-def type-id='type-id-230' const='yes' hash='e941a6b5659fd5f9' id='type-id-301'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' hash='b3089ad12fb8c34c' id='type-id-223'/>
    <qualified-type-def type-id='type-id-116' const='yes' hash='f421c113abd0ced1' id='type-id-302'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' hash='d65771c0b40ad711' id='type-id-16'/>
    <qualified-type-def type-id='type-id-238' const='yes' hash='85fe125c8c7b6e60' id='type-id-303'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' hash='a4a008a8e570b224' id='type-id-304'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' hash='8fc777baaf0c8de1' id='type-id-305'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' hash='54c1e9f81ec7a1db' id='type-id-306'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' hash='a285db8f38e4ea02' id='type-id-307'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' hash='232fa04f890c2a5a' id='type-id-308'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-107'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' hash='f931046cab3a1c76' id='type-id-282'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' hash='590eb237da22321d' id='type-id-202'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' hash='bc2a9729d6fe886c' id='type-id-309'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' hash='86921fdcc4ec0208' id='type-id-211'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' hash='240b34d8b1847ded' id='type-id-310'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' hash='f0af7944ce88be71' id='type-id-311'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' hash='33ddd70378c1cd2b' id='type-id-264'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' hash='fbdb74536c4cf3eb' id='type-id-66'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' hash='f52efa67a9ffa282' id='type-id-228'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' hash='e8883ef82ee9b0ce' id='type-id-234'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' hash='f939710db4dbf9b6' id='type-id-235'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' hash='20095e04256217e1' id='type-id-236'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' hash='ef85df188be578d2' id='type-id-232'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' hash='9dead87320a820e9' id='type-id-76'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' hash='1d6fc5ab4757072e' id='type-id-215'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' hash='7b4be877dafead23' id='type-id-312'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' hash='00db89df976588b7' id='type-id-224'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' hash='db129906ffd88447' id='type-id-313'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' hash='3a3a6f5f8716f105' id='type-id-314'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' hash='4c81807a2b5b695d' id='type-id-237'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-192'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-190'/>
    <pointer-type-def type-id='type-id-316' size-in-bits='64' id='type-id-187'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' id='type-id-193'/>
    <function-decl name='__builtin_stpcpy' mangled-name='stpcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='stpcpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-18'/>
    </function-decl>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-315'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-316'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-317'/>
    <function-decl name='xkb_compose_state_new' mangled-name='xkb_compose_state_new' filepath='../src/compose/state.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_state_new@@V_0.5.0' hash='833a9fac209339ff'>
      <parameter type-id='type-id-211' name='table' filepath='../src/compose/state.c' line='33' column='1'/>
      <parameter type-id='type-id-139' name='flags' filepath='../src/compose/state.c' line='34' column='1'/>
      <return type-id='type-id-309'/>
    </function-decl>
    <function-decl name='xkb_compose_state_ref' mangled-name='xkb_compose_state_ref' filepath='../src/compose/state.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_state_ref@@V_0.5.0' hash='ebcd511cc1096c33'>
      <parameter type-id='type-id-309' name='state' filepath='../src/compose/state.c' line='53' column='1'/>
      <return type-id='type-id-309'/>
    </function-decl>
    <function-decl name='xkb_compose_state_unref' mangled-name='xkb_compose_state_unref' filepath='../src/compose/state.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_state_unref@@V_0.5.0' hash='e78f6c8353e08c24'>
      <parameter type-id='type-id-309' name='state' filepath='../src/compose/state.c' line='118' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_compose_state_get_compose_table' mangled-name='xkb_compose_state_get_compose_table' filepath='../src/compose/state.c' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_state_get_compose_table@@V_0.5.0' hash='fe49af32bae0bbd4'>
      <parameter type-id='type-id-309' name='state' filepath='../src/compose/state.c' line='72' column='1'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='xkb_compose_state_feed' mangled-name='xkb_compose_state_feed' filepath='../src/compose/state.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_state_feed@@V_0.5.0' hash='5ad0d84a47dc00be'>
      <parameter type-id='type-id-309' name='state' filepath='../src/compose/state.c' line='78' column='1'/>
      <parameter type-id='type-id-116' name='keysym' filepath='../src/compose/state.c' line='78' column='1'/>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='xkb_compose_state_reset' mangled-name='xkb_compose_state_reset' filepath='../src/compose/state.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_state_reset@@V_0.5.0' hash='e78f6c8353e08c24'>
      <parameter type-id='type-id-309' name='state' filepath='../src/compose/state.c' line='118' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_compose_state_get_status' mangled-name='xkb_compose_state_get_status' filepath='../src/compose/state.c' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_state_get_status@@V_0.5.0' hash='482f3192bcee062c'>
      <parameter type-id='type-id-309' name='state' filepath='../src/compose/state.c' line='125' column='1'/>
      <return type-id='type-id-140'/>
    </function-decl>
    <function-decl name='xkb_compose_state_get_utf8' mangled-name='xkb_compose_state_get_utf8' filepath='../src/compose/state.c' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_state_get_utf8@@V_0.5.0' hash='2a781ffb2a44167d'>
      <parameter type-id='type-id-309' name='state' filepath='../src/compose/state.c' line='145' column='1'/>
      <parameter type-id='type-id-9' name='buffer' filepath='../src/compose/state.c' line='146' column='1'/>
      <parameter type-id='type-id-112' name='size' filepath='../src/compose/state.c' line='146' column='1'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='xkb_compose_state_get_one_sym' mangled-name='xkb_compose_state_get_one_sym' filepath='../src/compose/state.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_state_get_one_sym@@V_0.5.0' hash='0662ba2198588e37'>
      <parameter type-id='type-id-309' name='state' filepath='../src/compose/state.c' line='180' column='1'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='xkb_compose_table_ref' mangled-name='xkb_compose_table_ref' filepath='../src/compose/table.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_table_ref@@V_0.5.0' hash='16029a9b0f9f72e1'>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='xkb_compose_table_unref' mangled-name='xkb_compose_table_unref' filepath='../src/compose/table.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_table_unref@@V_0.5.0' hash='708d904f64ea58f3'>
      <parameter type-id='type-id-211'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_compose_table_new_from_file' mangled-name='xkb_compose_table_new_from_file' filepath='../src/compose/table.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_table_new_from_file@@V_0.5.0' hash='8c4c60eab61c6b21'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/compose/table.c' line='80' column='1'/>
      <parameter type-id='type-id-82' name='file' filepath='../src/compose/table.c' line='81' column='1'/>
      <parameter type-id='type-id-8' name='locale' filepath='../src/compose/table.c' line='82' column='1'/>
      <parameter type-id='type-id-138' name='format' filepath='../src/compose/table.c' line='83' column='1'/>
      <parameter type-id='type-id-136' name='flags' filepath='../src/compose/table.c' line='84' column='1'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='xkb_compose_table_new_from_buffer' mangled-name='xkb_compose_table_new_from_buffer' filepath='../src/compose/table.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_table_new_from_buffer@@V_0.5.0' hash='888d114c02e4ed1b'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/compose/table.c' line='115' column='1'/>
      <parameter type-id='type-id-8' name='buffer' filepath='../src/compose/table.c' line='116' column='1'/>
      <parameter type-id='type-id-112' name='length' filepath='../src/compose/table.c' line='116' column='1'/>
      <parameter type-id='type-id-8' name='locale' filepath='../src/compose/table.c' line='117' column='1'/>
      <parameter type-id='type-id-138' name='format' filepath='../src/compose/table.c' line='118' column='1'/>
      <parameter type-id='type-id-136' name='flags' filepath='../src/compose/table.c' line='119' column='1'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='xkb_compose_table_new_from_locale' mangled-name='xkb_compose_table_new_from_locale' filepath='../src/compose/table.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_table_new_from_locale@@V_0.5.0' hash='f383eccc0d86196a'>
      <parameter type-id='type-id-66' name='ctx' filepath='../src/compose/table.c' line='150' column='1'/>
      <parameter type-id='type-id-8' name='locale' filepath='../src/compose/table.c' line='151' column='1'/>
      <parameter type-id='type-id-136' name='flags' filepath='../src/compose/table.c' line='152' column='1'/>
      <return type-id='type-id-211'/>
    </function-decl>
    <function-decl name='xkb_compose_table_entry_sequence' mangled-name='xkb_compose_table_entry_sequence' filepath='../src/compose/table.c' line='218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_table_entry_sequence@@V_1.6.0' hash='9511b317f622561a'>
      <parameter type-id='type-id-310' name='entry' filepath='../src/compose/table.c' line='218' column='1'/>
      <parameter type-id='type-id-306' name='sequence_length' filepath='../src/compose/table.c' line='219' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='xkb_compose_table_entry_keysym' mangled-name='xkb_compose_table_entry_keysym' filepath='../src/compose/table.c' line='226' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_table_entry_keysym@@V_1.6.0' hash='89ac14cd59e8b6c3'>
      <parameter type-id='type-id-310' name='entry' filepath='../src/compose/table.c' line='226' column='1'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='xkb_compose_table_entry_utf8' mangled-name='xkb_compose_table_entry_utf8' filepath='../src/compose/table.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_table_entry_utf8@@V_1.6.0' hash='72bd78994e3be2d0'>
      <parameter type-id='type-id-310' name='entry' filepath='../src/compose/table.c' line='232' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='xkb_compose_table_iterator_new' mangled-name='xkb_compose_table_iterator_new' filepath='../src/compose/table.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_table_iterator_new@@V_1.6.0' hash='14383c6334adffbd'>
      <parameter type-id='type-id-211' name='table' filepath='../src/compose/table.c' line='255' column='1'/>
      <return type-id='type-id-311'/>
    </function-decl>
    <function-decl name='xkb_compose_table_iterator_free' mangled-name='xkb_compose_table_iterator_free' filepath='../src/compose/table.c' line='298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_table_iterator_free@@V_1.6.0' hash='fda578a7bb0a458d'>
      <parameter type-id='type-id-311' name='iter' filepath='../src/compose/table.c' line='298' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='xkb_compose_table_iterator_next' mangled-name='xkb_compose_table_iterator_next' filepath='../src/compose/table.c' line='307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='xkb_compose_table_iterator_next@@V_1.6.0' hash='de27fa9e4223722a'>
      <parameter type-id='type-id-311' name='iter' filepath='../src/compose/table.c' line='307' column='1'/>
      <return type-id='type-id-310'/>
    </function-decl>
    <type-decl name='void' id='type-id-18'/>
    <pointer-type-def type-id='type-id-18' id='type-id-109'/>
  </abi-instr>
  <abi-instr address-size='64' path='libxkbcommon.so.0.11.0.p/parser.c' comp-dir-path='/usr/src/debug/libxkbcommon-1.11.0-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <class-decl name='GroupCompatDef' is-struct='yes' naming-typedef-id='type-id-318' visibility='default' size-in-bits='320' filepath='../src/xkbcomp/ast.h' line='262' column='1' hash='ac4ef5ba695f17eb' id='type-id-319'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='group' type-id='type-id-4' visibility='default' filepath='../src/xkbcomp/ast.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='def' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='266' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='InterpDef' is-struct='yes' naming-typedef-id='type-id-320' visibility='default' size-in-bits='320' filepath='../src/xkbcomp/ast.h' line='269' column='1' hash='ef76516237adaa94' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='sym' type-id='type-id-116' visibility='default' filepath='../src/xkbcomp/ast.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='match' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='def' type-id='type-id-287' visibility='default' filepath='../src/xkbcomp/ast.h' line='274' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='KeyAliasDef' is-struct='yes' naming-typedef-id='type-id-322' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='233' column='1' hash='f9b1ff394e584f88' id='type-id-323'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='alias' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='real' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='237' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='KeyTypeDef' is-struct='yes' naming-typedef-id='type-id-324' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='240' column='1' hash='1eb6f9bb7063219d' id='type-id-325'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='name' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='body' type-id='type-id-287' visibility='default' filepath='../src/xkbcomp/ast.h' line='244' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='KeycodeDef' is-struct='yes' naming-typedef-id='type-id-326' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='226' column='1' hash='084456cf88040101' id='type-id-327'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='name' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='value' type-id='type-id-4' visibility='default' filepath='../src/xkbcomp/ast.h' line='230' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='LedMapDef' is-struct='yes' naming-typedef-id='type-id-328' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='285' column='1' hash='036b76c03909c79f' id='type-id-329'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='name' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='body' type-id='type-id-287' visibility='default' filepath='../src/xkbcomp/ast.h' line='289' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='LedNameDef' is-struct='yes' naming-typedef-id='type-id-330' visibility='default' size-in-bits='384' filepath='../src/xkbcomp/ast.h' line='277' column='1' hash='847863d3c8cac4c4' id='type-id-331'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ndx' type-id='type-id-4' visibility='default' filepath='../src/xkbcomp/ast.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='name' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='virtual' type-id='type-id-117' visibility='default' filepath='../src/xkbcomp/ast.h' line='282' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ModMapDef' is-struct='yes' naming-typedef-id='type-id-332' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='254' column='1' hash='f3ba2b9f5946a8ec' id='type-id-333'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='modifier' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='keys' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/ast.h' line='259' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='SymbolsDef' is-struct='yes' naming-typedef-id='type-id-334' visibility='default' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='247' column='1' hash='7fc0f5bb1f8528dc' id='type-id-335'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='common' type-id='type-id-36' visibility='default' filepath='../src/xkbcomp/ast.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/ast.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='keyName' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/ast.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='symbols' type-id='type-id-287' visibility='default' filepath='../src/xkbcomp/ast.h' line='251' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sval' is-struct='yes' visibility='default' size-in-bits='128' filepath='../src/scanner-utils.h' line='22' column='1' hash='1cc19bef14ab5c6b' id='type-id-336'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-8' visibility='default' filepath='../src/scanner-utils.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-112' visibility='default' filepath='../src/scanner-utils.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../src/xkbcomp/parser.y' line='179' column='1' hash='d93f2153dacba598' id='type-id-337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/parser.y' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='last' type-id='type-id-39' visibility='default' filepath='../src/xkbcomp/parser.y' line='179' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../src/xkbcomp/parser.y' line='176' column='1' hash='dd00336c38e919d9#2' id='type-id-338'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-185' visibility='default' filepath='../src/xkbcomp/parser.y' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='last' type-id='type-id-185' visibility='default' filepath='../src/xkbcomp/parser.y' line='176' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../src/xkbcomp/parser.y' line='183' column='1' hash='63e574c75457de9e#3' id='type-id-339'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-84' visibility='default' filepath='../src/xkbcomp/parser.y' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='last' type-id='type-id-84' visibility='default' filepath='../src/xkbcomp/parser.y' line='183' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../src/xkbcomp/parser.y' line='181' column='1' hash='7109a9955cdef575#4' id='type-id-340'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-287' visibility='default' filepath='../src/xkbcomp/parser.y' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='last' type-id='type-id-287' visibility='default' filepath='../src/xkbcomp/parser.y' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../src/xkbcomp/parser.y' line='195' column='1' hash='da2595f0053e1d1f#5' id='type-id-341'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-288' visibility='default' filepath='../src/xkbcomp/parser.y' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='last' type-id='type-id-288' visibility='default' filepath='../src/xkbcomp/parser.y' line='195' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GroupCompatDef' type-id='type-id-319' size-in-bits='320' filepath='../src/xkbcomp/ast.h' line='267' column='1' id='type-id-318'/>
    <typedef-decl name='InterpDef' type-id='type-id-321' size-in-bits='320' filepath='../src/xkbcomp/ast.h' line='275' column='1' id='type-id-320'/>
    <typedef-decl name='KeyAliasDef' type-id='type-id-323' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='238' column='1' id='type-id-322'/>
    <typedef-decl name='KeyTypeDef' type-id='type-id-325' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='245' column='1' id='type-id-324'/>
    <typedef-decl name='KeycodeDef' type-id='type-id-327' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='231' column='1' id='type-id-326'/>
    <typedef-decl name='LedMapDef' type-id='type-id-329' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='290' column='1' id='type-id-328'/>
    <typedef-decl name='LedNameDef' type-id='type-id-331' size-in-bits='384' filepath='../src/xkbcomp/ast.h' line='283' column='1' id='type-id-330'/>
    <typedef-decl name='ModMapDef' type-id='type-id-333' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='260' column='1' id='type-id-332'/>
    <typedef-decl name='SymbolsDef' type-id='type-id-335' size-in-bits='256' filepath='../src/xkbcomp/ast.h' line='252' column='1' id='type-id-334'/>
    <typedef-decl name='YYSTYPE' type-id='type-id-342' size-in-bits='128' filepath='libxkbcommon.so.0.11.0.p/parser.h' line='171' column='1' id='type-id-343'/>
    <union-decl name='YYSTYPE' visibility='default' size-in-bits='128' filepath='libxkbcommon.so.0.11.0.p/parser.h' line='134' column='1' hash='8097b5ff6c8eade7' id='type-id-342'>
      <data-member access='public'>
        <var-decl name='num' type-id='type-id-4' visibility='default' filepath='../src/xkbcomp/parser.y' line='167' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file_type' type-id='type-id-142' visibility='default' filepath='../src/xkbcomp/parser.y' line='168' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='str' type-id='type-id-9' visibility='default' filepath='../src/xkbcomp/parser.y' line='169' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sval' type-id='type-id-336' visibility='default' filepath='../src/xkbcomp/parser.y' line='170' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='atom' type-id='type-id-38' visibility='default' filepath='../src/xkbcomp/parser.y' line='171' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='merge' type-id='type-id-37' visibility='default' filepath='../src/xkbcomp/parser.y' line='172' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mapFlags' type-id='type-id-144' visibility='default' filepath='../src/xkbcomp/parser.y' line='173' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keysym' type-id='type-id-116' visibility='default' filepath='../src/xkbcomp/parser.y' line='174' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='any' type-id='type-id-185' visibility='default' filepath='../src/xkbcomp/parser.y' line='175' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='anyList' type-id='type-id-338' visibility='default' filepath='../src/xkbcomp/parser.y' line='176' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='noSymbolOrActionList' type-id='type-id-61' visibility='default' filepath='../src/xkbcomp/parser.y' line='177' column='1'/>
      </data-member>
