<abi-corpus version='2.4' architecture='elf-amd-x86_64' soname='libjson-glib-1.0.so.0'>
  <elf-needed>
    <dependency name='libgio-2.0.so.0'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='json_array_add_array_element' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='json_array_add_boolean_element' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='json_array_add_double_element' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='json_array_add_element' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='json_array_add_int_element' version='libjson-glib-1.0.so.0' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='g_variant_new_object_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_variant_new_signature' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_variant_new_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_variant_new_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_variant_new_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_variant_new_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_variant_new_variant' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_variant_type_checked_' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_variant_type_string_is_valid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_variant_unref' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memmove' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strtol' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strtoul' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_ascii_table' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_utf8_skip' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='../json-glib/json-array.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_ptr_array_new' filepath='/usr/include/glib-2.0/glib/garray.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_new' hash='c5e864ee2f1b6438'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_ptr_array_remove_index' filepath='/usr/include/glib-2.0/glib/garray.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_remove_index' hash='c2f4fddf0cb60960'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-builder.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_queue_new' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_new' hash='5f0a15fbed3be6b7'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='g_queue_free' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_free' hash='5f0a15fbed3be6b7'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_queue_is_empty' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_is_empty' hash='8ee9cbc60d0f1e66'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_queue_push_head' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_push_head' hash='5f0a15fbed3be6b7'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_queue_pop_head' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_pop_head' hash='5f0a15fbed3be6b7'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_queue_peek_head' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_peek_head' hash='5f0a15fbed3be6b7'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-gboxed.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_slist_insert_sorted' filepath='/usr/include/glib-2.0/glib/gslist.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_insert_sorted' hash='2c12cfcd7b83a590'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='g_slist_find_custom' filepath='/usr/include/glib-2.0/glib/gslist.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_slist_find_custom' hash='2c12cfcd7b83a590'>
      <parameter type-id='type-id-7'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='g_mutex_lock' filepath='/usr/include/glib-2.0/glib/gthread.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mutex_lock' hash='37ae111832bd0fb5'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_mutex_unlock' filepath='/usr/include/glib-2.0/glib/gthread.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mutex_unlock' hash='37ae111832bd0fb5'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_type_fundamental' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='2597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_fundamental' hash='91495cdf6321a116'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='g_type_test_flags' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='2649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_test_flags' hash='6837c62f479ec868'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-generator.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_output_stream_get_type' filepath='/usr/include/glib-2.0/gio/goutputstream.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_output_stream_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='g_output_stream_write' filepath='/usr/include/glib-2.0/gio/goutputstream.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_output_stream_write' hash='0ccb291081805151'>
      <parameter type-id='type-id-12'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='g_file_set_contents' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_set_contents' hash='ed027610e10ae49c'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_strstr_len' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strstr_len' hash='810a07c8232412e5'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='g_ascii_dtostr' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ascii_dtostr' hash='926121d5491596cc'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='g_string_insert_len' filepath='/usr/include/glib-2.0/glib/gstring.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_insert_len' hash='56352021ad4eddc4'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_string_append_len' filepath='/usr/include/glib-2.0/glib/gstring.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_append_len' hash='67d9355e78cea58f'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-17'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_string_append_printf' filepath='/usr/include/glib-2.0/glib/gstring.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_append_printf' hash='9c88f7857a1005cc'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-18'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_param_spec_uint' filepath='/usr/include/glib-2.0/gobject/gparamspecs.h' line='1020' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_uint' hash='bd6ffaa62897df84'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='g_param_spec_unichar' filepath='/usr/include/glib-2.0/gobject/gparamspecs.h' line='1060' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_param_spec_unichar' hash='be48228d229e2090'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-24'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-gobject.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <qualified-type-def type-id='type-id-18' const='yes' hash='79787bb2da892273' id='type-id-26'/>
    <class-decl name='_JsonParserPrivate' is-struct='yes' visibility='default' size-in-bits='512' filepath='../json-glib/json-parser.c' line='81' column='1' hash='f5d3f07d575e95de' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root' type-id='type-id-28' visibility='default' filepath='../json-glib/json-parser.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='current_node' type-id='type-id-28' visibility='default' filepath='../json-glib/json-parser.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scanner' type-id='type-id-29' visibility='default' filepath='../json-glib/json-parser.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='error_code' type-id='type-id-30' visibility='default' filepath='../json-glib/json-parser.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='last_error' type-id='type-id-31' visibility='default' filepath='../json-glib/json-parser.c' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='variable_name' type-id='type-id-19' visibility='default' filepath='../json-glib/json-parser.c' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='filename' type-id='type-id-19' visibility='default' filepath='../json-glib/json-parser.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='multi_root' type-id='type-id-32' visibility='default' filepath='../json-glib/json-parser.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='has_assignment' type-id='type-id-2' visibility='default' filepath='../json-glib/json-parser.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='457'>
        <var-decl name='is_filename' type-id='type-id-2' visibility='default' filepath='../json-glib/json-parser.c' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='458'>
        <var-decl name='is_immutable' type-id='type-id-2' visibility='default' filepath='../json-glib/json-parser.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='459'>
        <var-decl name='is_strict' type-id='type-id-2' visibility='default' filepath='../json-glib/json-parser.c' line='99' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_array_sized_new' filepath='/usr/include/glib-2.0/glib/garray.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_sized_new' hash='02dc69fb5b929609'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='g_array_set_clear_func' filepath='/usr/include/glib-2.0/glib/garray.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_set_clear_func' hash='ec840c511a4000f1'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_ptr_array_unref' filepath='/usr/include/glib-2.0/glib/garray.h' line='194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_unref' hash='c5e864ee2f1b6438'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_ptr_array_set_free_func' filepath='/usr/include/glib-2.0/glib/garray.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_set_free_func' hash='0f162f59b58c17c1'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_unichar_isspace' filepath='/usr/include/glib-2.0/glib/gunicode.h' line='707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unichar_isspace' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='g_utf8_skip' type-id='type-id-26' visibility='default' filepath='/usr/include/glib-2.0/glib/gunicode.h' line='807' column='1' elf-symbol-id='g_utf8_skip'/>
    <function-decl name='g_utf8_get_char' filepath='/usr/include/glib-2.0/glib/gunicode.h' line='828' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_utf8_get_char' hash='d231a90e2f39449c'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='g_utf8_prev_char' filepath='/usr/include/glib-2.0/glib/gunicode.h' line='840' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_utf8_prev_char' hash='e43aee0eb551322a'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='g_value_take_boxed' filepath='/usr/include/glib-2.0/gobject/gboxed.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_take_boxed' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_enum_get_value_by_name' filepath='/usr/include/glib-2.0/gobject/genums.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_enum_get_value_by_name' hash='931966e9772e61f5'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='g_enum_get_value_by_nick' filepath='/usr/include/glib-2.0/gobject/genums.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_enum_get_value_by_nick' hash='931966e9772e61f5'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-37'/>
    </function-decl>
    <function-decl name='g_flags_get_value_by_name' filepath='/usr/include/glib-2.0/gobject/genums.h' line='233' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_flags_get_value_by_name' hash='83922b83e0b9d423'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_flags_get_value_by_nick' filepath='/usr/include/glib-2.0/gobject/genums.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_flags_get_value_by_nick' hash='83922b83e0b9d423'>
      <parameter type-id='type-id-38'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_value_set_enum' filepath='/usr/include/glib-2.0/gobject/genums.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_enum' hash='2091532fb37e4a85'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_get_enum' filepath='/usr/include/glib-2.0/gobject/genums.h' line='248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_enum' hash='d48515f4487a3a65'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='g_value_set_flags' filepath='/usr/include/glib-2.0/gobject/genums.h' line='250' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_flags' hash='fcba35f21ce0bc87'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_get_flags' filepath='/usr/include/glib-2.0/gobject/genums.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_flags' hash='1eda092763b4b34d'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_object_new_with_properties' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_new_with_properties' hash='0b069b79f14ad99f'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='g_object_freeze_notify' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_freeze_notify' hash='6fe16b214fd52931'>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_object_thaw_notify' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='505' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_thaw_notify' hash='6fe16b214fd52931'>
      <parameter type-id='type-id-42'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_set_object' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_object' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_get_object' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='639' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_object' hash='fe8357e11df9e46f'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_value_take_object' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_take_object' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_type_is_a' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_is_a' hash='ccc0e5595ea688d4'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_type_class_ref' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_ref' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_type_class_unref' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='771' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_class_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_type_check_value_holds' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='2646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_value_holds' hash='26083f2199cfb26d'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_value_copy' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_copy' hash='1a25e8acfe50e042'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_unset' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_unset' hash='e7a9fd9868345a8f'>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_set_schar' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_schar' hash='43e74e789d7b93ad'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_get_schar' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_schar' hash='6c090601708a3857'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-43'/>
    </function-decl>
    <function-decl name='g_value_set_uchar' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_uchar' hash='a49debf7d5ddde35'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_get_uchar' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_uchar' hash='df143114213e6408'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='g_value_set_int' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_int' hash='2091532fb37e4a85'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_set_long' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_long' hash='b9bf98018187ae1d'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_get_long' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_long' hash='a30ed65382b66e58'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='g_value_set_ulong' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_ulong' hash='72278557255e4da3'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_get_ulong' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_ulong' hash='1a03f2de32aa5984'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-46'/>
    </function-decl>
    <function-decl name='g_value_set_uint64' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_uint64' hash='72278557255e4da3'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_value_get_uint64' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_get_uint64' hash='1a03f2de32aa5984'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_value_set_float' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_float' hash='d243ccb7f439079f'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strtoul' hash='91a1f6f7dca9d3ed'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-52'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-53'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-gvariant.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_JsonGeneratorPrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='../json-glib/json-generator.c' line='43' column='1' hash='3eafe8ddd912a41c' id='type-id-54'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root' type-id='type-id-28' visibility='default' filepath='../json-glib/json-generator.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='indent' type-id='type-id-2' visibility='default' filepath='../json-glib/json-generator.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='indent_char' type-id='type-id-25' visibility='default' filepath='../json-glib/json-generator.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pretty' type-id='type-id-2' visibility='default' filepath='../json-glib/json-generator.c' line='50' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_io_error_quark' filepath='/usr/include/glib-2.0/gio/gioerror.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_io_error_quark' hash='2bb88322482ae81c'>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='g_list_foreach' filepath='/usr/include/glib-2.0/glib/glist.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_foreach' hash='76a183eaede62855'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_ascii_strtoull' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ascii_strtoull' hash='ef93121919685419'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_ascii_formatd' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ascii_formatd' hash='26a815d55dff0174'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='g_variant_get_type_string' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_type_string' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='g_variant_is_container' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_is_container' hash='388da3fa973fde78'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_variant_classify' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_classify' hash='18289293a52fad10'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='g_variant_new_boolean' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_boolean' hash='388da3fa973fde78'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_byte' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_byte' hash='b8d5bf705e488ff2'>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_int16' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_int16' hash='dc8a98af2c8b3404'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_uint16' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_uint16' hash='a123d258525fc45e'>
      <parameter type-id='type-id-63'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_int32' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_int32' hash='388da3fa973fde78'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_uint32' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_uint32' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-65'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_int64' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_int64' hash='52c0efb08d2aa513'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_uint64' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_uint64' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_handle' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_handle' hash='388da3fa973fde78'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_double' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_double' hash='14e245f4052d89de'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_string' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_string' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_object_path' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_object_path' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_signature' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_signature' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_new_variant' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_variant' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_get_boolean' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_boolean' hash='388da3fa973fde78'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_variant_get_byte' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_byte' hash='b8d5bf705e488ff2'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='g_variant_get_int16' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_int16' hash='dc8a98af2c8b3404'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='g_variant_get_uint16' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_uint16' hash='a123d258525fc45e'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-63'/>
    </function-decl>
    <function-decl name='g_variant_get_int32' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_int32' hash='388da3fa973fde78'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='g_variant_get_uint32' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_uint32' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-65'/>
    </function-decl>
    <function-decl name='g_variant_get_int64' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_int64' hash='52c0efb08d2aa513'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='g_variant_get_uint64' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_uint64' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='g_variant_get_handle' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_handle' hash='388da3fa973fde78'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='g_variant_get_double' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_double' hash='14e245f4052d89de'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='g_variant_get_variant' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_variant' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_get_string' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_string' hash='cf94f4707bb56b3f'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='g_variant_new_maybe' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_new_maybe' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_get_maybe' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_maybe' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_get_child_value' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_get_child_value' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_iter_init' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_iter_init' hash='610dc91671c67e84'>
      <parameter type-id='type-id-69'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_variant_iter_next_value' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_iter_next_value' hash='a7d3612404a81fbe'>
      <parameter type-id='type-id-69'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_builder_new' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_builder_new' hash='36a10355c5c0bf0c'>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-70'/>
    </function-decl>
    <function-decl name='g_variant_builder_unref' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_builder_unref' hash='36a10355c5c0bf0c'>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_variant_builder_end' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_builder_end' hash='36a10355c5c0bf0c'>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_variant_builder_open' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_builder_open' hash='36a10355c5c0bf0c'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_variant_builder_close' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_builder_close' hash='36a10355c5c0bf0c'>
      <parameter type-id='type-id-70'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_variant_builder_add_value' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_builder_add_value' hash='36a10355c5c0bf0c'>
      <parameter type-id='type-id-70'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_variant_type_string_is_valid' filepath='/usr/include/glib-2.0/glib/gvarianttype.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_variant_type_string_is_valid' hash='d731989df7e70156'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strtol' hash='52efcc9e902b4c3e'>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-71'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-node.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_str_hash' filepath='/usr/include/glib-2.0/glib/ghash.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_str_hash' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_atomic_ref_count_init' filepath='/usr/include/glib-2.0/glib/grefcount.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_atomic_ref_count_init' hash='b71e60c2b842540b'>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_atomic_ref_count_inc' filepath='/usr/include/glib-2.0/glib/grefcount.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_atomic_ref_count_inc' hash='b71e60c2b842540b'>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_atomic_ref_count_dec' filepath='/usr/include/glib-2.0/glib/grefcount.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_atomic_ref_count_dec' hash='99b378c883afc791'>
      <parameter type-id='type-id-72'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_atomic_ref_count_compare' filepath='/usr/include/glib-2.0/glib/grefcount.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_atomic_ref_count_compare' hash='fea11cc2e4aea5a6'>
      <parameter type-id='type-id-72'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_value_set_int64' filepath='/usr/include/glib-2.0/gobject/gvaluetypes.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_value_set_int64' hash='b9bf98018187ae1d'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-73'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='type-id-74'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-object.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_hash_table_new_full' filepath='/usr/include/glib-2.0/glib/ghash.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_new_full' hash='76f2737fedeaf3a6'>
      <parameter type-id='type-id-75'/>
      <parameter type-id='type-id-76'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-77'/>
    </function-decl>
    <function-decl name='g_hash_table_destroy' filepath='/usr/include/glib-2.0/glib/ghash.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_destroy' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_hash_table_replace' filepath='/usr/include/glib-2.0/glib/ghash.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_replace' hash='388da3fa973fde78'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_hash_table_remove' filepath='/usr/include/glib-2.0/glib/ghash.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_remove' hash='388da3fa973fde78'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_hash_table_lookup' filepath='/usr/include/glib-2.0/glib/ghash.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_lookup' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_hash_table_size' filepath='/usr/include/glib-2.0/glib/ghash.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_size' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_init' filepath='/usr/include/glib-2.0/glib/ghash.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_iter_init' hash='759a12ea55ad239b'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_next' filepath='/usr/include/glib-2.0/glib/ghash.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_iter_next' hash='9cc0fb926af445b8'>
      <parameter type-id='type-id-78'/>
      <parameter type-id='type-id-79'/>
      <parameter type-id='type-id-79'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_str_equal' filepath='/usr/include/glib-2.0/glib/ghash.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_str_equal' hash='388da3fa973fde78'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_list_copy' filepath='/usr/include/glib-2.0/glib/glist.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_copy' hash='b832210b99ef58b3'>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='g_queue_init' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_init' hash='5f0a15fbed3be6b7'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_queue_find_custom' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_find_custom' hash='a2fa8e40673f8a61'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='g_queue_delete_link' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='200' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_delete_link' hash='2ec6c899bf988cd3'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-parser.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_cancellable_get_type' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_cancellable_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='g_input_stream_get_type' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_input_stream_get_type' hash='e0055d99adb0e173'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='g_input_stream_read' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_input_stream_read' hash='660712ca29a53595'>
      <parameter type-id='type-id-80'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='g_task_new' filepath='/usr/include/glib-2.0/gio/gtask.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_task_new' hash='2ef019626d88d7cc'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-82'/>
    </function-decl>
    <function-decl name='g_task_set_task_data' filepath='/usr/include/glib-2.0/gio/gtask.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_task_set_task_data' hash='5695f5ce05a4c55f'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_task_get_task_data' filepath='/usr/include/glib-2.0/gio/gtask.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_task_get_task_data' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-82'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_task_is_valid' filepath='/usr/include/glib-2.0/gio/gtask.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_task_is_valid' hash='388da3fa973fde78'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_task_run_in_thread' filepath='/usr/include/glib-2.0/gio/gtask.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_task_run_in_thread' hash='5695f5ce05a4c55f'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-83'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_task_return_boolean' filepath='/usr/include/glib-2.0/gio/gtask.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_task_return_boolean' hash='388da3fa973fde78'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_task_return_error' filepath='/usr/include/glib-2.0/gio/gtask.h' line='164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_task_return_error' hash='5a93fd810447fa83'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_task_propagate_boolean' filepath='/usr/include/glib-2.0/gio/gtask.h' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_task_propagate_boolean' hash='1b2fa29b6bd87bb5'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_byte_array_new' filepath='/usr/include/glib-2.0/glib/garray.h' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_new' hash='357ac0abb41ad6dc'>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_byte_array_free' filepath='/usr/include/glib-2.0/glib/garray.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_free' hash='0b25f338c82b4514'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-85'/>
    </function-decl>
    <function-decl name='g_byte_array_unref' filepath='/usr/include/glib-2.0/glib/garray.h' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_unref' hash='357ac0abb41ad6dc'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_byte_array_set_size' filepath='/usr/include/glib-2.0/glib/garray.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_byte_array_set_size' hash='dc4f3da7d92b9ea3'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_error_free' filepath='/usr/include/glib-2.0/glib/gerror.h' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_free' hash='5a93fd810447fa83'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_file_get_contents' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_get_contents' hash='1b781f14ad879a43'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_mapped_file_new' filepath='/usr/include/glib-2.0/glib/gmappedfile.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mapped_file_new' hash='4381d67cbdde95ae'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-86'/>
    </function-decl>
    <function-decl name='g_mapped_file_get_length' filepath='/usr/include/glib-2.0/glib/gmappedfile.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mapped_file_get_length' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_mapped_file_get_contents' filepath='/usr/include/glib-2.0/glib/gmappedfile.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mapped_file_get_contents' hash='a0e4fd26be68a7ef'>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='g_mapped_file_unref' filepath='/usr/include/glib-2.0/glib/gmappedfile.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mapped_file_unref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-86'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_object_ref' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_object_ref' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_signal_new' filepath='/usr/include/glib-2.0/gobject/gsignal.h' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_new' hash='b3ff5559dba7a929'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_signal_emit' filepath='/usr/include/glib-2.0/gobject/gsignal.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_emit' hash='0389e499374a3f97'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-55'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_signal_has_handler_pending' filepath='/usr/include/glib-2.0/gobject/gsignal.h' line='418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_signal_has_handler_pending' hash='546871c8a73c53ea'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-90'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='8693f818f17fde0e' id='type-id-91'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-path.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_array_new' filepath='/usr/include/glib-2.0/glib/garray.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_new' hash='85342590edca6c7d'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-33'/>
    </function-decl>
    <function-decl name='g_array_free' filepath='/usr/include/glib-2.0/glib/garray.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_array_free' hash='9c71f9f61c11a46a'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='g_list_free_full' filepath='/usr/include/glib-2.0/glib/glist.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_list_free_full' hash='76a183eaede62855'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchr' hash='1b0d39e45ce45198'>
      <parameter type-id='type-id-92'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-93'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-reader.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_ptr_array_new_with_free_func' filepath='/usr/include/glib-2.0/glib/garray.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_ptr_array_new_with_free_func' hash='0f162f59b58c17c1'>
      <parameter type-id='type-id-34'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='g_queue_get_length' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_get_length' hash='c2d4fb6b5557b642'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_queue_peek_nth' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_queue_peek_nth' hash='1167eae1e7f7474f'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-scanner.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <qualified-type-def type-id='type-id-63' const='yes' hash='70c5f16e30dd9842' id='type-id-94'/>
    <pointer-type-def type-id='type-id-94' size-in-bits='64' hash='e1927b449306fdb7' id='type-id-95'/>
    <qualified-type-def type-id='type-id-95' const='yes' hash='233f94f63495a0eb' id='type-id-96'/>
    <var-decl name='g_ascii_table' type-id='type-id-96' visibility='default' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='59' column='1' elf-symbol-id='g_ascii_table'/>
    <function-decl name='g_strconcat' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strconcat' hash='e43aee0eb551322a'>
      <parameter type-id='type-id-18'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='g_string_free' filepath='/usr/include/glib-2.0/glib/gstring.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_free' hash='9d1d8d666afba838'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='g_string_append_unichar' filepath='/usr/include/glib-2.0/glib/gstring.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_append_unichar' hash='be965edb8ab51e6e'>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='g_unichar_type' filepath='/usr/include/glib-2.0/glib/gunicode.h' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unichar_type' hash='ad541ca07fd4d27d'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='g_unichar_validate' filepath='/usr/include/glib-2.0/glib/gunicode.h' line='763' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unichar_validate' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_snprintf' filepath='/usr/include/glib-2.0/glib/gutils.h' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_snprintf' hash='06cd37028f7a0127'>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-46'/>
      <parameter type-id='type-id-18'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-20'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-serializable.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_type_interface_add_prerequisite' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='1494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_interface_add_prerequisite' hash='91495cdf6321a116'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='g_type_check_value' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='2644' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_type_check_value' hash='d48515f4487a3a65'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-utils.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../json-glib/json-value.c' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='g_int64_hash' filepath='/usr/include/glib-2.0/glib/ghash.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_int64_hash' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='g_double_hash' filepath='/usr/include/glib-2.0/glib/ghash.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_double_hash' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-198e9' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <enum-decl name='GUnicodeType' naming-typedef-id='type-id-97' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/glib/gunicode.h' line='119' column='1' hash='96864642d0f59a4f' id='type-id-98'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='G_UNICODE_CONTROL' value='0'/>
      <enumerator name='G_UNICODE_FORMAT' value='1'/>
      <enumerator name='G_UNICODE_UNASSIGNED' value='2'/>
      <enumerator name='G_UNICODE_PRIVATE_USE' value='3'/>
      <enumerator name='G_UNICODE_SURROGATE' value='4'/>
      <enumerator name='G_UNICODE_LOWERCASE_LETTER' value='5'/>
      <enumerator name='G_UNICODE_MODIFIER_LETTER' value='6'/>
      <enumerator name='G_UNICODE_OTHER_LETTER' value='7'/>
      <enumerator name='G_UNICODE_TITLECASE_LETTER' value='8'/>
      <enumerator name='G_UNICODE_UPPERCASE_LETTER' value='9'/>
      <enumerator name='G_UNICODE_SPACING_MARK' value='10'/>
      <enumerator name='G_UNICODE_ENCLOSING_MARK' value='11'/>
      <enumerator name='G_UNICODE_NON_SPACING_MARK' value='12'/>
      <enumerator name='G_UNICODE_DECIMAL_NUMBER' value='13'/>
      <enumerator name='G_UNICODE_LETTER_NUMBER' value='14'/>
      <enumerator name='G_UNICODE_OTHER_NUMBER' value='15'/>
      <enumerator name='G_UNICODE_CONNECT_PUNCTUATION' value='16'/>
      <enumerator name='G_UNICODE_DASH_PUNCTUATION' value='17'/>
      <enumerator name='G_UNICODE_CLOSE_PUNCTUATION' value='18'/>
      <enumerator name='G_UNICODE_FINAL_PUNCTUATION' value='19'/>
      <enumerator name='G_UNICODE_INITIAL_PUNCTUATION' value='20'/>
      <enumerator name='G_UNICODE_OTHER_PUNCTUATION' value='21'/>
      <enumerator name='G_UNICODE_OPEN_PUNCTUATION' value='22'/>
      <enumerator name='G_UNICODE_CURRENCY_SYMBOL' value='23'/>
      <enumerator name='G_UNICODE_MODIFIER_SYMBOL' value='24'/>
      <enumerator name='G_UNICODE_MATH_SYMBOL' value='25'/>
      <enumerator name='G_UNICODE_OTHER_SYMBOL' value='26'/>
      <enumerator name='G_UNICODE_LINE_SEPARATOR' value='27'/>
      <enumerator name='G_UNICODE_PARAGRAPH_SEPARATOR' value='28'/>
      <enumerator name='G_UNICODE_SPACE_SEPARATOR' value='29'/>
    </enum-decl>
    <class-decl name='JsonScannerConfig' is-struct='yes' naming-typedef-id='type-id-100' visibility='default' size-in-bits='320' filepath='../json-glib/json-scanner.c' line='62' column='1' hash='ae1e072d766ddc09' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cset_skip_characters' type-id='type-id-92' visibility='default' filepath='../json-glib/json-scanner.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cset_identifier_first' type-id='type-id-92' visibility='default' filepath='../json-glib/json-scanner.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cset_identifier_nth' type-id='type-id-92' visibility='default' filepath='../json-glib/json-scanner.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cpair_comment_single' type-id='type-id-92' visibility='default' filepath='../json-glib/json-scanner.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='strict' type-id='type-id-32' visibility='default' filepath='../json-glib/json-scanner.c' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GByteArray' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/garray.h' line='49' column='1' hash='f953252d0d9e6d1e' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-85' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GInputStream' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='44' column='1' hash='fe04ce50f217811b' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-104' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-105' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonPath' is-struct='yes' visibility='default' size-in-bits='320' filepath='../json-glib/json-path.c' line='183' column='1' hash='37af2634819a93b0' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-104' visibility='default' filepath='../json-glib/json-path.c' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nodes' type-id='type-id-56' visibility='default' filepath='../json-glib/json-path.c' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='is_compiled' type-id='type-id-2' visibility='default' filepath='../json-glib/json-path.c' line='190' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonReader' is-struct='yes' visibility='default' size-in-bits='256' filepath='../json-glib/json-reader.h' line='83' column='1' hash='ffaa1c1e714bb4ec' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-104' visibility='default' filepath='../json-glib/json-reader.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-108' visibility='default' filepath='../json-glib/json-reader.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonReaderPrivate' is-struct='yes' visibility='default' size-in-bits='320' filepath='../json-glib/json-reader.c' line='125' column='1' hash='7616ee55c7ed12c6' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root' type-id='type-id-28' visibility='default' filepath='../json-glib/json-reader.c' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='current_node' type-id='type-id-28' visibility='default' filepath='../json-glib/json-reader.c' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='previous_node' type-id='type-id-28' visibility='default' filepath='../json-glib/json-reader.c' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='members' type-id='type-id-1' visibility='default' filepath='../json-glib/json-reader.c' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='error' type-id='type-id-31' visibility='default' filepath='../json-glib/json-reader.c' line='135' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonScanner' is-struct='yes' visibility='default' size-in-bits='1088' filepath='../json-glib/json-scanner.c' line='88' column='1' hash='9f001ea8bc81d180' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='input_name' type-id='type-id-92' visibility='default' filepath='../json-glib/json-scanner.c' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='config' type-id='type-id-100' visibility='default' filepath='../json-glib/json-scanner.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='token' type-id='type-id-111' visibility='default' filepath='../json-glib/json-scanner.c' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='value' type-id='type-id-112' visibility='default' filepath='../json-glib/json-scanner.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='line' type-id='type-id-111' visibility='default' filepath='../json-glib/json-scanner.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='position' type-id='type-id-111' visibility='default' filepath='../json-glib/json-scanner.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='next_token' type-id='type-id-111' visibility='default' filepath='../json-glib/json-scanner.c' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='next_value' type-id='type-id-112' visibility='default' filepath='../json-glib/json-scanner.c' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='next_line' type-id='type-id-111' visibility='default' filepath='../json-glib/json-scanner.c' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='next_position' type-id='type-id-111' visibility='default' filepath='../json-glib/json-scanner.c' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='text' type-id='type-id-92' visibility='default' filepath='../json-glib/json-scanner.c' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='text_end' type-id='type-id-92' visibility='default' filepath='../json-glib/json-scanner.c' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='buffer' type-id='type-id-93' visibility='default' filepath='../json-glib/json-scanner.c' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='msg_handler' type-id='type-id-113' visibility='default' filepath='../json-glib/json-scanner.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='user_data' type-id='type-id-3' visibility='default' filepath='../json-glib/json-scanner.c' line='115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='type-id-114'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-13' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-13' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GAsyncReadyCallback' type-id='type-id-115' size-in-bits='64' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='190' column='1' hash='fd7a63c0c6c822c4' id='type-id-81'/>
    <typedef-decl name='GByteArray' type-id='type-id-102' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/garray.h' line='40' column='1' id='type-id-116'/>
    <typedef-decl name='GInputStream' type-id='type-id-103' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='97' column='1' id='type-id-117'/>
    <typedef-decl name='GTaskThreadFunc' type-id='type-id-118' size-in-bits='64' filepath='/usr/include/glib-2.0/gio/gtask.h' line='130' column='1' hash='fd7a63c0c6c822c4' id='type-id-83'/>
    <typedef-decl name='GUnicodeType' type-id='type-id-98' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/glib/gunicode.h' line='150' column='1' hash='96864642d0f59a4f' id='type-id-97'/>
    <typedef-decl name='JsonPath' type-id='type-id-106' size-in-bits='320' filepath='../json-glib/json-path.h' line='62' column='1' id='type-id-119'/>
    <typedef-decl name='JsonReader' type-id='type-id-107' size-in-bits='256' filepath='../json-glib/json-reader.h' line='51' column='1' id='type-id-120'/>
    <typedef-decl name='JsonReaderPrivate' type-id='type-id-109' size-in-bits='320' filepath='../json-glib/json-reader.h' line='52' column='1' id='type-id-121'/>
    <typedef-decl name='JsonScannerConfig' type-id='type-id-101' size-in-bits='320' filepath='../json-glib/json-scanner.c' line='69' column='1' id='type-id-100'/>
    <typedef-decl name='JsonScannerMsgFunc' type-id='type-id-122' size-in-bits='64' filepath='../json-glib/json-scanner.h' line='45' column='1' hash='fd7a63c0c6c822c4' id='type-id-113'/>
    <typedef-decl name='JsonTokenValue' type-id='type-id-123' size-in-bits='64' filepath='../json-glib/json-scanner.c' line='79' column='1' id='type-id-112'/>
    <union-decl name='JsonTokenValue' naming-typedef-id='type-id-112' visibility='default' size-in-bits='64' filepath='../json-glib/json-scanner.c' line='71' column='1' hash='ac0fffb996e15f31' id='type-id-123'>
      <data-member access='public'>
        <var-decl name='v_symbol' type-id='type-id-3' visibility='default' filepath='../json-glib/json-scanner.c' line='73' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_identifier' type-id='type-id-93' visibility='default' filepath='../json-glib/json-scanner.c' line='74' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_int64' type-id='type-id-66' visibility='default' filepath='../json-glib/json-scanner.c' line='75' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_float' type-id='type-id-124' visibility='default' filepath='../json-glib/json-scanner.c' line='76' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_string' type-id='type-id-93' visibility='default' filepath='../json-glib/json-scanner.c' line='77' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v_error' type-id='type-id-111' visibility='default' filepath='../json-glib/json-scanner.c' line='78' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' hash='f28cc4b41a45db9f' id='type-id-84'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' hash='67f13c1923df2743' id='type-id-80'/>
    <pointer-type-def type-id='type-id-119' size-in-bits='64' hash='8e613d6a37597642' id='type-id-125'/>
    <pointer-type-def type-id='type-id-120' size-in-bits='64' hash='79665001835dfde1' id='type-id-126'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' hash='f149f712729bfb73' id='type-id-108'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' hash='39fc40d7ba4ca689' id='type-id-127'/>
    <qualified-type-def type-id='type-id-128' const='yes' hash='05513674c78bcf96' id='type-id-129'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' hash='41433aba07377a83' id='type-id-130'/>
    <qualified-type-def type-id='type-id-131' const='yes' hash='7be863a999e6a226' id='type-id-132'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' hash='957f38727540b0d5' id='type-id-133'/>
    <pointer-type-def type-id='type-id-61' size-in-bits='64' hash='4d9f8d539f48293b' id='type-id-85'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-115'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-118'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-122'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' id='type-id-82'/>
    <class-decl name='_GAsyncResult' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-141'/>
    <class-decl name='_GInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-142'/>
    <class-decl name='_GMappedFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-143'/>
    <class-decl name='_GTask' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-144'/>
    <class-decl name='_JsonNode' is-struct='yes' visibility='default' size-in-bits='256' filepath='../json-glib/json-types-private.h' line='49' column='1' hash='607a8e1b9bb4f66d' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-146' visibility='default' filepath='../json-glib/json-types-private.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ref_count' type-id='type-id-147' visibility='default' filepath='../json-glib/json-types-private.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='immutable' type-id='type-id-6' visibility='default' filepath='../json-glib/json-types-private.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='allocated' type-id='type-id-6' visibility='default' filepath='../json-glib/json-types-private.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-148' visibility='default' filepath='../json-glib/json-types-private.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='parent' type-id='type-id-28' visibility='default' filepath='../json-glib/json-types-private.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='json_parser_get_type' mangled-name='json_parser_get_type' filepath='../json-glib/json-parser.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_get_type@@libjson-glib-1.0.so.0' hash='e0055d99adb0e173'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='json_parser_new' mangled-name='json_parser_new' filepath='../json-glib/json-parser.c' line='1214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_new@@libjson-glib-1.0.so.0' hash='3e175665305b7131'>
      <return type-id='type-id-149'/>
    </function-decl>
    <function-decl name='json_parser_new_immutable' mangled-name='json_parser_new_immutable' filepath='../json-glib/json-parser.c' line='1229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_new_immutable@@libjson-glib-1.0.so.0' hash='3e175665305b7131'>
      <return type-id='type-id-149'/>
    </function-decl>
    <function-decl name='json_parser_load_from_file' mangled-name='json_parser_load_from_file' filepath='../json-glib/json-parser.c' line='1376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_load_from_file@@libjson-glib-1.0.so.0' hash='5bd3842cd725e480'>
      <parameter type-id='type-id-149' name='parser' filepath='../json-glib/json-parser.c' line='1376' column='1'/>
      <parameter type-id='type-id-18' name='filename' filepath='../json-glib/json-parser.c' line='1377' column='1'/>
      <parameter type-id='type-id-16' name='error' filepath='../json-glib/json-parser.c' line='1378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_parser_load_from_mapped_file' mangled-name='json_parser_load_from_mapped_file' filepath='../json-glib/json-parser.c' line='1432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_load_from_mapped_file@@libjson-glib-1.0.so.0' hash='5bd3842cd725e480'>
      <parameter type-id='type-id-149' name='parser' filepath='../json-glib/json-parser.c' line='1376' column='1'/>
      <parameter type-id='type-id-18' name='filename' filepath='../json-glib/json-parser.c' line='1377' column='1'/>
      <parameter type-id='type-id-16' name='error' filepath='../json-glib/json-parser.c' line='1378' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_parser_load_from_data' mangled-name='json_parser_load_from_data' filepath='../json-glib/json-parser.c' line='1485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_load_from_data@@libjson-glib-1.0.so.0' hash='1761b8bffec096b8'>
      <parameter type-id='type-id-149'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_parser_get_root' mangled-name='json_parser_get_root' filepath='../json-glib/json-parser.c' line='1529' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_get_root@@libjson-glib-1.0.so.0' hash='92b25067332dcc6b'>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='json_parser_steal_root' mangled-name='json_parser_steal_root' filepath='../json-glib/json-parser.c' line='1555' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_steal_root@@libjson-glib-1.0.so.0' hash='92b25067332dcc6b'>
      <parameter type-id='type-id-149'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='json_parser_get_current_line' mangled-name='json_parser_get_current_line' filepath='../json-glib/json-parser.c' line='1582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_get_current_line@@libjson-glib-1.0.so.0' hash='01db46393dacba59'>
      <parameter type-id='type-id-149' name='parser' filepath='../json-glib/json-parser.c' line='1582' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='json_parser_get_current_pos' mangled-name='json_parser_get_current_pos' filepath='../json-glib/json-parser.c' line='1606' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_get_current_pos@@libjson-glib-1.0.so.0' hash='01db46393dacba59'>
      <parameter type-id='type-id-149' name='parser' filepath='../json-glib/json-parser.c' line='1582' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='json_parser_has_assignment' mangled-name='json_parser_has_assignment' filepath='../json-glib/json-parser.c' line='1639' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_has_assignment@@libjson-glib-1.0.so.0' hash='e0a35ca786ec0706'>
      <parameter type-id='type-id-149' name='parser' filepath='../json-glib/json-parser.c' line='1639' column='1'/>
      <parameter type-id='type-id-58' name='variable_name' filepath='../json-glib/json-parser.c' line='1640' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_parser_load_from_stream' mangled-name='json_parser_load_from_stream' filepath='../json-glib/json-parser.c' line='1676' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_load_from_stream@@libjson-glib-1.0.so.0' hash='2bd99de1419f6d38'>
      <parameter type-id='type-id-149' name='parser' filepath='../json-glib/json-parser.c' line='1676' column='1'/>
      <parameter type-id='type-id-80' name='stream' filepath='../json-glib/json-parser.c' line='1677' column='1'/>
      <parameter type-id='type-id-15' name='cancellable' filepath='../json-glib/json-parser.c' line='1678' column='1'/>
      <parameter type-id='type-id-16' name='error' filepath='../json-glib/json-parser.c' line='1679' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_parser_load_from_stream_finish' mangled-name='json_parser_load_from_stream_finish' filepath='../json-glib/json-parser.c' line='1762' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_load_from_stream_finish@@libjson-glib-1.0.so.0' hash='2613d109c612a293'>
      <parameter type-id='type-id-149' name='parser' filepath='../json-glib/json-parser.c' line='1762' column='1'/>
      <parameter type-id='type-id-137' name='result' filepath='../json-glib/json-parser.c' line='1763' column='1'/>
      <parameter type-id='type-id-16' name='error' filepath='../json-glib/json-parser.c' line='1764' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_parser_load_from_stream_async' mangled-name='json_parser_load_from_stream_async' filepath='../json-glib/json-parser.c' line='1843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_load_from_stream_async@@libjson-glib-1.0.so.0' hash='beb7c08343e8559c'>
      <parameter type-id='type-id-149' name='parser' filepath='../json-glib/json-parser.c' line='1843' column='1'/>
      <parameter type-id='type-id-80' name='stream' filepath='../json-glib/json-parser.c' line='1844' column='1'/>
      <parameter type-id='type-id-15' name='cancellable' filepath='../json-glib/json-parser.c' line='1845' column='1'/>
      <parameter type-id='type-id-81' name='callback' filepath='../json-glib/json-parser.c' line='1846' column='1'/>
      <parameter type-id='type-id-3' name='user_data' filepath='../json-glib/json-parser.c' line='1847' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='json_parser_set_strict' mangled-name='json_parser_set_strict' filepath='../json-glib/json-parser.c' line='1884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_set_strict@@libjson-glib-1.0.so.0' hash='9d38ecb6e947242c'>
      <parameter type-id='type-id-149' name='parser' filepath='../json-glib/json-parser.c' line='1884' column='1'/>
      <parameter type-id='type-id-6' name='strict' filepath='../json-glib/json-parser.c' line='1885' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='json_parser_get_strict' mangled-name='json_parser_get_strict' filepath='../json-glib/json-parser.c' line='1911' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_parser_get_strict@@libjson-glib-1.0.so.0' hash='e79a85d5b16d563a'>
      <parameter type-id='type-id-149' name='parser' filepath='../json-glib/json-parser.c' line='1911' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_path_error_quark' mangled-name='json_path_error_quark' filepath='../json-glib/json-path.c' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_path_error_quark@@libjson-glib-1.0.so.0' hash='2bb88322482ae81c'>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='json_path_get_type' mangled-name='json_path_get_type' filepath='../json-glib/json-path.c' line='219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_path_get_type@@libjson-glib-1.0.so.0' hash='e0055d99adb0e173'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='json_path_new' mangled-name='json_path_new' filepath='../json-glib/json-path.c' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_path_new@@libjson-glib-1.0.so.0' hash='22d4f8cd5cdfa71e'>
      <return type-id='type-id-125'/>
    </function-decl>
    <function-decl name='json_path_compile' mangled-name='json_path_compile' filepath='../json-glib/json-path.c' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_path_compile@@libjson-glib-1.0.so.0' hash='46c608e5fc7a9054'>
      <parameter type-id='type-id-125' name='path' filepath='../json-glib/json-path.c' line='367' column='1'/>
      <parameter type-id='type-id-92' name='expression' filepath='../json-glib/json-path.c' line='368' column='1'/>
      <parameter type-id='type-id-16' name='error' filepath='../json-glib/json-path.c' line='369' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_path_match' mangled-name='json_path_match' filepath='../json-glib/json-path.c' line='943' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_path_match@@libjson-glib-1.0.so.0' hash='d86916d30af279ee'>
      <parameter type-id='type-id-125' name='path' filepath='../json-glib/json-path.c' line='943' column='1'/>
      <parameter type-id='type-id-28' name='root' filepath='../json-glib/json-path.c' line='944' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='json_path_query' mangled-name='json_path_query' filepath='../json-glib/json-path.c' line='982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_path_query@@libjson-glib-1.0.so.0' hash='9538d33959266cb8'>
      <parameter type-id='type-id-92' name='expression' filepath='../json-glib/json-path.c' line='982' column='1'/>
      <parameter type-id='type-id-28' name='root' filepath='../json-glib/json-path.c' line='983' column='1'/>
      <parameter type-id='type-id-16' name='error' filepath='../json-glib/json-path.c' line='984' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='json_reader_get_type' mangled-name='json_reader_get_type' filepath='../json-glib/json-reader.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_get_type@@libjson-glib-1.0.so.0' hash='e0055d99adb0e173'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='json_reader_error_quark' mangled-name='json_reader_error_quark' filepath='../json-glib/json-reader.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_error_quark@@libjson-glib-1.0.so.0' hash='2bb88322482ae81c'>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='json_reader_new' mangled-name='json_reader_new' filepath='../json-glib/json-reader.c' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_new@@libjson-glib-1.0.so.0' hash='124318e6d9504daf'>
      <parameter type-id='type-id-28' name='node' filepath='../json-glib/json-reader.c' line='254' column='1'/>
      <return type-id='type-id-126'/>
    </function-decl>
    <function-decl name='json_reader_set_root' mangled-name='json_reader_set_root' filepath='../json-glib/json-reader.c' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_set_root@@libjson-glib-1.0.so.0' hash='124318e6d9504daf'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='290' column='1'/>
      <parameter type-id='type-id-28' name='root' filepath='../json-glib/json-reader.c' line='291' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='json_reader_get_error' mangled-name='json_reader_get_error' filepath='../json-glib/json-reader.c' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_get_error@@libjson-glib-1.0.so.0' hash='f16227ee9fdcb905'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='371' column='1'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='json_reader_is_array' mangled-name='json_reader_is_array' filepath='../json-glib/json-reader.c' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_is_array@@libjson-glib-1.0.so.0' hash='e7d18e0a0a68e8c4'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='389' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_reader_is_object' mangled-name='json_reader_is_object' filepath='../json-glib/json-reader.c' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_is_object@@libjson-glib-1.0.so.0' hash='e7d18e0a0a68e8c4'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='389' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_reader_is_value' mangled-name='json_reader_is_value' filepath='../json-glib/json-reader.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_is_value@@libjson-glib-1.0.so.0' hash='e7d18e0a0a68e8c4'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='389' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_reader_read_element' mangled-name='json_reader_read_element' filepath='../json-glib/json-reader.c' line='506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_read_element@@libjson-glib-1.0.so.0' hash='076bde3c083b73b2'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='506' column='1'/>
      <parameter type-id='type-id-2' name='index_' filepath='../json-glib/json-reader.c' line='507' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_reader_end_element' mangled-name='json_reader_end_element' filepath='../json-glib/json-reader.c' line='585' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_end_element@@libjson-glib-1.0.so.0' hash='7b422a055203e7bd'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='585' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='json_reader_count_elements' mangled-name='json_reader_count_elements' filepath='../json-glib/json-reader.c' line='623' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_count_elements@@libjson-glib-1.0.so.0' hash='e7d18e0a0a68e8c4'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='623' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='json_reader_read_member' mangled-name='json_reader_read_member' filepath='../json-glib/json-reader.c' line='706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_read_member@@libjson-glib-1.0.so.0' hash='bb67ec8aea0cd5c1'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='706' column='1'/>
      <parameter type-id='type-id-18' name='member_name' filepath='../json-glib/json-reader.c' line='707' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_reader_end_member' mangled-name='json_reader_end_member' filepath='../json-glib/json-reader.c' line='753' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_end_member@@libjson-glib-1.0.so.0' hash='7b422a055203e7bd'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='585' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='json_reader_list_members' mangled-name='json_reader_list_members' filepath='../json-glib/json-reader.c' line='791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_list_members@@libjson-glib-1.0.so.0' hash='3c8bbf2627a1160f'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='791' column='1'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <function-decl name='json_reader_count_members' mangled-name='json_reader_count_members' filepath='../json-glib/json-reader.c' line='845' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_count_members@@libjson-glib-1.0.so.0' hash='e7d18e0a0a68e8c4'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='623' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='json_reader_get_value' mangled-name='json_reader_get_value' filepath='../json-glib/json-reader.c' line='885' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_get_value@@libjson-glib-1.0.so.0' hash='f89d190cf4b74deb'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='1150' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='json_reader_get_int_value' mangled-name='json_reader_get_int_value' filepath='../json-glib/json-reader.c' line='925' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_get_int_value@@libjson-glib-1.0.so.0' hash='0e5e7e86448aa008'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='925' column='1'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='json_reader_get_double_value' mangled-name='json_reader_get_double_value' filepath='../json-glib/json-reader.c' line='965' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_get_double_value@@libjson-glib-1.0.so.0' hash='6826963ec879fed7'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='965' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='json_reader_get_string_value' mangled-name='json_reader_get_string_value' filepath='../json-glib/json-reader.c' line='1005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_get_string_value@@libjson-glib-1.0.so.0' hash='1618fa6cdc92cc4a'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='1120' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='json_reader_get_boolean_value' mangled-name='json_reader_get_boolean_value' filepath='../json-glib/json-reader.c' line='1052' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_get_boolean_value@@libjson-glib-1.0.so.0' hash='e7d18e0a0a68e8c4'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='389' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_reader_get_null_value' mangled-name='json_reader_get_null_value' filepath='../json-glib/json-reader.c' line='1092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_get_null_value@@libjson-glib-1.0.so.0' hash='e7d18e0a0a68e8c4'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='389' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_reader_get_member_name' mangled-name='json_reader_get_member_name' filepath='../json-glib/json-reader.c' line='1120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_get_member_name@@libjson-glib-1.0.so.0' hash='1618fa6cdc92cc4a'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='1120' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='json_reader_get_current_node' mangled-name='json_reader_get_current_node' filepath='../json-glib/json-reader.c' line='1150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_reader_get_current_node@@libjson-glib-1.0.so.0' hash='f89d190cf4b74deb'>
      <parameter type-id='type-id-126' name='reader' filepath='../json-glib/json-reader.c' line='1150' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='json_serializable_serialize_property' mangled-name='json_serializable_serialize_property' filepath='../json-glib/json-serializable.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_serializable_serialize_property@@libjson-glib-1.0.so.0' hash='68e3427a4c7348df'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='json_serializable_deserialize_property' mangled-name='json_serializable_deserialize_property' filepath='../json-glib/json-serializable.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_serializable_deserialize_property@@libjson-glib-1.0.so.0' hash='3aa536e37bdd8452'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_serializable_get_type' mangled-name='json_serializable_get_type' filepath='../json-glib/json-serializable.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_serializable_get_type@@libjson-glib-1.0.so.0' hash='e0055d99adb0e173'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='json_serializable_default_serialize_property' mangled-name='json_serializable_default_serialize_property' filepath='../json-glib/json-serializable.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_serializable_default_serialize_property@@libjson-glib-1.0.so.0' hash='68e3427a4c7348df'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='json_serializable_default_deserialize_property' mangled-name='json_serializable_default_deserialize_property' filepath='../json-glib/json-serializable.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_serializable_default_deserialize_property@@libjson-glib-1.0.so.0' hash='3aa536e37bdd8452'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='json_serializable_find_property' mangled-name='json_serializable_find_property' filepath='../json-glib/json-serializable.c' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_serializable_find_property@@libjson-glib-1.0.so.0' hash='efc0a105e408866c'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-92'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='json_serializable_list_properties' mangled-name='json_serializable_list_properties' filepath='../json-glib/json-serializable.c' line='330' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_serializable_list_properties@@libjson-glib-1.0.so.0' hash='805056520f2a5786'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-151'/>
      <return type-id='type-id-152'/>
    </function-decl>
    <function-decl name='json_serializable_set_property' mangled-name='json_serializable_set_property' filepath='../json-glib/json-serializable.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_serializable_set_property@@libjson-glib-1.0.so.0' hash='7cf5d6b18c9263f7'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='json_serializable_get_property' mangled-name='json_serializable_get_property' filepath='../json-glib/json-serializable.c' line='377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_serializable_get_property@@libjson-glib-1.0.so.0' hash='23be2bd3d3c71579'>
      <parameter type-id='type-id-150'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-35'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='json_from_string' mangled-name='json_from_string' filepath='../json-glib/json-utils.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_from_string@@libjson-glib-1.0.so.0' hash='fbc73159fad163fb'>
      <parameter type-id='type-id-92' name='str' filepath='../json-glib/json-utils.c' line='45' column='1'/>
      <parameter type-id='type-id-16' name='error' filepath='../json-glib/json-utils.c' line='46' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='json_to_string' mangled-name='json_to_string' filepath='../json-glib/json-utils.c' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='json_to_string@@libjson-glib-1.0.so.0' hash='f332faeca06207ab'>
      <parameter type-id='type-id-28' name='node' filepath='../json-glib/json-utils.c' line='80' column='1'/>
      <parameter type-id='type-id-6' name='pretty' filepath='../json-glib/json-utils.c' line='81' column='1'/>
      <return type-id='type-id-93'/>
    </function-decl>
    <typedef-decl name='GInputStreamPrivate' type-id='type-id-142' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='42' column='1' id='type-id-138'/>
    <typedef-decl name='GAsyncResult' type-id='type-id-141' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='36' column='1' id='type-id-136'/>
    <typedef-decl name='GTask' type-id='type-id-144' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='145' column='1' id='type-id-140'/>
    <typedef-decl name='GMappedFile' type-id='type-id-143' filepath='/usr/include/glib-2.0/glib/gmappedfile.h' line='34' column='1' id='type-id-139'/>
    <function-type size-in-bits='64' hash='6fe16b214fd52931' id='type-id-134'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-137'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='3f86975b4a1e21da' id='type-id-135'>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-2018' comp-dir-path='/usr/src/debug/json-glib-1.10.8-4.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='type-id-32'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-153'/>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-124'/>
    <enum-decl name='GParamFlags' naming-typedef-id='type-id-23' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='157' column='1' hash='0d731ff2ef6aeaf8' id='type-id-154'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='G_PARAM_READABLE' value='1'/>
      <enumerator name='G_PARAM_WRITABLE' value='2'/>
      <enumerator name='G_PARAM_READWRITE' value='3'/>
      <enumerator name='G_PARAM_CONSTRUCT' value='4'/>
      <enumerator name='G_PARAM_CONSTRUCT_ONLY' value='8'/>
      <enumerator name='G_PARAM_LAX_VALIDATION' value='16'/>
      <enumerator name='G_PARAM_STATIC_NAME' value='32'/>
      <enumerator name='G_PARAM_PRIVATE' value='32'/>
      <enumerator name='G_PARAM_STATIC_NICK' value='64'/>
      <enumerator name='G_PARAM_STATIC_BLURB' value='128'/>
      <enumerator name='G_PARAM_EXPLICIT_NOTIFY' value='1073741824'/>
      <enumerator name='G_PARAM_DEPRECATED' value='-2147483648'/>
    </enum-decl>
    <enum-decl name='GSignalFlags' naming-typedef-id='type-id-87' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/gobject/gsignal.h' line='131' column='1' hash='a4eba999f6793863' id='type-id-155'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='G_SIGNAL_RUN_FIRST' value='1'/>
      <enumerator name='G_SIGNAL_RUN_LAST' value='2'/>
      <enumerator name='G_SIGNAL_RUN_CLEANUP' value='4'/>
      <enumerator name='G_SIGNAL_NO_RECURSE' value='8'/>
      <enumerator name='G_SIGNAL_DETAILED' value='16'/>
      <enumerator name='G_SIGNAL_ACTION' value='32'/>
      <enumerator name='G_SIGNAL_NO_HOOKS' value='64'/>
      <enumerator name='G_SIGNAL_MUST_COLLECT' value='128'/>
      <enumerator name='G_SIGNAL_DEPRECATED' value='256'/>
      <enumerator name='G_SIGNAL_ACCUMULATOR_FIRST_RUN' value='131072'/>
    </enum-decl>
    <enum-decl name='GVariantClass' naming-typedef-id='type-id-60' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='39' column='1' hash='d86a78244bc2f758' id='type-id-156'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='G_VARIANT_CLASS_BOOLEAN' value='98'/>
      <enumerator name='G_VARIANT_CLASS_BYTE' value='121'/>
      <enumerator name='G_VARIANT_CLASS_INT16' value='110'/>
      <enumerator name='G_VARIANT_CLASS_UINT16' value='113'/>
      <enumerator name='G_VARIANT_CLASS_INT32' value='105'/>
      <enumerator name='G_VARIANT_CLASS_UINT32' value='117'/>
      <enumerator name='G_VARIANT_CLASS_INT64' value='120'/>
      <enumerator name='G_VARIANT_CLASS_UINT64' value='116'/>
      <enumerator name='G_VARIANT_CLASS_HANDLE' value='104'/>
      <enumerator name='G_VARIANT_CLASS_DOUBLE' value='100'/>
      <enumerator name='G_VARIANT_CLASS_STRING' value='115'/>
      <enumerator name='G_VARIANT_CLASS_OBJECT_PATH' value='111'/>
      <enumerator name='G_VARIANT_CLASS_SIGNATURE' value='103'/>
      <enumerator name='G_VARIANT_CLASS_VARIANT' value='118'/>
      <enumerator name='G_VARIANT_CLASS_MAYBE' value='109'/>
      <enumerator name='G_VARIANT_CLASS_ARRAY' value='97'/>
      <enumerator name='G_VARIANT_CLASS_TUPLE' value='40'/>
      <enumerator name='G_VARIANT_CLASS_DICT_ENTRY' value='123'/>
    </enum-decl>
    <enum-decl name='JsonNodeType' naming-typedef-id='type-id-146' size-in-bits='32' alignment-in-bits='32' filepath='../json-glib/json-types.h' line='113' column='1' hash='44cb2bfba0970415' id='type-id-157'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='JSON_NODE_OBJECT' value='0'/>
      <enumerator name='JSON_NODE_ARRAY' value='1'/>
      <enumerator name='JSON_NODE_VALUE' value='2'/>
      <enumerator name='JSON_NODE_NULL' value='3'/>
    </enum-decl>
    <enum-decl name='JsonParserError' naming-typedef-id='type-id-30' size-in-bits='32' alignment-in-bits='32' filepath='../json-glib/json-parser.h' line='76' column='1' hash='76d8dacdb3ea1e48' id='type-id-158'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='JSON_PARSER_ERROR_PARSE' value='0'/>
      <enumerator name='JSON_PARSER_ERROR_TRAILING_COMMA' value='1'/>
      <enumerator name='JSON_PARSER_ERROR_MISSING_COMMA' value='2'/>
      <enumerator name='JSON_PARSER_ERROR_MISSING_COLON' value='3'/>
      <enumerator name='JSON_PARSER_ERROR_INVALID_BAREWORD' value='4'/>
      <enumerator name='JSON_PARSER_ERROR_EMPTY_MEMBER_NAME' value='5'/>
      <enumerator name='JSON_PARSER_ERROR_INVALID_DATA' value='6'/>
      <enumerator name='JSON_PARSER_ERROR_UNKNOWN' value='7'/>
      <enumerator name='JSON_PARSER_ERROR_NESTING' value='8'/>
      <enumerator name='JSON_PARSER_ERROR_INVALID_STRUCTURE' value='9'/>
      <enumerator name='JSON_PARSER_ERROR_INVALID_ASSIGNMENT' value='10'/>
    </enum-decl>
    <enum-decl name='JsonValueType' naming-typedef-id='type-id-159' size-in-bits='32' alignment-in-bits='32' filepath='../json-glib/json-types-private.h' line='40' column='1' hash='1a290c1182c09f99' id='type-id-160'>
      <underlying-type type-id='type-id-99'/>
      <enumerator name='JSON_VALUE_INVALID' value='0'/>
      <enumerator name='JSON_VALUE_INT' value='1'/>
      <enumerator name='JSON_VALUE_DOUBLE' value='2'/>
      <enumerator name='JSON_VALUE_BOOLEAN' value='3'/>
      <enumerator name='JSON_VALUE_STRING' value='4'/>
      <enumerator name='JSON_VALUE_NULL' value='5'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' hash='d7ec3bf03d3c5690' id='type-id-161'/>
    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='32' hash='cf78b6f8660229e0' id='type-id-162'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-52' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-163'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-3' hash='f782f8e0d0f60af2' id='type-id-164'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-52' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-165'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='64' hash='df5f5e8ed11926f2' id='type-id-166'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-52' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-167'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-168' size-in-bits='896' hash='6935992bffa28efe' id='type-id-169'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='type-id-52' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='type-id-170'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-168' size-in-bits='1024' hash='33354c943d48ca44' id='type-id-171'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-52' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-172'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-51'/>
    <array-type-def dimensions='1' type-id='type-id-51' size-in-bits='64' hash='8198620b8b558cae' id='type-id-173'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-52' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-167'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-71'/>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='type-id-174'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-175'/>
    <class-decl name='JsonObjectIter' is-struct='yes' naming-typedef-id='type-id-176' visibility='default' size-in-bits='512' filepath='../json-glib/json-types.h' line='425' column='1' hash='a630f1e8cb2fe3bd' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priv_pointer' type-id='type-id-164' visibility='default' filepath='../json-glib/json-types.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='priv_int' type-id='type-id-173' visibility='default' filepath='../json-glib/json-types.h' line='428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='priv_boolean' type-id='type-id-162' visibility='default' filepath='../json-glib/json-types.h' line='429' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GArray' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/garray.h' line='43' column='1' hash='da1d3f23bd1aae8f' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-19' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GCancellable' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='44' column='1' hash='1aba4482416b944a' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-104' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-180' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GClosure' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='173' column='1' hash='42fe4534f4f2d3ff' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='meta_marshal_nouse' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='n_guards' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='n_fnotifiers' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='n_inotifiers' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='in_inotify' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='floating' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='derivative_flag' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='in_marshal' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='is_invalid' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='marshal' type-id='type-id-182' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-3' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='notifiers' type-id='type-id-183' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='199' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GClosureNotifyData' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='167' column='1' hash='8a400b7d68a380b2' id='type-id-184'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-3' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='notify' type-id='type-id-185' visibility='default' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GEnumClass' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/gobject/genums.h' line='157' column='1' hash='86142c6f75375365' id='type-id-186'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type_class' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='minimum' type-id='type-id-20' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='maximum' type-id='type-id-20' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='n_values' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='values' type-id='type-id-37' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='165' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GEnumValue' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/genums.h' line='196' column='1' hash='ba03c9b134934c59' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-20' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value_name' type-id='type-id-18' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value_nick' type-id='type-id-18' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='200' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GError' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/gerror.h' line='45' column='1' hash='a8773754418f4d7e' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-55' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='code' type-id='type-id-20' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='message' type-id='type-id-19' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GFlagsClass' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/genums.h' line='178' column='1' hash='094556cf6efe4ff1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type_class' type-id='type-id-187' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mask' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='n_values' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='values' type-id='type-id-39' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='185' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GFlagsValue' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/genums.h' line='211' column='1' hash='baef399c44e1e72f' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value_name' type-id='type-id-18' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value_nick' type-id='type-id-18' visibility='default' filepath='/usr/include/glib-2.0/gobject/genums.h' line='215' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GHashTableIter' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/glib-2.0/glib/ghash.h' line='48' column='1' hash='3e0ceeb4080badb7' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy1' type-id='type-id-3' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dummy2' type-id='type-id-3' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy3' type-id='type-id-3' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dummy4' type-id='type-id-51' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dummy5' type-id='type-id-6' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dummy6' type-id='type-id-3' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GList' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/glib/glist.h' line='41' column='1' hash='5bcda368f5e9b7d5' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-3' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-56' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prev' type-id='type-id-56' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GObject' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='252' column='1' hash='db1fbbe14f2aacaf' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type_instance' type-id='type-id-195' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='qdata' type-id='type-id-196' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='258' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GOutputStream' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/goutputstream.h' line='44' column='1' hash='58d7c757a7738aff' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-104' visibility='default' filepath='/usr/include/glib-2.0/gio/goutputstream.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-198' visibility='default' filepath='/usr/include/glib-2.0/gio/goutputstream.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GParamSpec' is-struct='yes' visibility='default' size-in-bits='576' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='209' column='1' hash='30607f711855f218' id='type-id-199'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type_instance' type-id='type-id-195' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-18' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='type-id-23' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='value_type' type-id='type-id-11' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='owner_type' type-id='type-id-11' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_nick' type-id='type-id-19' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_blurb' type-id='type-id-19' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='qdata' type-id='type-id-196' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ref_count' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='param_id' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gparam.h' line='223' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GPtrArray' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/garray.h' line='55' column='1' hash='3ef698cc7cd95075' id='type-id-200'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pdata' type-id='type-id-79' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GQueue' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='49' column='1' hash='851c9cc2cb279f4e' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-56' visibility='default' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tail' type-id='type-id-56' visibility='default' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='length' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/glib/gqueue.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSList' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/gslist.h' line='41' column='1' hash='e000927a68d1ee6d' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-3' visibility='default' filepath='/usr/include/glib-2.0/glib/gslist.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-7' visibility='default' filepath='/usr/include/glib-2.0/glib/gslist.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSignalInvocationHint' is-struct='yes' visibility='default' size-in-bits='96' filepath='/usr/include/glib-2.0/gobject/gsignal.h' line='266' column='1' hash='874acad4b79d1676' id='type-id-203'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='signal_id' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/gobject/gsignal.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='detail' type-id='type-id-55' visibility='default' filepath='/usr/include/glib-2.0/gobject/gsignal.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='run_type' type-id='type-id-87' visibility='default' filepath='/usr/include/glib-2.0/gobject/gsignal.h' line='270' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GString' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/glib/gstring.h' line='45' column='1' hash='c4334d726eae4ebb' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='type-id-19' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-14' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='allocated_len' type-id='type-id-14' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeClass' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='451' column='1' hash='5069632588d09e4e' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-11' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='454' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeInstance' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='461' column='1' hash='702e9d196e69b503' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_class' type-id='type-id-207' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='464' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GValue' is-struct='yes' visibility='default' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='131' column='1' hash='61f088755dd30e61' id='type-id-208'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-11' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-209' visibility='default' filepath='/usr/include/glib-2.0/gobject/gvalue.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GVariantBuilder' is-struct='yes' visibility='default' size-in-bits='1024' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='300' column='1' hash='147ab824d7624055' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='type-id-211' visibility='default' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='310' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GVariantIter' is-struct='yes' visibility='default' size-in-bits='1024' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='271' column='1' hash='eb26a75b79c9d511' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='x' type-id='type-id-171' visibility='default' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='273' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonArray' is-struct='yes' visibility='default' size-in-bits='192' filepath='../json-glib/json-types-private.h' line='94' column='1' hash='75f6e07394d9e46a' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='elements' type-id='type-id-1' visibility='default' filepath='../json-glib/json-types-private.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-214' visibility='default' filepath='../json-glib/json-types-private.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='immutable_hash' type-id='type-id-2' visibility='default' filepath='../json-glib/json-types-private.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='immutable' type-id='type-id-6' visibility='default' filepath='../json-glib/json-types-private.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonBuilder' is-struct='yes' visibility='default' size-in-bits='256' filepath='../json-glib/json-builder.h' line='46' column='1' hash='bc2682eba5e369f5' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-104' visibility='default' filepath='../json-glib/json-builder.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-216' visibility='default' filepath='../json-glib/json-builder.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonBuilderPrivate' is-struct='yes' visibility='default' size-in-bits='192' filepath='../json-glib/json-builder.c' line='77' column='1' hash='ce0fb1a3b0b7066c' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stack' type-id='type-id-4' visibility='default' filepath='../json-glib/json-builder.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='root' type-id='type-id-28' visibility='default' filepath='../json-glib/json-builder.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='immutable' type-id='type-id-6' visibility='default' filepath='../json-glib/json-builder.c' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonGenerator' is-struct='yes' visibility='default' size-in-bits='256' filepath='../json-glib/json-generator.h' line='47' column='1' hash='393b322ca071f7e4' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-104' visibility='default' filepath='../json-glib/json-generator.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-219' visibility='default' filepath='../json-glib/json-generator.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonObject' is-struct='yes' visibility='default' size-in-bits='448' filepath='../json-glib/json-types-private.h' line='104' column='1' hash='f82d2fef01bb39c9' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='members' type-id='type-id-77' visibility='default' filepath='../json-glib/json-types-private.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-214' visibility='default' filepath='../json-glib/json-types-private.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='members_ordered' type-id='type-id-221' visibility='default' filepath='../json-glib/json-types-private.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='age' type-id='type-id-51' visibility='default' filepath='../json-glib/json-types-private.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='immutable_hash' type-id='type-id-2' visibility='default' filepath='../json-glib/json-types-private.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='immutable' type-id='type-id-6' visibility='default' filepath='../json-glib/json-types-private.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonParser' is-struct='yes' visibility='default' size-in-bits='256' filepath='../json-glib/json-parser.h' line='125' column='1' hash='bff320319c08b6ef' id='type-id-222'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-104' visibility='default' filepath='../json-glib/json-parser.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-223' visibility='default' filepath='../json-glib/json-parser.h' line='130' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_JsonValue' is-struct='yes' visibility='default' size-in-bits='192' filepath='../json-glib/json-types-private.h' line='79' column='1' hash='e03209ee5e1f0e54' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-159' visibility='default' filepath='../json-glib/json-types-private.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ref_count' type-id='type-id-214' visibility='default' filepath='../json-glib/json-types-private.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='immutable' type-id='type-id-6' visibility='default' filepath='../json-glib/json-types-private.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-225' visibility='default' filepath='../json-glib/json-types-private.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='1024' is-anonymous='yes' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='304' column='1' hash='cd389cd590112931' id='type-id-226'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='partial_magic' type-id='type-id-14' visibility='default' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-68' visibility='default' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='y' type-id='type-id-169' visibility='default' filepath='/usr/include/glib-2.0/glib/gvariant.h' line='307' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GArray' type-id='type-id-178' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/garray.h' line='39' column='1' id='type-id-227'/>
    <typedef-decl name='GBoxedCopyFunc' type-id='type-id-228' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gboxed.h' line='58' column='1' hash='fd7a63c0c6c822c4' id='type-id-229'/>
    <typedef-decl name='GBoxedFreeFunc' type-id='type-id-230' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gboxed.h' line='67' column='1' hash='fd7a63c0c6c822c4' id='type-id-231'/>
    <typedef-decl name='GCancellable' type-id='type-id-179' size-in-bits='256' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='40' column='1' id='type-id-232'/>
    <typedef-decl name='GClosure' type-id='type-id-181' size-in-bits='256' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='77' column='1' id='type-id-233'/>
    <typedef-decl name='GClosureMarshal' type-id='type-id-182' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='121' column='1' hash='fd7a63c0c6c822c4' id='type-id-234'/>
    <typedef-decl name='GClosureNotify' type-id='type-id-235' size-in-bits='64' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='101' column='1' hash='fd7a63c0c6c822c4' id='type-id-185'/>
    <typedef-decl name='GClosureNotifyData' type-id='type-id-184' size-in-bits='128' filepath='/usr/include/glib-2.0/gobject/gclosure.h' line='78' column='1' id='type-id-236'/>
    <typedef-decl name='GCompareFunc' type-id='type-id-237' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='112' column='1' hash='fd7a63c0c6c822c4' id='type-id-8'/>
    <typedef-decl name='GDestroyNotify' type-id='type-id-230' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='140' column='1' hash='fd7a63c0c6c822c4' id='type-id-34'/>
    <typedef-decl name='GEnumClass' type-id='type-id-186' size-in-bits='256' filepath='/usr/include/glib-2.0/gobject/genums.h' line='140' column='1' id='type-id-238'/>
    <typedef-decl name='GEnumValue' type-id='type-id-188' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/genums.h' line='142' column='1' id='type-id-239'/>
    <typedef-decl name='GEqualFunc' type-id='type-id-240' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='117' column='1' hash='fd7a63c0c6c822c4' id='type-id-76'/>
    <typedef-decl name='GError' type-id='type-id-189' size-in-bits='128' filepath='/usr/include/glib-2.0/glib/gerror.h' line='43' column='1' id='type-id-128'/>
    <typedef-decl name='GFlagsClass' type-id='type-id-190' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/genums.h' line='141' column='1' id='type-id-241'/>
    <typedef-decl name='GFlagsValue' type-id='type-id-191' size-in-bits='192' filepath='/usr/include/glib-2.0/gobject/genums.h' line='143' column='1' id='type-id-242'/>
    <typedef-decl name='GFunc' type-id='type-id-243' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='141' column='1' hash='fd7a63c0c6c822c4' id='type-id-57'/>
    <typedef-decl name='GHashFunc' type-id='type-id-244' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='143' column='1' hash='fd7a63c0c6c822c4' id='type-id-75'/>
    <typedef-decl name='GHashTableIter' type-id='type-id-192' size-in-bits='320' filepath='/usr/include/glib-2.0/glib/ghash.h' line='46' column='1' id='type-id-245'/>
    <typedef-decl name='GList' type-id='type-id-193' size-in-bits='192' filepath='/usr/include/glib-2.0/glib/glist.h' line='39' column='1' id='type-id-246'/>
    <typedef-decl name='GMutex' type-id='type-id-247' size-in-bits='64' filepath='/usr/include/glib-2.0/glib/gthread.h' line='53' column='1' id='type-id-248'/>
