<abi-corpus version='2.4' architecture='elf-amd-x86_64' soname='libglib-2.0.so.0'>
  <elf-needed>
    <dependency name='libpcre2-8.so.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='g_access' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_aligned_alloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_aligned_alloc0' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_aligned_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_aligned_free_sized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_allocator_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_allocator_new' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_array_append_vals' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='g_array_binary_search' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='strncasecmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strpbrk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strrchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strsignal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strspn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strstr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strtod' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strtod_l' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='syscall' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='sysconf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='textdomain' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='timegm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='tzset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ungetc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='unlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='unsetenv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uselocale' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='usleep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='utime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='waitid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='waitpid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcscoll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsxfrm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__environ' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__lsan_enable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__lsan_ignore_object' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='environ' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdin' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdout' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='../glib/gasyncqueue.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gbacktrace.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <var-decl name='stdin' type-id='type-id-1' visibility='default' filepath='/usr/include/stdio.h' line='149' column='1' elf-symbol-id='stdin'/>
    <function-decl name='perror' filepath='/usr/include/stdio.h' line='868' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='perror' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gbookmarkfile.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GMarkupParseContext' is-struct='yes' visibility='default' size-in-bits='1472' filepath='../glib/gmarkup.c' line='71' column='1' hash='8bd0669b596355da' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parser' type-id='type-id-5' visibility='default' filepath='../glib/gmarkup.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-6' visibility='default' filepath='../glib/gmarkup.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='type-id-7' visibility='default' filepath='../glib/gmarkup.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='line_number' type-id='type-id-6' visibility='default' filepath='../glib/gmarkup.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='char_number' type-id='type-id-6' visibility='default' filepath='../glib/gmarkup.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='state' type-id='type-id-8' visibility='default' filepath='../glib/gmarkup.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='user_data' type-id='type-id-9' visibility='default' filepath='../glib/gmarkup.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dnotify' type-id='type-id-10' visibility='default' filepath='../glib/gmarkup.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='partial_chunk' type-id='type-id-11' visibility='default' filepath='../glib/gmarkup.c' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='spare_chunks' type-id='type-id-12' visibility='default' filepath='../glib/gmarkup.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tag_stack' type-id='type-id-12' visibility='default' filepath='../glib/gmarkup.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tag_stack_gstr' type-id='type-id-12' visibility='default' filepath='../glib/gmarkup.c' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='spare_list_nodes' type-id='type-id-12' visibility='default' filepath='../glib/gmarkup.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='attr_names' type-id='type-id-13' visibility='default' filepath='../glib/gmarkup.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='attr_values' type-id='type-id-13' visibility='default' filepath='../glib/gmarkup.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cur_attr' type-id='type-id-6' visibility='default' filepath='../glib/gmarkup.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='alloc_attrs' type-id='type-id-6' visibility='default' filepath='../glib/gmarkup.c' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='current_text' type-id='type-id-14' visibility='default' filepath='../glib/gmarkup.c' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='current_text_len' type-id='type-id-15' visibility='default' filepath='../glib/gmarkup.c' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='current_text_end' type-id='type-id-14' visibility='default' filepath='../glib/gmarkup.c' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='start' type-id='type-id-14' visibility='default' filepath='../glib/gmarkup.c' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='iter' type-id='type-id-14' visibility='default' filepath='../glib/gmarkup.c' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='document_empty' type-id='type-id-16' visibility='default' filepath='../glib/gmarkup.c' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1217'>
        <var-decl name='parsing' type-id='type-id-16' visibility='default' filepath='../glib/gmarkup.c' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1218'>
        <var-decl name='awaiting_pop' type-id='type-id-16' visibility='default' filepath='../glib/gmarkup.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='balance' type-id='type-id-6' visibility='default' filepath='../glib/gmarkup.c' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='subparser_stack' type-id='type-id-12' visibility='default' filepath='../glib/gmarkup.c' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='subparser_element' type-id='type-id-2' visibility='default' filepath='../glib/gmarkup.c' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='held_user_data' type-id='type-id-9' visibility='default' filepath='../glib/gmarkup.c' line='120' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gbytes.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gdataset.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='type-id-17'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-16'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gdate.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='tzset' filepath='/usr/include/time.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tzset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gdatetime.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/genviron.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <var-decl name='environ' type-id='type-id-19' visibility='default' filepath='/usr/include/unistd.h' line='566' column='1' elf-symbol-id='environ'/>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gerror.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gfileutils.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-20'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-22'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/ghmac-utils.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GHmac' is-struct='yes' visibility='default' size-in-bits='192' filepath='../glib/ghmac-gnutls.c' line='44' column='1' hash='234976e3e4734072' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-24' visibility='default' filepath='../glib/ghmac-gnutls.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='digest_type' type-id='type-id-25' visibility='default' filepath='../glib/ghmac-gnutls.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hmac' type-id='type-id-26' visibility='default' filepath='../glib/ghmac-gnutls.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='digest_str' type-id='type-id-27' visibility='default' filepath='../glib/ghmac-gnutls.c' line='49' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/ghostutils.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-type size-in-bits='64' hash='26a1a614d66403fd' id='type-id-28'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/giounix.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-type size-in-bits='64' hash='965f9eef66f85871' id='type-id-29'>
      <parameter type-id='type-id-30'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/glib-init.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/glib-unix.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gmessages.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/grcbox.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gscanner.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gspawn-posix.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gspawn.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gstrfuncs.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-type size-in-bits='64' hash='d731989df7e70156' id='type-id-31'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gstring.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gstrvbuilder.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gtestutils.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GMainLoop' is-struct='yes' visibility='default' size-in-bits='128' filepath='../glib/gmain.c' line='233' column='1' hash='02aab2d030510614' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='type-id-34' visibility='default' filepath='../glib/gmain.c' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='is_running' type-id='type-id-32' visibility='default' filepath='../glib/gmain.c' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ref_count' type-id='type-id-6' visibility='default' filepath='../glib/gmain.c' line='237' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GRand' is-struct='yes' visibility='default' size-in-bits='20000' filepath='../glib/grand.c' line='116' column='1' hash='46cfc48735e9e85c' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mt' type-id='type-id-36' visibility='default' filepath='../glib/grand.c' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19968'>
        <var-decl name='mti' type-id='type-id-16' visibility='default' filepath='../glib/grand.c' line='119' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTimer' is-struct='yes' visibility='default' size-in-bits='192' filepath='../glib/gtimer.c' line='68' column='1' hash='36e441f897c80230' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-38' visibility='default' filepath='../glib/gtimer.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-38' visibility='default' filepath='../glib/gtimer.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='active' type-id='type-id-16' visibility='default' filepath='../glib/gtimer.c' line='73' column='1'/>
      </data-member>
    </class-decl>
    <function-type size-in-bits='64' hash='890fca2700b2b271' id='type-id-39'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-42'/>
    </function-type>
    <function-type size-in-bits='64' hash='140552f56530c0f0' id='type-id-43'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-45'/>
    </function-type>
    <function-type size-in-bits='64' hash='cf52f5f30d546882' id='type-id-46'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gthread.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <function-decl name='pthread_self' filepath='/usr/include/pthread.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_self' hash='e0055d99adb0e173'>
      <return type-id='type-id-48'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gthreadpool.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GAsyncQueue' is-struct='yes' visibility='default' size-in-bits='512' filepath='../glib/gasyncqueue.c' line='47' column='1' hash='71b1ebfe0eebc446' id='type-id-49'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-50' visibility='default' filepath='../glib/gasyncqueue.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cond' type-id='type-id-51' visibility='default' filepath='../glib/gasyncqueue.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='queue' type-id='type-id-52' visibility='default' filepath='../glib/gasyncqueue.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='item_free_func' type-id='type-id-10' visibility='default' filepath='../glib/gasyncqueue.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='waiting_threads' type-id='type-id-16' visibility='default' filepath='../glib/gasyncqueue.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='ref_count' type-id='type-id-6' visibility='default' filepath='../glib/gasyncqueue.c' line='54' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gtimezone.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <class-decl name='_GMappedFile' is-struct='yes' visibility='default' size-in-bits='256' filepath='../glib/gmappedfile.c' line='86' column='1' hash='50adbb145455585b' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='contents' type-id='type-id-27' visibility='default' filepath='../glib/gmappedfile.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-21' visibility='default' filepath='../glib/gmappedfile.c' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='free_func' type-id='type-id-9' visibility='default' filepath='../glib/gmappedfile.c' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ref_count' type-id='type-id-24' visibility='default' filepath='../glib/gmappedfile.c' line='91' column='1'/>
      </data-member>
    </class-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gunicollate.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gunidecomp.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gutils.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gvariant-core.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gvariant-serialiser.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gvariant.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
    <qualified-type-def type-id='type-id-54' const='yes' id='type-id-55'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-56'/>
  </abi-instr>
  <abi-instr address-size='64' path='../glib/gvarianttypeinfo.c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-17e68' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <enum-decl name='GMarkupParseFlags' naming-typedef-id='type-id-7' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gmarkup.h' line='99' column='1' hash='2f4206ad002bc99a' id='type-id-57'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_MARKUP_DEFAULT_FLAGS' value='0'/>
      <enumerator name='G_MARKUP_DO_NOT_USE_THIS_UNSUPPORTED_FLAG' value='1'/>
      <enumerator name='G_MARKUP_TREAT_CDATA_AS_TEXT' value='2'/>
      <enumerator name='G_MARKUP_PREFIX_ERROR_POSITION' value='4'/>
      <enumerator name='G_MARKUP_IGNORE_QUALIFIED' value='8'/>
    </enum-decl>
    <enum-decl name='GMarkupParseState' naming-typedef-id='type-id-8' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gmarkup.c' line='44' column='1' hash='daf14edb4017b4fd' id='type-id-59'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='STATE_START' value='0'/>
      <enumerator name='STATE_AFTER_OPEN_ANGLE' value='1'/>
      <enumerator name='STATE_AFTER_CLOSE_ANGLE' value='2'/>
      <enumerator name='STATE_AFTER_ELISION_SLASH' value='3'/>
      <enumerator name='STATE_INSIDE_OPEN_TAG_NAME' value='4'/>
      <enumerator name='STATE_INSIDE_ATTRIBUTE_NAME' value='5'/>
      <enumerator name='STATE_AFTER_ATTRIBUTE_NAME' value='6'/>
      <enumerator name='STATE_BETWEEN_ATTRIBUTES' value='7'/>
      <enumerator name='STATE_AFTER_ATTRIBUTE_EQUALS_SIGN' value='8'/>
      <enumerator name='STATE_INSIDE_ATTRIBUTE_VALUE_SQ' value='9'/>
      <enumerator name='STATE_INSIDE_ATTRIBUTE_VALUE_DQ' value='10'/>
      <enumerator name='STATE_INSIDE_TEXT' value='11'/>
      <enumerator name='STATE_AFTER_CLOSE_TAG_SLASH' value='12'/>
      <enumerator name='STATE_INSIDE_CLOSE_TAG_NAME' value='13'/>
      <enumerator name='STATE_AFTER_CLOSE_TAG_NAME' value='14'/>
      <enumerator name='STATE_INSIDE_PASSTHROUGH' value='15'/>
      <enumerator name='STATE_ERROR' value='16'/>
    </enum-decl>
    <class-decl name='_GBookmarkFile' is-struct='yes' visibility='default' size-in-bits='256' filepath='../glib/gbookmarkfile.c' line='158' column='1' hash='8aa7ce7a5ffeba74' id='type-id-60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='title' type-id='type-id-27' visibility='default' filepath='../glib/gbookmarkfile.c' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='description' type-id='type-id-27' visibility='default' filepath='../glib/gbookmarkfile.c' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='items' type-id='type-id-61' visibility='default' filepath='../glib/gbookmarkfile.c' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='items_by_uri' type-id='type-id-62' visibility='default' filepath='../glib/gbookmarkfile.c' line='167' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GMarkupParser' is-struct='yes' visibility='default' size-in-bits='320' filepath='../glib/gmarkup.h' line='151' column='1' hash='cdd0c285e8f2ab11' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start_element' type-id='type-id-64' visibility='default' filepath='../glib/gmarkup.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end_element' type-id='type-id-65' visibility='default' filepath='../glib/gmarkup.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='text' type-id='type-id-66' visibility='default' filepath='../glib/gmarkup.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='passthrough' type-id='type-id-66' visibility='default' filepath='../glib/gmarkup.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='error' type-id='type-id-67' visibility='default' filepath='../glib/gmarkup.h' line='189' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GBookmarkFile' type-id='type-id-60' size-in-bits='256' filepath='../glib/gbookmarkfile.h' line='118' column='1' id='type-id-68'/>
    <typedef-decl name='GMarkupParseContext' type-id='type-id-4' size-in-bits='1472' filepath='../glib/gmarkup.h' line='116' column='1' id='type-id-69'/>
    <typedef-decl name='GMarkupParseFlags' type-id='type-id-57' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gmarkup.h' line='105' column='1' hash='2f4206ad002bc99a' id='type-id-7'/>
    <typedef-decl name='GMarkupParseState' type-id='type-id-59' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gmarkup.c' line='62' column='1' hash='daf14edb4017b4fd' id='type-id-8'/>
    <typedef-decl name='GMarkupParser' type-id='type-id-63' size-in-bits='320' filepath='../glib/gmarkup.h' line='117' column='1' id='type-id-70'/>
    <typedef-decl name='nl_item' type-id='type-id-24' size-in-bits='32' filepath='/usr/include/nl_types.h' line='36' column='1' hash='09d17c08f594edc7' id='type-id-71'/>
    <typedef-decl name='time_t' type-id='type-id-72' size-in-bits='64' filepath='/usr/include/bits/types/time_t.h' line='10' column='1' hash='b119fe0931d2ee10' id='type-id-73'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' hash='3fc1b291b7365956' id='type-id-74'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' hash='32659252c104f06d' id='type-id-76'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' hash='2071d45626ecfc90' id='type-id-77'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' hash='318079b10c0262aa' id='type-id-13'/>
    <qualified-type-def type-id='type-id-70' const='yes' hash='a8763b698c00cbd1' id='type-id-78'/>
    <pointer-type-def type-id='type-id-78' size-in-bits='64' hash='c3738a5ce3e4cf52' id='type-id-5'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-79'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' hash='7dcccc4f20d5ac9e' id='type-id-81'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' hash='9f577e0cb45a155c' id='type-id-82'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' hash='784a05f2083b5c30' id='type-id-83'/>
    <pointer-type-def type-id='type-id-84' size-in-bits='64' hash='232fa04f890c2a5a' id='type-id-85'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-67'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-64'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-65'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-66'/>
    <class-decl name='_GDateTime' is-struct='yes' visibility='default' size-in-bits='256' filepath='../glib/gdatetime.c' line='92' column='1' hash='52d1b3d7800392e5' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='usec' type-id='type-id-38' visibility='default' filepath='../glib/gdatetime.c' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tz' type-id='type-id-91' visibility='default' filepath='../glib/gdatetime.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interval' type-id='type-id-6' visibility='default' filepath='../glib/gdatetime.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='days' type-id='type-id-92' visibility='default' filepath='../glib/gdatetime.c' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ref_count' type-id='type-id-6' visibility='default' filepath='../glib/gdatetime.c' line='104' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_bookmark_file_error_quark' mangled-name='g_bookmark_file_error_quark' filepath='../glib/gbookmarkfile.c' line='1688' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_error_quark' hash='2bb88322482ae81c'>
      <return type-id='type-id-93'/>
    </function-decl>
    <function-decl name='g_bookmark_file_new' mangled-name='g_bookmark_file_new' filepath='../glib/gbookmarkfile.c' line='1708' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_new' hash='16cc22f8befab856'>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='g_bookmark_file_copy' mangled-name='g_bookmark_file_copy' filepath='../glib/gbookmarkfile.c' line='1731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_copy' hash='1a09246cee9525e3'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='1731' column='1'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='g_bookmark_file_free' mangled-name='g_bookmark_file_free' filepath='../glib/gbookmarkfile.c' line='1764' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_free' hash='16cc22f8befab856'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='1764' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_load_from_data' mangled-name='g_bookmark_file_load_from_data' filepath='../glib/gbookmarkfile.c' line='1791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_load_from_data' hash='e3c02f60ce48fcff'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='1791' column='1'/>
      <parameter type-id='type-id-14' name='data' filepath='../glib/gbookmarkfile.c' line='1792' column='1'/>
      <parameter type-id='type-id-21' name='length' filepath='../glib/gbookmarkfile.c' line='1793' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='1794' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_load_from_file' mangled-name='g_bookmark_file_load_from_file' filepath='../glib/gbookmarkfile.c' line='1835' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_load_from_file' hash='af76295c8fcb96ff'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='1835' column='1'/>
      <parameter type-id='type-id-14' name='filename' filepath='../glib/gbookmarkfile.c' line='1836' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='1837' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_load_from_data_dirs' mangled-name='g_bookmark_file_load_from_data_dirs' filepath='../glib/gbookmarkfile.c' line='1947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_load_from_data_dirs' hash='aaddfb0b63a02ceb'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='1947' column='1'/>
      <parameter type-id='type-id-14' name='file' filepath='../glib/gbookmarkfile.c' line='1948' column='1'/>
      <parameter type-id='type-id-94' name='full_path' filepath='../glib/gbookmarkfile.c' line='1949' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='1950' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_to_data' mangled-name='g_bookmark_file_to_data' filepath='../glib/gbookmarkfile.c' line='2024' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_to_data' hash='7c9f1992bc70b991'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2024' column='1'/>
      <parameter type-id='type-id-40' name='length' filepath='../glib/gbookmarkfile.c' line='2025' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='2026' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_bookmark_file_to_file' mangled-name='g_bookmark_file_to_file' filepath='../glib/gbookmarkfile.c' line='2058' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_to_file' hash='af76295c8fcb96ff'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='1835' column='1'/>
      <parameter type-id='type-id-14' name='filename' filepath='../glib/gbookmarkfile.c' line='1836' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='1837' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_remove_item' mangled-name='g_bookmark_file_remove_item' filepath='../glib/gbookmarkfile.c' line='2154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_remove_item' hash='af76295c8fcb96ff'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='1835' column='1'/>
      <parameter type-id='type-id-14' name='filename' filepath='../glib/gbookmarkfile.c' line='1836' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='1837' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_has_item' mangled-name='g_bookmark_file_has_item' filepath='../glib/gbookmarkfile.c' line='2194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_has_item' hash='1d6e17874e403f5d'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2194' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2195' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_uris' mangled-name='g_bookmark_file_get_uris' filepath='../glib/gbookmarkfile.c' line='2218' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_uris' hash='5c5515ae1b3646ef'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2218' column='1'/>
      <parameter type-id='type-id-40' name='length' filepath='../glib/gbookmarkfile.c' line='2219' column='1'/>
      <return type-id='type-id-94'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_title' mangled-name='g_bookmark_file_set_title' filepath='../glib/gbookmarkfile.c' line='2263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_title' hash='9a34b1eb9394304c'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2263' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2264' column='1'/>
      <parameter type-id='type-id-14' name='title' filepath='../glib/gbookmarkfile.c' line='2265' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_title' mangled-name='g_bookmark_file_get_title' filepath='../glib/gbookmarkfile.c' line='2311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_title' hash='624c0d8e96d13850'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2311' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2312' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='2313' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_description' mangled-name='g_bookmark_file_set_description' filepath='../glib/gbookmarkfile.c' line='2350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_description' hash='9a34b1eb9394304c'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2263' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2264' column='1'/>
      <parameter type-id='type-id-14' name='title' filepath='../glib/gbookmarkfile.c' line='2265' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_description' mangled-name='g_bookmark_file_get_description' filepath='../glib/gbookmarkfile.c' line='2396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_description' hash='624c0d8e96d13850'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2311' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2312' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='2313' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_mime_type' mangled-name='g_bookmark_file_set_mime_type' filepath='../glib/gbookmarkfile.c' line='2433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_mime_type' hash='9a34b1eb9394304c'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2263' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2264' column='1'/>
      <parameter type-id='type-id-14' name='title' filepath='../glib/gbookmarkfile.c' line='2265' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_mime_type' mangled-name='g_bookmark_file_get_mime_type' filepath='../glib/gbookmarkfile.c' line='2478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_mime_type' hash='624c0d8e96d13850'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2311' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2312' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='2313' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_is_private' mangled-name='g_bookmark_file_set_is_private' filepath='../glib/gbookmarkfile.c' line='2522' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_is_private' hash='6ad715051b7b9d51'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2522' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2523' column='1'/>
      <parameter type-id='type-id-32' name='is_private' filepath='../glib/gbookmarkfile.c' line='2524' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_is_private' mangled-name='g_bookmark_file_get_is_private' filepath='../glib/gbookmarkfile.c' line='2563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_is_private' hash='af76295c8fcb96ff'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='1835' column='1'/>
      <parameter type-id='type-id-14' name='filename' filepath='../glib/gbookmarkfile.c' line='1836' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='1837' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_added' mangled-name='g_bookmark_file_set_added' filepath='../glib/gbookmarkfile.c' line='2609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_added' hash='74fde32e665a7c54'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2609' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2610' column='1'/>
      <parameter type-id='type-id-73' name='added' filepath='../glib/gbookmarkfile.c' line='2611' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_added_date_time' mangled-name='g_bookmark_file_set_added_date_time' filepath='../glib/gbookmarkfile.c' line='2631' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_added_date_time' hash='d024221546387116'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2631' column='1'/>
      <parameter type-id='type-id-2' name='uri' filepath='../glib/gbookmarkfile.c' line='2632' column='1'/>
      <parameter type-id='type-id-75' name='added' filepath='../glib/gbookmarkfile.c' line='2633' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_added' mangled-name='g_bookmark_file_get_added' filepath='../glib/gbookmarkfile.c' line='2672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_added' hash='34f48e5182cb8ad8'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2672' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2673' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='2674' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_added_date_time' mangled-name='g_bookmark_file_get_added_date_time' filepath='../glib/gbookmarkfile.c' line='2696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_added_date_time' hash='66074b22e47d99b6'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2696' column='1'/>
      <parameter type-id='type-id-2' name='uri' filepath='../glib/gbookmarkfile.c' line='2697' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='2698' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_modified' mangled-name='g_bookmark_file_set_modified' filepath='../glib/gbookmarkfile.c' line='2739' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_modified' hash='74fde32e665a7c54'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2609' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2610' column='1'/>
      <parameter type-id='type-id-73' name='added' filepath='../glib/gbookmarkfile.c' line='2611' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_modified_date_time' mangled-name='g_bookmark_file_set_modified_date_time' filepath='../glib/gbookmarkfile.c' line='2766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_modified_date_time' hash='d024221546387116'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2631' column='1'/>
      <parameter type-id='type-id-2' name='uri' filepath='../glib/gbookmarkfile.c' line='2632' column='1'/>
      <parameter type-id='type-id-75' name='added' filepath='../glib/gbookmarkfile.c' line='2633' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_modified' mangled-name='g_bookmark_file_get_modified' filepath='../glib/gbookmarkfile.c' line='2805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_modified' hash='34f48e5182cb8ad8'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2672' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2673' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='2674' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_modified_date_time' mangled-name='g_bookmark_file_get_modified_date_time' filepath='../glib/gbookmarkfile.c' line='2829' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_modified_date_time' hash='66074b22e47d99b6'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2696' column='1'/>
      <parameter type-id='type-id-2' name='uri' filepath='../glib/gbookmarkfile.c' line='2697' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='2698' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_visited' mangled-name='g_bookmark_file_set_visited' filepath='../glib/gbookmarkfile.c' line='2873' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_visited' hash='74fde32e665a7c54'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2609' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2610' column='1'/>
      <parameter type-id='type-id-73' name='added' filepath='../glib/gbookmarkfile.c' line='2611' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_visited_date_time' mangled-name='g_bookmark_file_set_visited_date_time' filepath='../glib/gbookmarkfile.c' line='2901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_visited_date_time' hash='d024221546387116'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2631' column='1'/>
      <parameter type-id='type-id-2' name='uri' filepath='../glib/gbookmarkfile.c' line='2632' column='1'/>
      <parameter type-id='type-id-75' name='added' filepath='../glib/gbookmarkfile.c' line='2633' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_visited' mangled-name='g_bookmark_file_get_visited' filepath='../glib/gbookmarkfile.c' line='2940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_visited' hash='34f48e5182cb8ad8'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2672' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2673' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='2674' column='1'/>
      <return type-id='type-id-73'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_visited_date_time' mangled-name='g_bookmark_file_get_visited_date_time' filepath='../glib/gbookmarkfile.c' line='2964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_visited_date_time' hash='66074b22e47d99b6'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2696' column='1'/>
      <parameter type-id='type-id-2' name='uri' filepath='../glib/gbookmarkfile.c' line='2697' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='2698' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_bookmark_file_has_group' mangled-name='g_bookmark_file_has_group' filepath='../glib/gbookmarkfile.c' line='3005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_has_group' hash='0ea90c038d5862dc'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3005' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='3006' column='1'/>
      <parameter type-id='type-id-14' name='group' filepath='../glib/gbookmarkfile.c' line='3007' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='3008' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_add_group' mangled-name='g_bookmark_file_add_group' filepath='../glib/gbookmarkfile.c' line='3053' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_add_group' hash='9a34b1eb9394304c'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='2263' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='2264' column='1'/>
      <parameter type-id='type-id-14' name='title' filepath='../glib/gbookmarkfile.c' line='2265' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_remove_group' mangled-name='g_bookmark_file_remove_group' filepath='../glib/gbookmarkfile.c' line='3102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_remove_group' hash='0ea90c038d5862dc'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3005' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='3006' column='1'/>
      <parameter type-id='type-id-14' name='group' filepath='../glib/gbookmarkfile.c' line='3007' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='3008' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_groups' mangled-name='g_bookmark_file_set_groups' filepath='../glib/gbookmarkfile.c' line='3165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_groups' hash='e195dd181d54b234'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3165' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='3166' column='1'/>
      <parameter type-id='type-id-82' name='groups' filepath='../glib/gbookmarkfile.c' line='3167' column='1'/>
      <parameter type-id='type-id-21' name='length' filepath='../glib/gbookmarkfile.c' line='3168' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_groups' mangled-name='g_bookmark_file_get_groups' filepath='../glib/gbookmarkfile.c' line='3221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_groups' hash='d19751febb07d2e9'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3221' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='3222' column='1'/>
      <parameter type-id='type-id-40' name='length' filepath='../glib/gbookmarkfile.c' line='3223' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='3224' column='1'/>
      <return type-id='type-id-94'/>
    </function-decl>
    <function-decl name='g_bookmark_file_add_application' mangled-name='g_bookmark_file_add_application' filepath='../glib/gbookmarkfile.c' line='3306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_add_application' hash='c5a6a4ab4987769f'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='4022' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='4023' column='1'/>
      <parameter type-id='type-id-14' name='href' filepath='../glib/gbookmarkfile.c' line='4024' column='1'/>
      <parameter type-id='type-id-14' name='mime_type' filepath='../glib/gbookmarkfile.c' line='4025' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_remove_application' mangled-name='g_bookmark_file_remove_application' filepath='../glib/gbookmarkfile.c' line='3370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_remove_application' hash='0ea90c038d5862dc'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3005' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='3006' column='1'/>
      <parameter type-id='type-id-14' name='group' filepath='../glib/gbookmarkfile.c' line='3007' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='3008' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_has_application' mangled-name='g_bookmark_file_has_application' filepath='../glib/gbookmarkfile.c' line='3417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_has_application' hash='0ea90c038d5862dc'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3005' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='3006' column='1'/>
      <parameter type-id='type-id-14' name='group' filepath='../glib/gbookmarkfile.c' line='3007' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='3008' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_app_info' mangled-name='g_bookmark_file_set_app_info' filepath='../glib/gbookmarkfile.c' line='3488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_app_info' hash='3b5e8bc87afb54cb'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3488' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='3489' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../glib/gbookmarkfile.c' line='3490' column='1'/>
      <parameter type-id='type-id-14' name='exec' filepath='../glib/gbookmarkfile.c' line='3491' column='1'/>
      <parameter type-id='type-id-6' name='count' filepath='../glib/gbookmarkfile.c' line='3492' column='1'/>
      <parameter type-id='type-id-73' name='stamp' filepath='../glib/gbookmarkfile.c' line='3493' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='3494' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_application_info' mangled-name='g_bookmark_file_set_application_info' filepath='../glib/gbookmarkfile.c' line='3549' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_application_info' hash='16a38c3376d6fb8d'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3549' column='1'/>
      <parameter type-id='type-id-2' name='uri' filepath='../glib/gbookmarkfile.c' line='3550' column='1'/>
      <parameter type-id='type-id-2' name='name' filepath='../glib/gbookmarkfile.c' line='3551' column='1'/>
      <parameter type-id='type-id-2' name='exec' filepath='../glib/gbookmarkfile.c' line='3552' column='1'/>
      <parameter type-id='type-id-24' name='count' filepath='../glib/gbookmarkfile.c' line='3553' column='1'/>
      <parameter type-id='type-id-75' name='stamp' filepath='../glib/gbookmarkfile.c' line='3554' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='3555' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_app_info' mangled-name='g_bookmark_file_get_app_info' filepath='../glib/gbookmarkfile.c' line='3722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_app_info' hash='e0328d3c6399545b'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3722' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='3723' column='1'/>
      <parameter type-id='type-id-14' name='name' filepath='../glib/gbookmarkfile.c' line='3724' column='1'/>
      <parameter type-id='type-id-94' name='exec' filepath='../glib/gbookmarkfile.c' line='3725' column='1'/>
      <parameter type-id='type-id-95' name='count' filepath='../glib/gbookmarkfile.c' line='3726' column='1'/>
      <parameter type-id='type-id-83' name='stamp' filepath='../glib/gbookmarkfile.c' line='3727' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='3728' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_application_info' mangled-name='g_bookmark_file_get_application_info' filepath='../glib/gbookmarkfile.c' line='3772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_application_info' hash='f0aa9e34db503307'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3772' column='1'/>
      <parameter type-id='type-id-2' name='uri' filepath='../glib/gbookmarkfile.c' line='3773' column='1'/>
      <parameter type-id='type-id-2' name='name' filepath='../glib/gbookmarkfile.c' line='3774' column='1'/>
      <parameter type-id='type-id-19' name='exec' filepath='../glib/gbookmarkfile.c' line='3775' column='1'/>
      <parameter type-id='type-id-85' name='count' filepath='../glib/gbookmarkfile.c' line='3776' column='1'/>
      <parameter type-id='type-id-76' name='stamp' filepath='../glib/gbookmarkfile.c' line='3777' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='3778' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_applications' mangled-name='g_bookmark_file_get_applications' filepath='../glib/gbookmarkfile.c' line='3864' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_applications' hash='d19751febb07d2e9'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3221' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='3222' column='1'/>
      <parameter type-id='type-id-40' name='length' filepath='../glib/gbookmarkfile.c' line='3223' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='3224' column='1'/>
      <return type-id='type-id-94'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_size' mangled-name='g_bookmark_file_get_size' filepath='../glib/gbookmarkfile.c' line='3930' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_size' hash='29056eea740b94fa'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3930' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_bookmark_file_move_item' mangled-name='g_bookmark_file_move_item' filepath='../glib/gbookmarkfile.c' line='3956' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_move_item' hash='0ea90c038d5862dc'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='3005' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='3006' column='1'/>
      <parameter type-id='type-id-14' name='group' filepath='../glib/gbookmarkfile.c' line='3007' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='3008' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bookmark_file_set_icon' mangled-name='g_bookmark_file_set_icon' filepath='../glib/gbookmarkfile.c' line='4022' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_set_icon' hash='c5a6a4ab4987769f'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='4022' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='4023' column='1'/>
      <parameter type-id='type-id-14' name='href' filepath='../glib/gbookmarkfile.c' line='4024' column='1'/>
      <parameter type-id='type-id-14' name='mime_type' filepath='../glib/gbookmarkfile.c' line='4025' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bookmark_file_get_icon' mangled-name='g_bookmark_file_get_icon' filepath='../glib/gbookmarkfile.c' line='4074' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bookmark_file_get_icon' hash='cbf0c23d984bdefc'>
      <parameter type-id='type-id-74' name='bookmark' filepath='../glib/gbookmarkfile.c' line='4074' column='1'/>
      <parameter type-id='type-id-14' name='uri' filepath='../glib/gbookmarkfile.c' line='4075' column='1'/>
      <parameter type-id='type-id-94' name='href' filepath='../glib/gbookmarkfile.c' line='4076' column='1'/>
      <parameter type-id='type-id-94' name='mime_type' filepath='../glib/gbookmarkfile.c' line='4077' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gbookmarkfile.c' line='4078' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bytes_new' mangled-name='g_bytes_new' filepath='../glib/gbytes.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_new' hash='7df0062f58f7fdb7'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='g_bytes_new_take' mangled-name='g_bytes_new_take' filepath='../glib/gbytes.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_new_take' hash='7df0062f58f7fdb7'>
      <parameter type-id='type-id-9' name='data' filepath='../glib/gbytes.c' line='173' column='1'/>
      <parameter type-id='type-id-21' name='size' filepath='../glib/gbytes.c' line='174' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='g_bytes_new_static' mangled-name='g_bytes_new_static' filepath='../glib/gbytes.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_new_static' hash='7df0062f58f7fdb7'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='g_bytes_new_with_free_func' mangled-name='g_bytes_new_with_free_func' filepath='../glib/gbytes.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_new_with_free_func' hash='859b253c19a192bd'>
      <parameter type-id='type-id-18' name='data' filepath='../glib/gbytes.c' line='223' column='1'/>
      <parameter type-id='type-id-21' name='size' filepath='../glib/gbytes.c' line='224' column='1'/>
      <parameter type-id='type-id-10' name='free_func' filepath='../glib/gbytes.c' line='225' column='1'/>
      <parameter type-id='type-id-9' name='user_data' filepath='../glib/gbytes.c' line='226' column='1'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='g_bytes_new_from_bytes' mangled-name='g_bytes_new_from_bytes' filepath='../glib/gbytes.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_new_from_bytes' hash='47e73af9acdb095f'>
      <parameter type-id='type-id-96'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='g_bytes_get_data' mangled-name='g_bytes_get_data' filepath='../glib/gbytes.c' line='317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_get_data' hash='53b8e040a1561b4d'>
      <parameter type-id='type-id-96' name='bytes' filepath='../glib/gbytes.c' line='317' column='1'/>
      <parameter type-id='type-id-40' name='size' filepath='../glib/gbytes.c' line='318' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='g_bytes_get_size' mangled-name='g_bytes_get_size' filepath='../glib/gbytes.c' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_get_size' hash='fc035d3962e55ecc'>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='g_bytes_ref' mangled-name='g_bytes_ref' filepath='../glib/gbytes.c' line='355' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_ref' hash='4d68bd56468d5778'>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-96'/>
    </function-decl>
    <function-decl name='g_bytes_unref' mangled-name='g_bytes_unref' filepath='../glib/gbytes.c' line='376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_unref' hash='2b1de74594045d6e'>
      <parameter type-id='type-id-96'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_bytes_equal' mangled-name='g_bytes_equal' filepath='../glib/gbytes.c' line='405' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_equal' hash='388da3fa973fde78'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_bytes_hash' mangled-name='g_bytes_hash' filepath='../glib/gbytes.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_hash' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_bytes_compare' mangled-name='g_bytes_compare' filepath='../glib/gbytes.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_compare' hash='388da3fa973fde78'>
      <parameter type-id='type-id-18' name='bytes1' filepath='../glib/gbytes.c' line='467' column='1'/>
      <parameter type-id='type-id-18' name='bytes2' filepath='../glib/gbytes.c' line='468' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_bytes_unref_to_data' mangled-name='g_bytes_unref_to_data' filepath='../glib/gbytes.c' line='528' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_unref_to_data' hash='53b8e040a1561b4d'>
      <parameter type-id='type-id-96' name='bytes' filepath='../glib/gbytes.c' line='528' column='1'/>
      <parameter type-id='type-id-40' name='size' filepath='../glib/gbytes.c' line='529' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_bytes_unref_to_array' mangled-name='g_bytes_unref_to_array' filepath='../glib/gbytes.c' line='579' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_unref_to_array' hash='a2c229c3f97609c6'>
      <parameter type-id='type-id-96' name='bytes' filepath='../glib/gbytes.c' line='579' column='1'/>
      <return type-id='type-id-97'/>
    </function-decl>
    <function-decl name='g_bytes_get_region' mangled-name='g_bytes_get_region' filepath='../glib/gbytes.c' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_bytes_get_region' hash='1843d77f42e0e17f'>
      <parameter type-id='type-id-96' name='bytes' filepath='../glib/gbytes.c' line='622' column='1'/>
      <parameter type-id='type-id-21' name='element_size' filepath='../glib/gbytes.c' line='623' column='1'/>
      <parameter type-id='type-id-21' name='offset' filepath='../glib/gbytes.c' line='624' column='1'/>
      <parameter type-id='type-id-21' name='n_elements' filepath='../glib/gbytes.c' line='625' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='g_get_charset' mangled-name='g_get_charset' filepath='../glib/gcharset.c' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_charset' hash='676824e04dbc8453'>
      <parameter type-id='type-id-79'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_get_codeset' mangled-name='g_get_codeset' filepath='../glib/gcharset.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_codeset' hash='a0e4fd26be68a7ef'>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_get_console_charset' mangled-name='g_get_console_charset' filepath='../glib/gcharset.c' line='362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_console_charset' hash='676824e04dbc8453'>
      <parameter type-id='type-id-79'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_get_locale_variants' mangled-name='g_get_locale_variants' filepath='../glib/gcharset.c' line='672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_locale_variants' hash='3447955569727272'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-94'/>
    </function-decl>
    <function-decl name='g_get_language_names' mangled-name='g_get_language_names' filepath='../glib/gcharset.c' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_language_names' hash='db937e60971a127f'>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-decl name='g_get_language_names_with_category' mangled-name='g_get_language_names_with_category' filepath='../glib/gcharset.c' line='800' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_language_names_with_category' hash='61c22ffa4e2a23e8'>
      <parameter type-id='type-id-14' name='category_name' filepath='../glib/gcharset.c' line='800' column='1'/>
      <return type-id='type-id-81'/>
    </function-decl>
    <function-type size-in-bits='64' hash='6cd8ef2a86c4b01b' id='type-id-86'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-98'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='a78c2d32392b412f' id='type-id-87'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-82'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='f44d66d70693207e' id='type-id-88'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='324df1235891f35f' id='type-id-89'>
      <parameter type-id='type-id-77'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-99'>
      <parameter type-id='type-id-9' name='location' filepath='../glib/gthread.c' line='729' column='1'/>
      <return type-id='type-id-32'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-100'>
      <parameter type-id='type-id-18' name='bytes1' filepath='../glib/gbytes.c' line='467' column='1'/>
      <parameter type-id='type-id-18' name='bytes2' filepath='../glib/gbytes.c' line='468' column='1'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-101'>
      <parameter type-id='type-id-9' name='location' filepath='../glib/gthread.c' line='804' column='1'/>
      <parameter type-id='type-id-9' name='result' filepath='../glib/gthread.c' line='805' column='1'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-102'>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-25fa3' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-104' size-in-bits='192' hash='ab88e63921d993ea' id='type-id-105'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-107'/>
    </array-type-def>
    <enum-decl name='GChecksumType' naming-typedef-id='type-id-25' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gchecksum.h' line='49' column='1' hash='65a6b51082168e27' id='type-id-108'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_CHECKSUM_MD5' value='0'/>
      <enumerator name='G_CHECKSUM_SHA1' value='1'/>
      <enumerator name='G_CHECKSUM_SHA256' value='2'/>
      <enumerator name='G_CHECKSUM_SHA512' value='3'/>
      <enumerator name='G_CHECKSUM_SHA384' value='4'/>
    </enum-decl>
    <enum-decl name='GDateMonth' naming-typedef-id='type-id-109' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gdate.h' line='67' column='1' hash='0fab7edf2546fae2' id='type-id-110'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_DATE_BAD_MONTH' value='0'/>
      <enumerator name='G_DATE_JANUARY' value='1'/>
      <enumerator name='G_DATE_FEBRUARY' value='2'/>
      <enumerator name='G_DATE_MARCH' value='3'/>
      <enumerator name='G_DATE_APRIL' value='4'/>
      <enumerator name='G_DATE_MAY' value='5'/>
      <enumerator name='G_DATE_JUNE' value='6'/>
      <enumerator name='G_DATE_JULY' value='7'/>
      <enumerator name='G_DATE_AUGUST' value='8'/>
      <enumerator name='G_DATE_SEPTEMBER' value='9'/>
      <enumerator name='G_DATE_OCTOBER' value='10'/>
      <enumerator name='G_DATE_NOVEMBER' value='11'/>
      <enumerator name='G_DATE_DECEMBER' value='12'/>
    </enum-decl>
    <enum-decl name='GDateWeekday' naming-typedef-id='type-id-111' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gdate.h' line='56' column='1' hash='cfdd249be7368d3b' id='type-id-112'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_DATE_BAD_WEEKDAY' value='0'/>
      <enumerator name='G_DATE_MONDAY' value='1'/>
      <enumerator name='G_DATE_TUESDAY' value='2'/>
      <enumerator name='G_DATE_WEDNESDAY' value='3'/>
      <enumerator name='G_DATE_THURSDAY' value='4'/>
      <enumerator name='G_DATE_FRIDAY' value='5'/>
      <enumerator name='G_DATE_SATURDAY' value='6'/>
      <enumerator name='G_DATE_SUNDAY' value='7'/>
    </enum-decl>
    <enum-decl name='GNormalizeMode' naming-typedef-id='type-id-113' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gunicode.h' line='968' column='1' hash='81027cb4e246e6bf' id='type-id-114'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_NORMALIZE_DEFAULT' value='0'/>
      <enumerator name='G_NORMALIZE_NFD' value='0'/>
      <enumerator name='G_NORMALIZE_DEFAULT_COMPOSE' value='1'/>
      <enumerator name='G_NORMALIZE_NFC' value='1'/>
      <enumerator name='G_NORMALIZE_ALL' value='2'/>
      <enumerator name='G_NORMALIZE_NFKD' value='2'/>
      <enumerator name='G_NORMALIZE_ALL_COMPOSE' value='3'/>
      <enumerator name='G_NORMALIZE_NFKC' value='3'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='128' hash='a03a92f254a410ca' id='type-id-116'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-117'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='160' hash='e2f027f66a3579f6' id='type-id-118'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='type-id-119'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='256' hash='32db76cb672ea621' id='type-id-120'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-121'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-115' size-in-bits='512' hash='82583b12d88c99f1' id='type-id-122'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='type-id-123'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-124' size-in-bits='512' hash='40caf5aecff8a238' id='type-id-125'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-117'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-124' size-in-bits='64' hash='cb8f1d1e29dea11b' id='type-id-126'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-127'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-124' size-in-bits='128' hash='4f22a4c5adef3064' id='type-id-128'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-129'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-124' size-in-bits='160' hash='cebc3fe9442aa2d7' id='type-id-130'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='type-id-131'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-124' size-in-bits='256' hash='049a611959030226' id='type-id-132'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-133'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='128' hash='d25a01aadb0bdb77' id='type-id-134'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-127'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-38' size-in-bits='512' hash='f67b646fc19f97f3' id='type-id-135'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-133'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-136' size-in-bits='1024' hash='b85d69cb329f2d9c' id='type-id-137'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='type-id-138'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-136' size-in-bits='512' hash='2b3b5dab2ae91373' id='type-id-139'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='type-id-123'/>
    </array-type-def>
    <class-decl name='GDataElt' is-struct='yes' naming-typedef-id='type-id-104' visibility='default' size-in-bits='192' filepath='../glib/gdataset.c' line='104' column='1' hash='e2f32064cb083833' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-93' visibility='default' filepath='../glib/gdataset.c' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-9' visibility='default' filepath='../glib/gdataset.c' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='type-id-10' visibility='default' filepath='../glib/gdataset.c' line='107' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Md5sum' is-struct='yes' naming-typedef-id='type-id-141' visibility='default' size-in-bits='832' filepath='../glib/gchecksum.c' line='66' column='1' hash='8cb3639b233f5e55' id='type-id-142'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-128' visibility='default' filepath='../glib/gchecksum.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bits' type-id='type-id-126' visibility='default' filepath='../glib/gchecksum.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='u' type-id='type-id-143' visibility='default' filepath='../glib/gchecksum.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='digest' type-id='type-id-116' visibility='default' filepath='../glib/gchecksum.c' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Sha1sum' is-struct='yes' naming-typedef-id='type-id-144' visibility='default' size-in-bits='896' filepath='../glib/gchecksum.c' line='82' column='1' hash='770c5d1cd552a967' id='type-id-145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-130' visibility='default' filepath='../glib/gchecksum.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='bits' type-id='type-id-126' visibility='default' filepath='../glib/gchecksum.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='data' type-id='type-id-125' visibility='default' filepath='../glib/gchecksum.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='digest' type-id='type-id-118' visibility='default' filepath='../glib/gchecksum.c' line='90' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Sha256sum' is-struct='yes' naming-typedef-id='type-id-146' visibility='default' size-in-bits='1088' filepath='../glib/gchecksum.c' line='96' column='1' hash='4021ced51542948c' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-132' visibility='default' filepath='../glib/gchecksum.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bits' type-id='type-id-126' visibility='default' filepath='../glib/gchecksum.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='data' type-id='type-id-139' visibility='default' filepath='../glib/gchecksum.c' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='digest' type-id='type-id-120' visibility='default' filepath='../glib/gchecksum.c' line='103' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Sha512sum' is-struct='yes' naming-typedef-id='type-id-148' visibility='default' size-in-bits='2240' filepath='../glib/gchecksum.c' line='111' column='1' hash='5e91156226976444' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='H' type-id='type-id-135' visibility='default' filepath='../glib/gchecksum.c' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='block' type-id='type-id-137' visibility='default' filepath='../glib/gchecksum.c' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='block_len' type-id='type-id-136' visibility='default' filepath='../glib/gchecksum.c' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='data_len' type-id='type-id-134' visibility='default' filepath='../glib/gchecksum.c' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='digest' type-id='type-id-122' visibility='default' filepath='../glib/gchecksum.c' line='120' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GChecksum' is-struct='yes' visibility='default' size-in-bits='2368' filepath='../glib/gchecksum.c' line='123' column='1' hash='6f2e3e9f84d83c1c' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-25' visibility='default' filepath='../glib/gchecksum.c' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='digest_str' type-id='type-id-27' visibility='default' filepath='../glib/gchecksum.c' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sum' type-id='type-id-151' visibility='default' filepath='../glib/gchecksum.c' line='134' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GData' is-struct='yes' visibility='default' size-in-bits='256' filepath='../glib/gdataset.c' line='111' column='1' hash='9b7d57a8c4033765' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='type-id-124' visibility='default' filepath='../glib/gdataset.c' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='alloc' type-id='type-id-124' visibility='default' filepath='../glib/gdataset.c' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-105' visibility='default' filepath='../glib/gdataset.c' line='115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GDate' is-struct='yes' visibility='default' size-in-bits='64' filepath='../glib/gdate.h' line='92' column='1' hash='1d3d570917edf6d3' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='julian_days' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='julian' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33'>
        <var-decl name='dmy' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34'>
        <var-decl name='day' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='month' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='44'>
        <var-decl name='year' type-id='type-id-16' visibility='default' filepath='../glib/gdate.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/include/bits/types/struct_tm.h' line='7' column='1' hash='831fa813c3806379' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-155' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GChecksum' type-id='type-id-150' size-in-bits='2368' filepath='../glib/gchecksum.h' line='57' column='1' id='type-id-156'/>
    <typedef-decl name='GChecksumType' type-id='type-id-108' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gchecksum.h' line='55' column='1' hash='65a6b51082168e27' id='type-id-25'/>
    <typedef-decl name='GData' type-id='type-id-152' size-in-bits='256' filepath='../glib/gdataset.h' line='38' column='1' id='type-id-157'/>
    <typedef-decl name='GDataElt' type-id='type-id-140' size-in-bits='192' filepath='../glib/gdataset.c' line='108' column='1' id='type-id-104'/>
    <typedef-decl name='GDataForeachFunc' type-id='type-id-158' size-in-bits='64' filepath='../glib/gdataset.h' line='40' column='1' hash='fd7a63c0c6c822c4' id='type-id-159'/>
    <typedef-decl name='GDataListUpdateAtomicFunc' type-id='type-id-160' size-in-bits='64' filepath='../glib/gdatasetprivate.h' line='75' column='1' hash='fd7a63c0c6c822c4' id='type-id-161'/>
    <typedef-decl name='GDate' type-id='type-id-153' size-in-bits='64' filepath='../glib/gdate.h' line='44' column='1' id='type-id-162'/>
    <typedef-decl name='GDateDay' type-id='type-id-136' size-in-bits='8' filepath='../glib/gdate.h' line='43' column='1' hash='6ebac62b3366db68' id='type-id-163'/>
    <typedef-decl name='GDateMonth' type-id='type-id-110' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gdate.h' line='81' column='1' hash='0fab7edf2546fae2' id='type-id-109'/>
    <typedef-decl name='GDateWeekday' type-id='type-id-112' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gdate.h' line='65' column='1' hash='cfdd249be7368d3b' id='type-id-111'/>
    <typedef-decl name='GDateYear' type-id='type-id-164' size-in-bits='16' filepath='../glib/gdate.h' line='42' column='1' hash='d7723bb93a30b11d' id='type-id-165'/>
    <typedef-decl name='GDuplicateFunc' type-id='type-id-166' size-in-bits='64' filepath='../glib/gdataset.h' line='63' column='1' hash='fd7a63c0c6c822c4' id='type-id-167'/>
    <typedef-decl name='GNormalizeMode' type-id='type-id-114' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gunicode.h' line='977' column='1' hash='81027cb4e246e6bf' id='type-id-113'/>
    <typedef-decl name='GTime' type-id='type-id-92' size-in-bits='32' filepath='../glib/gdate.h' line='41' column='1' hash='09d17c08f594edc7' id='type-id-168'/>
    <typedef-decl name='Md5sum' type-id='type-id-142' size-in-bits='832' filepath='../glib/gchecksum.c' line='77' column='1' id='type-id-141'/>
    <typedef-decl name='Sha1sum' type-id='type-id-145' size-in-bits='896' filepath='../glib/gchecksum.c' line='91' column='1' id='type-id-144'/>
    <typedef-decl name='Sha256sum' type-id='type-id-147' size-in-bits='1088' filepath='../glib/gchecksum.c' line='104' column='1' id='type-id-146'/>
    <typedef-decl name='Sha512sum' type-id='type-id-149' size-in-bits='2240' filepath='../glib/gchecksum.c' line='121' column='1' id='type-id-148'/>
    <typedef-decl name='guint16' type-id='type-id-169' size-in-bits='16' filepath='glib/glibconfig.h' line='49' column='1' hash='d7723bb93a30b11d' id='type-id-164'/>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='2240' is-anonymous='yes' filepath='../glib/gchecksum.c' line='129' column='1' hash='75bc3b255cf030f3' id='type-id-151'>
      <data-member access='public'>
        <var-decl name='md5' type-id='type-id-141' visibility='default' filepath='../glib/gchecksum.c' line='130' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sha1' type-id='type-id-144' visibility='default' filepath='../glib/gchecksum.c' line='131' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sha256' type-id='type-id-146' visibility='default' filepath='../glib/gchecksum.c' line='132' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sha512' type-id='type-id-148' visibility='default' filepath='../glib/gchecksum.c' line='133' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='512' is-anonymous='yes' filepath='../glib/gchecksum.c' line='71' column='1' hash='74a7fdde4065bf25#3' id='type-id-143'>
      <data-member access='public'>
        <var-decl name='data' type-id='type-id-122' visibility='default' filepath='../glib/gchecksum.c' line='72' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='data32' type-id='type-id-125' visibility='default' filepath='../glib/gchecksum.c' line='73' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-156' size-in-bits='64' hash='a8e5e4514d823b0f' id='type-id-170'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' hash='8091e9cab4fbe735' id='type-id-171'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' hash='9600567293ac9186' id='type-id-172'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' hash='141b65ba9d2e04c1' id='type-id-173'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' hash='3762d9fe3bfb86e8' id='type-id-174'/>
    <pointer-type-def type-id='type-id-93' size-in-bits='64' hash='61a6808aad469222' id='type-id-175'/>
    <qualified-type-def type-id='type-id-156' const='yes' hash='5c1f3b654f7bc8aa' id='type-id-176'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' hash='167268bf898aa636' id='type-id-177'/>
    <qualified-type-def type-id='type-id-162' const='yes' hash='02ab6c08d982eaf2' id='type-id-178'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' hash='0cdbf2b9798f232d' id='type-id-179'/>
    <qualified-type-def type-id='type-id-180' const='yes' hash='05513674c78bcf96' id='type-id-181'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' hash='41433aba07377a83' id='type-id-182'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' hash='1b3c90789cab8d9e' id='type-id-183'/>
    <qualified-type-def type-id='type-id-164' const='yes' hash='70c5f16e30dd9842' id='type-id-184'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' hash='e1927b449306fdb7' id='type-id-185'/>
    <qualified-type-def type-id='type-id-185' const='yes' hash='233f94f63495a0eb' id='type-id-186'/>
    <qualified-type-def type-id='type-id-73' const='yes' hash='3d3ed5b21cd59821' id='type-id-187'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' hash='5933014f14812f40' id='type-id-188'/>
    <qualified-type-def type-id='type-id-188' restrict='yes' hash='ba279bf62b26c900' id='type-id-189'/>
    <qualified-type-def type-id='type-id-154' const='yes' hash='6d30d2c0485b21b8' id='type-id-190'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' hash='934b82f269d593b3' id='type-id-191'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-160'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-166'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' hash='54c1e9f81ec7a1db' id='type-id-195'/>
    <qualified-type-def type-id='type-id-195' restrict='yes' hash='eef45206c892c86b' id='type-id-196'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' hash='0450557ac0931bcf' id='type-id-197'/>
    <qualified-type-def type-id='type-id-197' restrict='yes' hash='757fb5c6c05e30f5' id='type-id-198'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-158'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-201'/>
    <class-decl name='_GIConv' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-200'/>
    <function-decl name='g_checksum_type_get_length' mangled-name='g_checksum_type_get_length' filepath='../glib/gchecksum.c' line='1422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_type_get_length' hash='06987a19cff2df68'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='g_checksum_new' mangled-name='g_checksum_new' filepath='../glib/gchecksum.c' line='1475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_new' hash='9c810460e5ade8db'>
      <parameter type-id='type-id-25' name='checksum_type' filepath='../glib/gchecksum.c' line='1475' column='1'/>
      <return type-id='type-id-170'/>
    </function-decl>
    <function-decl name='g_checksum_reset' mangled-name='g_checksum_reset' filepath='../glib/gchecksum.c' line='1499' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_reset' hash='ad76814c85f94b1d'>
      <parameter type-id='type-id-170' name='checksum' filepath='../glib/gchecksum.c' line='1499' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_checksum_copy' mangled-name='g_checksum_copy' filepath='../glib/gchecksum.c' line='1543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_copy' hash='4df470d353355fb2'>
      <parameter type-id='type-id-177' name='checksum' filepath='../glib/gchecksum.c' line='1543' column='1'/>
      <return type-id='type-id-170'/>
    </function-decl>
    <function-decl name='g_checksum_free' mangled-name='g_checksum_free' filepath='../glib/gchecksum.c' line='1566' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_free' hash='ad76814c85f94b1d'>
      <parameter type-id='type-id-170' name='checksum' filepath='../glib/gchecksum.c' line='1499' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_checksum_update' mangled-name='g_checksum_update' filepath='../glib/gchecksum.c' line='1628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_update' hash='eb518f9f45513fb3'>
      <parameter type-id='type-id-170' name='checksum' filepath='../glib/gchecksum.c' line='1628' column='1'/>
      <parameter type-id='type-id-202' name='data' filepath='../glib/gchecksum.c' line='1629' column='1'/>
      <parameter type-id='type-id-15' name='length' filepath='../glib/gchecksum.c' line='1630' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_checksum_get_string' mangled-name='g_checksum_get_string' filepath='../glib/gchecksum.c' line='1663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_get_string' hash='a4fcc2410179f271'>
      <parameter type-id='type-id-170' name='checksum' filepath='../glib/gchecksum.c' line='1663' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_checksum_get_digest' mangled-name='g_checksum_get_digest' filepath='../glib/gchecksum.c' line='1720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_checksum_get_digest' hash='addc9d0c6b977ce1'>
      <parameter type-id='type-id-170' name='checksum' filepath='../glib/gchecksum.c' line='1720' column='1'/>
      <parameter type-id='type-id-203' name='buffer' filepath='../glib/gchecksum.c' line='1721' column='1'/>
      <parameter type-id='type-id-40' name='digest_len' filepath='../glib/gchecksum.c' line='1722' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_compute_checksum_for_data' mangled-name='g_compute_checksum_for_data' filepath='../glib/gchecksum.c' line='1811' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_compute_checksum_for_data' hash='5cbf26953ecaebaf'>
      <parameter type-id='type-id-25' name='checksum_type' filepath='../glib/gchecksum.c' line='1811' column='1'/>
      <parameter type-id='type-id-202' name='data' filepath='../glib/gchecksum.c' line='1812' column='1'/>
      <parameter type-id='type-id-21' name='length' filepath='../glib/gchecksum.c' line='1813' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_compute_checksum_for_string' mangled-name='g_compute_checksum_for_string' filepath='../glib/gchecksum.c' line='1848' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_compute_checksum_for_string' hash='6ccd534188630be4'>
      <parameter type-id='type-id-25' name='checksum_type' filepath='../glib/gchecksum.c' line='1848' column='1'/>
      <parameter type-id='type-id-14' name='str' filepath='../glib/gchecksum.c' line='1849' column='1'/>
      <parameter type-id='type-id-15' name='length' filepath='../glib/gchecksum.c' line='1850' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_compute_checksum_for_bytes' mangled-name='g_compute_checksum_for_bytes' filepath='../glib/gchecksum.c' line='1883' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_compute_checksum_for_bytes' hash='a5060c9e84fd1686'>
      <parameter type-id='type-id-25' name='checksum_type' filepath='../glib/gchecksum.c' line='1883' column='1'/>
      <parameter type-id='type-id-96' name='data' filepath='../glib/gchecksum.c' line='1884' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_convert_error_quark' mangled-name='g_convert_error_quark' filepath='../glib/gconvert.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_convert_error_quark' hash='2bb88322482ae81c'>
      <return type-id='type-id-93'/>
    </function-decl>
    <function-decl name='g_iconv_open' mangled-name='g_iconv_open' filepath='../glib/gconvert.c' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_iconv_open' hash='2931cb4d7a0438af'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-204'/>
    </function-decl>
    <function-decl name='g_iconv' mangled-name='g_iconv' filepath='../glib/gconvert.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_iconv' hash='be78efc5f736fd4c'>
      <parameter type-id='type-id-204'/>
      <parameter type-id='type-id-94'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-94'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='g_iconv_close' mangled-name='g_iconv_close' filepath='../glib/gconvert.c' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_iconv_close' hash='388da3fa973fde78'>
      <parameter type-id='type-id-204'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_convert_with_iconv' mangled-name='g_convert_with_iconv' filepath='../glib/gconvert.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_convert_with_iconv' hash='814c705f84e8a804'>
      <parameter type-id='type-id-14' name='str' filepath='../glib/gconvert.c' line='300' column='1'/>
      <parameter type-id='type-id-15' name='len' filepath='../glib/gconvert.c' line='301' column='1'/>
      <parameter type-id='type-id-204' name='converter' filepath='../glib/gconvert.c' line='302' column='1'/>
      <parameter type-id='type-id-40' name='bytes_read' filepath='../glib/gconvert.c' line='303' column='1'/>
      <parameter type-id='type-id-40' name='bytes_written' filepath='../glib/gconvert.c' line='304' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gconvert.c' line='305' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_convert' mangled-name='g_convert' filepath='../glib/gconvert.c' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_convert' hash='4e9257d98cd2fa44'>
      <parameter type-id='type-id-14' name='str' filepath='../glib/gconvert.c' line='466' column='1'/>
      <parameter type-id='type-id-15' name='len' filepath='../glib/gconvert.c' line='467' column='1'/>
      <parameter type-id='type-id-14' name='to_codeset' filepath='../glib/gconvert.c' line='468' column='1'/>
      <parameter type-id='type-id-14' name='from_codeset' filepath='../glib/gconvert.c' line='469' column='1'/>
      <parameter type-id='type-id-40' name='bytes_read' filepath='../glib/gconvert.c' line='470' column='1'/>
      <parameter type-id='type-id-40' name='bytes_written' filepath='../glib/gconvert.c' line='471' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gconvert.c' line='472' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_convert_with_fallback' mangled-name='g_convert_with_fallback' filepath='../glib/gconvert.c' line='552' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_convert_with_fallback' hash='794a5ed01b61affb'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_locale_to_utf8' mangled-name='g_locale_to_utf8' filepath='../glib/gconvert.c' line='914' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_locale_to_utf8' hash='814c705f84e8a804'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_locale_from_utf8' mangled-name='g_locale_from_utf8' filepath='../glib/gconvert.c' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_locale_from_utf8' hash='814c705f84e8a804'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_get_filename_charsets' mangled-name='g_get_filename_charsets' filepath='../glib/gconvert.c' line='1079' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_filename_charsets' hash='ac17b442d17d2a6f'>
      <parameter type-id='type-id-183' name='filename_charsets' filepath='../glib/gconvert.c' line='1079' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_filename_to_utf8' mangled-name='g_filename_to_utf8' filepath='../glib/gconvert.c' line='1219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_filename_to_utf8' hash='814c705f84e8a804'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_filename_from_utf8' mangled-name='g_filename_from_utf8' filepath='../glib/gconvert.c' line='1271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_filename_from_utf8' hash='814c705f84e8a804'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_filename_from_uri' mangled-name='g_filename_from_uri' filepath='../glib/gconvert.c' line='1598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_filename_from_uri' hash='ef0d749ccc66e2df'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-94'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_filename_to_uri' mangled-name='g_filename_to_uri' filepath='../glib/gconvert.c' line='1743' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_filename_to_uri' hash='f115b873d35da554'>
      <parameter type-id='type-id-14' name='filename' filepath='../glib/gconvert.c' line='1743' column='1'/>
      <parameter type-id='type-id-14' name='hostname' filepath='../glib/gconvert.c' line='1744' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gconvert.c' line='1745' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_uri_list_extract_uris' mangled-name='g_uri_list_extract_uris' filepath='../glib/gconvert.c' line='1794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_uri_list_extract_uris' hash='3447955569727272'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-94'/>
    </function-decl>
    <function-decl name='g_filename_display_basename' mangled-name='g_filename_display_basename' filepath='../glib/gconvert.c' line='1869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_filename_display_basename' hash='e43aee0eb551322a'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_filename_display_name' mangled-name='g_filename_display_name' filepath='../glib/gconvert.c' line='1909' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_filename_display_name' hash='e43aee0eb551322a'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <typedef-decl name='GIConv' type-id='type-id-201' size-in-bits='64' filepath='../glib/gconvert.h' line='85' column='1' id='type-id-204'/>
    <function-decl name='g_datalist_clear' mangled-name='g_datalist_clear' filepath='../glib/gdataset.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_clear' hash='95dde6da79185d3b'>
      <parameter type-id='type-id-172'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_dataset_destroy' mangled-name='g_dataset_destroy' filepath='../glib/gdataset.c' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dataset_destroy' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-18' name='dataset_location' filepath='../glib/gdataset.c' line='583' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_datalist_id_remove_multiple' mangled-name='g_datalist_id_remove_multiple' filepath='../glib/gdataset.c' line='727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_id_remove_multiple' hash='ecc984dfc6bf620c'>
      <parameter type-id='type-id-172' name='datalist' filepath='../glib/gdataset.c' line='727' column='1'/>
      <parameter type-id='type-id-175' name='keys' filepath='../glib/gdataset.c' line='728' column='1'/>
      <parameter type-id='type-id-21' name='n_keys' filepath='../glib/gdataset.c' line='729' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_dataset_id_set_data_full' mangled-name='g_dataset_id_set_data_full' filepath='../glib/gdataset.c' line='863' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dataset_id_set_data_full' hash='61a201e3cde13f2f'>
      <parameter type-id='type-id-18' name='dataset_location' filepath='../glib/gdataset.c' line='863' column='1'/>
      <parameter type-id='type-id-93' name='key_id' filepath='../glib/gdataset.c' line='864' column='1'/>
      <parameter type-id='type-id-9' name='data' filepath='../glib/gdataset.c' line='865' column='1'/>
      <parameter type-id='type-id-10' name='destroy_func' filepath='../glib/gdataset.c' line='866' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_datalist_id_set_data_full' mangled-name='g_datalist_id_set_data_full' filepath='../glib/gdataset.c' line='967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_id_set_data_full' hash='29ea89c16fda2a0c'>
      <parameter type-id='type-id-172' name='datalist' filepath='../glib/gdataset.c' line='967' column='1'/>
      <parameter type-id='type-id-93' name='key_id' filepath='../glib/gdataset.c' line='968' column='1'/>
      <parameter type-id='type-id-9' name='data' filepath='../glib/gdataset.c' line='969' column='1'/>
      <parameter type-id='type-id-10' name='destroy_func' filepath='../glib/gdataset.c' line='970' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_dataset_id_remove_no_notify' mangled-name='g_dataset_id_remove_no_notify' filepath='../glib/gdataset.c' line='1005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dataset_id_remove_no_notify' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-18' name='dataset_location' filepath='../glib/gdataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-93' name='key_id' filepath='../glib/gdataset.c' line='1006' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_datalist_id_remove_no_notify' mangled-name='g_datalist_id_remove_no_notify' filepath='../glib/gdataset.c' line='1048' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_id_remove_no_notify' hash='cc8b8ef221b7dabe'>
      <parameter type-id='type-id-172' name='datalist' filepath='../glib/gdataset.c' line='1048' column='1'/>
      <parameter type-id='type-id-93' name='key_id' filepath='../glib/gdataset.c' line='1049' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_dataset_id_get_data' mangled-name='g_dataset_id_get_data' filepath='../glib/gdataset.c' line='1217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dataset_id_get_data' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-18' name='dataset_location' filepath='../glib/gdataset.c' line='1005' column='1'/>
      <parameter type-id='type-id-93' name='key_id' filepath='../glib/gdataset.c' line='1006' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_datalist_id_get_data' mangled-name='g_datalist_id_get_data' filepath='../glib/gdataset.c' line='1252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_id_get_data' hash='cc8b8ef221b7dabe'>
      <parameter type-id='type-id-172' name='datalist' filepath='../glib/gdataset.c' line='1048' column='1'/>
      <parameter type-id='type-id-93' name='key_id' filepath='../glib/gdataset.c' line='1049' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_datalist_id_dup_data' mangled-name='g_datalist_id_dup_data' filepath='../glib/gdataset.c' line='1301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_id_dup_data' hash='29ea89c16fda2a0c'>
      <parameter type-id='type-id-172' name='datalist' filepath='../glib/gdataset.c' line='1301' column='1'/>
      <parameter type-id='type-id-93' name='key_id' filepath='../glib/gdataset.c' line='1302' column='1'/>
      <parameter type-id='type-id-167' name='dup_func' filepath='../glib/gdataset.c' line='1303' column='1'/>
      <parameter type-id='type-id-9' name='user_data' filepath='../glib/gdataset.c' line='1304' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_datalist_id_replace_data' mangled-name='g_datalist_id_replace_data' filepath='../glib/gdataset.c' line='1356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_id_replace_data' hash='0ef151269124106a'>
      <parameter type-id='type-id-172' name='datalist' filepath='../glib/gdataset.c' line='1356' column='1'/>
      <parameter type-id='type-id-93' name='key_id' filepath='../glib/gdataset.c' line='1357' column='1'/>
      <parameter type-id='type-id-9' name='oldval' filepath='../glib/gdataset.c' line='1358' column='1'/>
      <parameter type-id='type-id-9' name='newval' filepath='../glib/gdataset.c' line='1359' column='1'/>
      <parameter type-id='type-id-10' name='destroy' filepath='../glib/gdataset.c' line='1360' column='1'/>
      <parameter type-id='type-id-174' name='old_destroy' filepath='../glib/gdataset.c' line='1361' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_datalist_get_data' mangled-name='g_datalist_get_data' filepath='../glib/gdataset.c' line='1431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_get_data' hash='24cddc1ff9ca508b'>
      <parameter type-id='type-id-172' name='datalist' filepath='../glib/gdataset.c' line='1431' column='1'/>
      <parameter type-id='type-id-14' name='key' filepath='../glib/gdataset.c' line='1432' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_dataset_foreach' mangled-name='g_dataset_foreach' filepath='../glib/gdataset.c' line='1519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dataset_foreach' hash='5695f5ce05a4c55f'>
      <parameter type-id='type-id-18' name='dataset_location' filepath='../glib/gdataset.c' line='1519' column='1'/>
      <parameter type-id='type-id-159' name='func' filepath='../glib/gdataset.c' line='1520' column='1'/>
      <parameter type-id='type-id-9' name='user_data' filepath='../glib/gdataset.c' line='1521' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_datalist_foreach' mangled-name='g_datalist_foreach' filepath='../glib/gdataset.c' line='1560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_foreach' hash='a249b84ab098e0df'>
      <parameter type-id='type-id-172' name='datalist' filepath='../glib/gdataset.c' line='1560' column='1'/>
      <parameter type-id='type-id-159' name='func' filepath='../glib/gdataset.c' line='1561' column='1'/>
      <parameter type-id='type-id-9' name='user_data' filepath='../glib/gdataset.c' line='1562' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_datalist_init' mangled-name='g_datalist_init' filepath='../glib/gdataset.c' line='1609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_init' hash='95dde6da79185d3b'>
      <parameter type-id='type-id-172'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_datalist_set_flags' mangled-name='g_datalist_set_flags' filepath='../glib/gdataset.c' line='1635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_set_flags' hash='cc8b8ef221b7dabe'>
      <parameter type-id='type-id-172' name='datalist' filepath='../glib/gdataset.c' line='1635' column='1'/>
      <parameter type-id='type-id-16' name='flags' filepath='../glib/gdataset.c' line='1636' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_datalist_unset_flags' mangled-name='g_datalist_unset_flags' filepath='../glib/gdataset.c' line='1658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_unset_flags' hash='cc8b8ef221b7dabe'>
      <parameter type-id='type-id-172' name='datalist' filepath='../glib/gdataset.c' line='1635' column='1'/>
      <parameter type-id='type-id-16' name='flags' filepath='../glib/gdataset.c' line='1636' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_datalist_get_flags' mangled-name='g_datalist_get_flags' filepath='../glib/gdataset.c' line='1679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_datalist_get_flags' hash='61423974899161d7'>
      <parameter type-id='type-id-172' name='datalist' filepath='../glib/gdataset.c' line='1679' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_date_new' mangled-name='g_date_new' filepath='../glib/gdate.c' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_new' hash='127d8fffb27c967b'>
      <return type-id='type-id-173'/>
    </function-decl>
    <function-decl name='g_date_new_dmy' mangled-name='g_date_new_dmy' filepath='../glib/gdate.c' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_new_dmy' hash='ee3821b4814e6554'>
      <parameter type-id='type-id-163' name='day' filepath='../glib/gdate.c' line='286' column='1'/>
      <parameter type-id='type-id-109' name='m' filepath='../glib/gdate.c' line='287' column='1'/>
      <parameter type-id='type-id-165' name='y' filepath='../glib/gdate.c' line='288' column='1'/>
      <return type-id='type-id-173'/>
    </function-decl>
    <function-decl name='g_date_new_julian' mangled-name='g_date_new_julian' filepath='../glib/gdate.c' line='321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_new_julian' hash='4c19e819cfa286be'>
      <parameter type-id='type-id-124' name='julian_day' filepath='../glib/gdate.c' line='321' column='1'/>
      <return type-id='type-id-173'/>
    </function-decl>
    <function-decl name='g_date_free' mangled-name='g_date_free' filepath='../glib/gdate.c' line='345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_free' hash='127d8fffb27c967b'>
      <parameter type-id='type-id-173' name='date' filepath='../glib/gdate.c' line='345' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_copy' mangled-name='g_date_copy' filepath='../glib/gdate.c' line='365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_copy' hash='c873ae32ff9ce39c'>
      <parameter type-id='type-id-179' name='date' filepath='../glib/gdate.c' line='365' column='1'/>
      <return type-id='type-id-173'/>
    </function-decl>
    <function-decl name='g_date_valid' mangled-name='g_date_valid' filepath='../glib/gdate.c' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_valid' hash='0fab2e57868378ce'>
      <parameter type-id='type-id-179' name='d' filepath='../glib/gdate.c' line='392' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_valid_month' mangled-name='g_date_valid_month' filepath='../glib/gdate.c' line='421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_valid_month' hash='e3138ce1b902081a'>
      <parameter type-id='type-id-109' name='m' filepath='../glib/gdate.c' line='421' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_valid_year' mangled-name='g_date_valid_year' filepath='../glib/gdate.c' line='436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_valid_year' hash='eaefd76559d626dc'>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_valid_day' mangled-name='g_date_valid_day' filepath='../glib/gdate.c' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_valid_day' hash='441b0fd3e3aff7f3'>
      <parameter type-id='type-id-163' name='d' filepath='../glib/gdate.c' line='452' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_valid_weekday' mangled-name='g_date_valid_weekday' filepath='../glib/gdate.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_valid_weekday' hash='7d4b9760c4e697fa'>
      <parameter type-id='type-id-111' name='w' filepath='../glib/gdate.c' line='467' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_valid_julian' mangled-name='g_date_valid_julian' filepath='../glib/gdate.c' line='482' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_valid_julian' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-124' name='j' filepath='../glib/gdate.c' line='482' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_valid_dmy' mangled-name='g_date_valid_dmy' filepath='../glib/gdate.c' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_valid_dmy' hash='7f89fe16cd3b5918'>
      <parameter type-id='type-id-163' name='d' filepath='../glib/gdate.c' line='500' column='1'/>
      <parameter type-id='type-id-109' name='m' filepath='../glib/gdate.c' line='501' column='1'/>
      <parameter type-id='type-id-165' name='y' filepath='../glib/gdate.c' line='502' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_get_weekday' mangled-name='g_date_get_weekday' filepath='../glib/gdate.c' line='609' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_weekday' hash='66dca70e5de92dc2'>
      <parameter type-id='type-id-179'/>
      <return type-id='type-id-111'/>
    </function-decl>
    <function-decl name='g_date_get_month' mangled-name='g_date_get_month' filepath='../glib/gdate.c' line='630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_month' hash='fe4331f8bf3969d9'>
      <parameter type-id='type-id-179'/>
      <return type-id='type-id-109'/>
    </function-decl>
    <function-decl name='g_date_get_year' mangled-name='g_date_get_year' filepath='../glib/gdate.c' line='651' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_year' hash='173513845b4a6103'>
      <parameter type-id='type-id-179' name='d' filepath='../glib/gdate.c' line='651' column='1'/>
      <return type-id='type-id-165'/>
    </function-decl>
    <function-decl name='g_date_get_day' mangled-name='g_date_get_day' filepath='../glib/gdate.c' line='672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_day' hash='0aca493a423de3ac'>
      <parameter type-id='type-id-179'/>
      <return type-id='type-id-163'/>
    </function-decl>
    <function-decl name='g_date_get_julian' mangled-name='g_date_get_julian' filepath='../glib/gdate.c' line='696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_julian' hash='bc92e6d0f22c5992'>
      <parameter type-id='type-id-179'/>
      <return type-id='type-id-124'/>
    </function-decl>
    <function-decl name='g_date_get_day_of_year' mangled-name='g_date_get_day_of_year' filepath='../glib/gdate.c' line='718' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_day_of_year' hash='bc92e6d0f22c5992'>
      <parameter type-id='type-id-179' name='d' filepath='../glib/gdate.c' line='821' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_date_get_monday_week_of_year' mangled-name='g_date_get_monday_week_of_year' filepath='../glib/gdate.c' line='745' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_monday_week_of_year' hash='bc92e6d0f22c5992'>
      <parameter type-id='type-id-179' name='d' filepath='../glib/gdate.c' line='821' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_date_get_sunday_week_of_year' mangled-name='g_date_get_sunday_week_of_year' filepath='../glib/gdate.c' line='761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_sunday_week_of_year' hash='bc92e6d0f22c5992'>
      <parameter type-id='type-id-179' name='d' filepath='../glib/gdate.c' line='821' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_date_get_week_of_year' mangled-name='g_date_get_week_of_year' filepath='../glib/gdate.c' line='788' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_week_of_year' hash='3154e0c63715e7a0'>
      <parameter type-id='type-id-179' name='date' filepath='../glib/gdate.c' line='788' column='1'/>
      <parameter type-id='type-id-111' name='first_day_of_week' filepath='../glib/gdate.c' line='789' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_date_get_iso8601_week_of_year' mangled-name='g_date_get_iso8601_week_of_year' filepath='../glib/gdate.c' line='821' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_iso8601_week_of_year' hash='bc92e6d0f22c5992'>
      <parameter type-id='type-id-179' name='d' filepath='../glib/gdate.c' line='821' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_date_days_between' mangled-name='g_date_days_between' filepath='../glib/gdate.c' line='857' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_days_between' hash='c17b3276536d97d1'>
      <parameter type-id='type-id-179' name='d1' filepath='../glib/gdate.c' line='857' column='1'/>
      <parameter type-id='type-id-179' name='d2' filepath='../glib/gdate.c' line='858' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_clear' mangled-name='g_date_clear' filepath='../glib/gdate.c' line='877' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_clear' hash='4c19e819cfa286be'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_set_parse' mangled-name='g_date_set_parse' filepath='../glib/gdate.c' line='1249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_set_parse' hash='ad6d30f12394b84a'>
      <parameter type-id='type-id-173' name='d' filepath='../glib/gdate.c' line='1249' column='1'/>
      <parameter type-id='type-id-14' name='str' filepath='../glib/gdate.c' line='1250' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_set_time_t' mangled-name='g_date_set_time_t' filepath='../glib/gdate.c' line='1443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_set_time_t' hash='259fc5e4d35b076b'>
      <parameter type-id='type-id-173' name='date' filepath='../glib/gdate.c' line='1443' column='1'/>
      <parameter type-id='type-id-73' name='timet' filepath='../glib/gdate.c' line='1444' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_set_time' mangled-name='g_date_set_time' filepath='../glib/gdate.c' line='1491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_set_time' hash='a103180d5da518fc'>
      <parameter type-id='type-id-173' name='date' filepath='../glib/gdate.c' line='1491' column='1'/>
      <parameter type-id='type-id-168' name='time_' filepath='../glib/gdate.c' line='1492' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_set_time_val' mangled-name='g_date_set_time_val' filepath='../glib/gdate.c' line='1515' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_set_time_val' hash='04143a0f9d94a5d5'>
      <parameter type-id='type-id-173' name='date' filepath='../glib/gdate.c' line='1515' column='1'/>
      <parameter type-id='type-id-205' name='timeval' filepath='../glib/gdate.c' line='1516' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_set_month' mangled-name='g_date_set_month' filepath='../glib/gdate.c' line='1531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_set_month' hash='0ac41350fdab7dd2'>
      <parameter type-id='type-id-173' name='d' filepath='../glib/gdate.c' line='1531' column='1'/>
      <parameter type-id='type-id-109' name='m' filepath='../glib/gdate.c' line='1532' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_set_day' mangled-name='g_date_set_day' filepath='../glib/gdate.c' line='1557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_set_day' hash='6c9a9fa253aa8a33'>
      <parameter type-id='type-id-173' name='d' filepath='../glib/gdate.c' line='1557' column='1'/>
      <parameter type-id='type-id-163' name='day' filepath='../glib/gdate.c' line='1558' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_set_year' mangled-name='g_date_set_year' filepath='../glib/gdate.c' line='1583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_set_year' hash='e7bdcb03195d29f4'>
      <parameter type-id='type-id-173' name='d' filepath='../glib/gdate.c' line='1583' column='1'/>
      <parameter type-id='type-id-165' name='y' filepath='../glib/gdate.c' line='1584' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_set_dmy' mangled-name='g_date_set_dmy' filepath='../glib/gdate.c' line='1613' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_set_dmy' hash='ee3821b4814e6554'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_set_julian' mangled-name='g_date_set_julian' filepath='../glib/gdate.c' line='1638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_set_julian' hash='4c19e819cfa286be'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-124'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_is_first_of_month' mangled-name='g_date_is_first_of_month' filepath='../glib/gdate.c' line='1659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_is_first_of_month' hash='0fab2e57868378ce'>
      <parameter type-id='type-id-179' name='d' filepath='../glib/gdate.c' line='392' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_is_last_of_month' mangled-name='g_date_is_last_of_month' filepath='../glib/gdate.c' line='1682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_is_last_of_month' hash='0fab2e57868378ce'>
      <parameter type-id='type-id-179' name='d' filepath='../glib/gdate.c' line='392' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_add_days' mangled-name='g_date_add_days' filepath='../glib/gdate.c' line='1709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_add_days' hash='4c19e819cfa286be'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_subtract_days' mangled-name='g_date_subtract_days' filepath='../glib/gdate.c' line='1734' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_subtract_days' hash='4c19e819cfa286be'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_add_months' mangled-name='g_date_add_months' filepath='../glib/gdate.c' line='1761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_add_months' hash='4c19e819cfa286be'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_subtract_months' mangled-name='g_date_subtract_months' filepath='../glib/gdate.c' line='1806' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_subtract_months' hash='4c19e819cfa286be'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_add_years' mangled-name='g_date_add_years' filepath='../glib/gdate.c' line='1855' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_add_years' hash='4c19e819cfa286be'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_subtract_years' mangled-name='g_date_subtract_years' filepath='../glib/gdate.c' line='1889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_subtract_years' hash='4c19e819cfa286be'>
      <parameter type-id='type-id-173'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_is_leap_year' mangled-name='g_date_is_leap_year' filepath='../glib/gdate.c' line='1925' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_is_leap_year' hash='eaefd76559d626dc'>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_get_days_in_month' mangled-name='g_date_get_days_in_month' filepath='../glib/gdate.c' line='1944' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_days_in_month' hash='e0a41cfbbb44050d'>
      <parameter type-id='type-id-109'/>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-136'/>
    </function-decl>
    <function-decl name='g_date_get_monday_weeks_in_year' mangled-name='g_date_get_monday_weeks_in_year' filepath='../glib/gdate.c' line='1972' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_monday_weeks_in_year' hash='c7a1d95689d52c41'>
      <parameter type-id='type-id-165' name='year' filepath='../glib/gdate.c' line='1972' column='1'/>
      <return type-id='type-id-136'/>
    </function-decl>
    <function-decl name='g_date_get_sunday_weeks_in_year' mangled-name='g_date_get_sunday_weeks_in_year' filepath='../glib/gdate.c' line='1992' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_sunday_weeks_in_year' hash='c7a1d95689d52c41'>
      <parameter type-id='type-id-165' name='year' filepath='../glib/gdate.c' line='1972' column='1'/>
      <return type-id='type-id-136'/>
    </function-decl>
    <function-decl name='g_date_get_weeks_in_year' mangled-name='g_date_get_weeks_in_year' filepath='../glib/gdate.c' line='2019' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_get_weeks_in_year' hash='04913a1122590d68'>
      <parameter type-id='type-id-165' name='year' filepath='../glib/gdate.c' line='2019' column='1'/>
      <parameter type-id='type-id-111' name='first_day_of_week' filepath='../glib/gdate.c' line='2020' column='1'/>
      <return type-id='type-id-136'/>
    </function-decl>
    <function-decl name='g_date_compare' mangled-name='g_date_compare' filepath='../glib/gdate.c' line='2054' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_compare' hash='c17b3276536d97d1'>
      <parameter type-id='type-id-179' name='d1' filepath='../glib/gdate.c' line='857' column='1'/>
      <parameter type-id='type-id-179' name='d2' filepath='../glib/gdate.c' line='858' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_to_struct_tm' mangled-name='g_date_to_struct_tm' filepath='../glib/gdate.c' line='2111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_to_struct_tm' hash='89d32e2fe55f71e6'>
      <parameter type-id='type-id-179' name='d' filepath='../glib/gdate.c' line='2111' column='1'/>
      <parameter type-id='type-id-197' name='tm' filepath='../glib/gdate.c' line='2112' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_clamp' mangled-name='g_date_clamp' filepath='../glib/gdate.c' line='2160' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_clamp' hash='a07581de9a462265'>
      <parameter type-id='type-id-173' name='date' filepath='../glib/gdate.c' line='2160' column='1'/>
      <parameter type-id='type-id-179' name='min_date' filepath='../glib/gdate.c' line='2161' column='1'/>
      <parameter type-id='type-id-179' name='max_date' filepath='../glib/gdate.c' line='2162' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_order' mangled-name='g_date_order' filepath='../glib/gdate.c' line='2191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_order' hash='4d55790d61ac721a'>
      <parameter type-id='type-id-173' name='date1' filepath='../glib/gdate.c' line='2191' column='1'/>
      <parameter type-id='type-id-173' name='date2' filepath='../glib/gdate.c' line='2192' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_strftime' mangled-name='g_date_strftime' filepath='../glib/gdate.c' line='2672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_strftime' hash='767b289ef272cfd9'>
      <parameter type-id='type-id-27' name='s' filepath='../glib/gdate.c' line='2672' column='1'/>
      <parameter type-id='type-id-21' name='slen' filepath='../glib/gdate.c' line='2673' column='1'/>
      <parameter type-id='type-id-14' name='format' filepath='../glib/gdate.c' line='2674' column='1'/>
      <parameter type-id='type-id-179' name='d' filepath='../glib/gdate.c' line='2675' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <var-decl name='g_ascii_table' type-id='type-id-186' mangled-name='g_ascii_table' visibility='default' filepath='../glib/gstrfuncs.c' line='282' column='1' elf-symbol-id='g_ascii_table'/>
    <typedef-decl name='iconv_t' type-id='type-id-103' filepath='/usr/include/iconv.h' line='29' column='1' id='type-id-206'/>
    <function-type size-in-bits='64' hash='d2857cdff9be4617' id='type-id-192'>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-193'>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-9'/>
    </function-type>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='type-id-199'>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='5a93fd810447fa83' id='type-id-208'>
      <parameter type-id='type-id-98' name='error' filepath='../glib/gerror.c' line='357' column='1'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-209'>
      <parameter type-id='type-id-18' name='dataset_location' filepath='../glib/gdataset.c' line='583' column='1'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-3280c' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-210' size-in-bits='192' hash='9904ddbe9e0e1da6' id='type-id-211'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-212'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-213' size-in-bits='192' hash='7d1d3b86b53c983c' id='type-id-214'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-107'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-215' size-in-bits='2048' hash='b1acd4e4c2ca8eab' id='type-id-216'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-217'/>
    </array-type-def>
    <enum-decl name='GFileError' naming-typedef-id='type-id-218' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gfileutils.h' line='36' column='1' hash='aa85c9dd2c2a8fc2' id='type-id-219'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_FILE_ERROR_EXIST' value='0'/>
      <enumerator name='G_FILE_ERROR_ISDIR' value='1'/>
      <enumerator name='G_FILE_ERROR_ACCES' value='2'/>
      <enumerator name='G_FILE_ERROR_NAMETOOLONG' value='3'/>
      <enumerator name='G_FILE_ERROR_NOENT' value='4'/>
      <enumerator name='G_FILE_ERROR_NOTDIR' value='5'/>
      <enumerator name='G_FILE_ERROR_NXIO' value='6'/>
      <enumerator name='G_FILE_ERROR_NODEV' value='7'/>
      <enumerator name='G_FILE_ERROR_ROFS' value='8'/>
      <enumerator name='G_FILE_ERROR_TXTBSY' value='9'/>
      <enumerator name='G_FILE_ERROR_FAULT' value='10'/>
      <enumerator name='G_FILE_ERROR_LOOP' value='11'/>
      <enumerator name='G_FILE_ERROR_NOSPC' value='12'/>
      <enumerator name='G_FILE_ERROR_NOMEM' value='13'/>
      <enumerator name='G_FILE_ERROR_MFILE' value='14'/>
      <enumerator name='G_FILE_ERROR_NFILE' value='15'/>
      <enumerator name='G_FILE_ERROR_BADF' value='16'/>
      <enumerator name='G_FILE_ERROR_INVAL' value='17'/>
      <enumerator name='G_FILE_ERROR_PIPE' value='18'/>
      <enumerator name='G_FILE_ERROR_AGAIN' value='19'/>
      <enumerator name='G_FILE_ERROR_INTR' value='20'/>
      <enumerator name='G_FILE_ERROR_IO' value='21'/>
      <enumerator name='G_FILE_ERROR_PERM' value='22'/>
      <enumerator name='G_FILE_ERROR_NOSYS' value='23'/>
      <enumerator name='G_FILE_ERROR_FAILED' value='24'/>
    </enum-decl>
    <enum-decl name='GFileSetContentsFlags' naming-typedef-id='type-id-220' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gfileutils.h' line='102' column='1' hash='fe94262baac70b4c' id='type-id-221'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_FILE_SET_CONTENTS_NONE' value='0'/>
      <enumerator name='G_FILE_SET_CONTENTS_CONSISTENT' value='1'/>
      <enumerator name='G_FILE_SET_CONTENTS_DURABLE' value='2'/>
      <enumerator name='G_FILE_SET_CONTENTS_ONLY_EXISTING' value='4'/>
    </enum-decl>
    <enum-decl name='GFileTest' naming-typedef-id='type-id-222' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gfileutils.h' line='69' column='1' hash='194101468d1275ac' id='type-id-223'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_FILE_TEST_IS_REGULAR' value='1'/>
      <enumerator name='G_FILE_TEST_IS_SYMLINK' value='2'/>
      <enumerator name='G_FILE_TEST_IS_DIR' value='4'/>
      <enumerator name='G_FILE_TEST_IS_EXECUTABLE' value='8'/>
      <enumerator name='G_FILE_TEST_EXISTS' value='16'/>
    </enum-decl>
    <enum-decl name='GFormatSizeFlags' naming-typedef-id='type-id-224' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gutils.h' line='295' column='1' hash='d4508bb8bb4e5d9f' id='type-id-225'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_FORMAT_SIZE_DEFAULT' value='0'/>
      <enumerator name='G_FORMAT_SIZE_LONG_FORMAT' value='1'/>
      <enumerator name='G_FORMAT_SIZE_IEC_UNITS' value='2'/>
      <enumerator name='G_FORMAT_SIZE_BITS' value='4'/>
      <enumerator name='G_FORMAT_SIZE_ONLY_VALUE' value='8'/>
      <enumerator name='G_FORMAT_SIZE_ONLY_UNIT' value='16'/>
    </enum-decl>
    <enum-decl name='GTimeType' naming-typedef-id='type-id-226' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gtimezone.h' line='52' column='1' hash='90c28ef4a19ba1bd' id='type-id-227'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_TIME_TYPE_STANDARD' value='0'/>
      <enumerator name='G_TIME_TYPE_DAYLIGHT' value='1'/>
      <enumerator name='G_TIME_TYPE_UNIVERSAL' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' filepath='../glib/gdatetime-private.h' line='44' column='1' hash='30784aa207e533a8' id='type-id-228'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_ERA_DATE_SET' value='0'/>
      <enumerator name='G_ERA_DATE_PLUS_INFINITY' value='1'/>
      <enumerator name='G_ERA_DATE_MINUS_INFINITY' value='2'/>
    </enum-decl>
    <class-decl name='GEraDate' is-struct='yes' naming-typedef-id='type-id-229' visibility='default' size-in-bits='128' filepath='../glib/gdatetime-private.h' line='43' column='1' hash='74ac698d24312d19' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-228' visibility='default' filepath='../glib/gdatetime-private.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='year' type-id='type-id-24' visibility='default' filepath='../glib/gdatetime-private.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='month' type-id='type-id-24' visibility='default' filepath='../glib/gdatetime-private.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='day' type-id='type-id-24' visibility='default' filepath='../glib/gdatetime-private.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='GEraDescriptionSegment' is-struct='yes' naming-typedef-id='type-id-231' visibility='default' size-in-bits='512' filepath='../glib/gdatetime-private.h' line='73' column='1' hash='93cc0414e13290c7' id='type-id-232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-233' visibility='default' filepath='../glib/gdatetime-private.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='direction_multiplier' type-id='type-id-24' visibility='default' filepath='../glib/gdatetime-private.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='type-id-38' visibility='default' filepath='../glib/gdatetime-private.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start_date' type-id='type-id-229' visibility='default' filepath='../glib/gdatetime-private.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='end_date' type-id='type-id-229' visibility='default' filepath='../glib/gdatetime-private.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='era_name' type-id='type-id-234' visibility='default' filepath='../glib/gdatetime-private.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='era_format' type-id='type-id-234' visibility='default' filepath='../glib/gdatetime-private.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GDir' is-struct='yes' visibility='default' size-in-bits='128' filepath='../glib/gdir.c' line='57' column='1' hash='e0707fbe6089f9c5' id='type-id-235'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-233' visibility='default' filepath='../glib/gdir.c' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dirp' type-id='type-id-236' visibility='default' filepath='../glib/gdir.c' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GHashTableIter' is-struct='yes' visibility='default' size-in-bits='320' filepath='../glib/ghash.h' line='48' column='1' hash='3e0ceeb4080badb7' id='type-id-237'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy1' type-id='type-id-9' visibility='default' filepath='../glib/ghash.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dummy2' type-id='type-id-9' visibility='default' filepath='../glib/ghash.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy3' type-id='type-id-9' visibility='default' filepath='../glib/ghash.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dummy4' type-id='type-id-24' visibility='default' filepath='../glib/ghash.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dummy5' type-id='type-id-32' visibility='default' filepath='../glib/ghash.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dummy6' type-id='type-id-9' visibility='default' filepath='../glib/ghash.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GRWLock' is-struct='yes' visibility='default' size-in-bits='128' filepath='../glib/gthread.h' line='67' column='1' hash='279ec19bdae0c34b' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='type-id-9' visibility='default' filepath='../glib/gthread.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='i' type-id='type-id-239' visibility='default' filepath='../glib/gthread.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTimeZone' is-struct='yes' visibility='default' size-in-bits='256' filepath='../glib/gtimezone.c' line='185' column='1' hash='c1adbe4cc4cd53cd' id='type-id-240'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-27' visibility='default' filepath='../glib/gtimezone.c' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='t_info' type-id='type-id-241' visibility='default' filepath='../glib/gtimezone.c' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='transitions' type-id='type-id-241' visibility='default' filepath='../glib/gtimezone.c' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ref_count' type-id='type-id-6' visibility='default' filepath='../glib/gtimezone.c' line='190' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-103' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='dirent' is-struct='yes' visibility='default' size-in-bits='2240' filepath='/usr/include/bits/dirent.h' line='22' column='1' hash='f8f1acd4a88a2190' id='type-id-242'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_ino' type-id='type-id-243' visibility='default' filepath='/usr/include/bits/dirent.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_off' type-id='type-id-244' visibility='default' filepath='/usr/include/bits/dirent.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='d_reclen' type-id='type-id-169' visibility='default' filepath='/usr/include/bits/dirent.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='d_type' type-id='type-id-245' visibility='default' filepath='/usr/include/bits/dirent.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='d_name' type-id='type-id-216' visibility='default' filepath='/usr/include/bits/dirent.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' is-struct='yes' visibility='default' size-in-bits='1152' filepath='/usr/include/bits/struct_stat.h' line='26' column='1' hash='4f24305487cf2e09' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-247' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-248' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-249' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-250' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-251' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-252' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-24' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-247' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-253' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-254' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-255' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-256' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-256' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-256' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-211' visibility='default' filepath='/usr/include/bits/struct_stat.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' hash='7451f9a3207df4f1' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-72' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-210' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GDir' type-id='type-id-235' size-in-bits='128' filepath='../glib/gdir.h' line='39' column='1' id='type-id-257'/>
    <typedef-decl name='GEraDate' type-id='type-id-230' size-in-bits='128' filepath='../glib/gdatetime-private.h' line='52' column='1' id='type-id-229'/>
    <typedef-decl name='GEraDescriptionSegment' type-id='type-id-232' size-in-bits='512' filepath='../glib/gdatetime-private.h' line='81' column='1' id='type-id-231'/>
    <typedef-decl name='GErrorClearFunc' type-id='type-id-258' size-in-bits='64' filepath='../glib/gerror.h' line='175' column='1' hash='fd7a63c0c6c822c4' id='type-id-259'/>
    <typedef-decl name='GErrorCopyFunc' type-id='type-id-260' size-in-bits='64' filepath='../glib/gerror.h' line='160' column='1' hash='fd7a63c0c6c822c4' id='type-id-261'/>
    <typedef-decl name='GErrorInitFunc' type-id='type-id-258' size-in-bits='64' filepath='../glib/gerror.h' line='142' column='1' hash='fd7a63c0c6c822c4' id='type-id-262'/>
    <typedef-decl name='GFileError' type-id='type-id-219' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gfileutils.h' line='62' column='1' hash='aa85c9dd2c2a8fc2' id='type-id-218'/>
    <typedef-decl name='GFileSetContentsFlags' type-id='type-id-221' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gfileutils.h' line='107' column='1' hash='fe94262baac70b4c' id='type-id-220'/>
    <typedef-decl name='GFileTest' type-id='type-id-223' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gfileutils.h' line='75' column='1' hash='194101468d1275ac' id='type-id-222'/>
    <typedef-decl name='GFormatSizeFlags' type-id='type-id-225' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gutils.h' line='302' column='1' hash='d4508bb8bb4e5d9f' id='type-id-224'/>
    <typedef-decl name='GHashTableIter' type-id='type-id-237' size-in-bits='320' filepath='../glib/ghash.h' line='46' column='1' id='type-id-263'/>
    <typedef-decl name='GRWLock' type-id='type-id-238' size-in-bits='128' filepath='../glib/gthread.h' line='55' column='1' id='type-id-264'/>
    <typedef-decl name='GTimeSpan' type-id='type-id-265' size-in-bits='64' filepath='../glib/gdatetime.h' line='89' column='1' hash='b119fe0931d2ee10' id='type-id-266'/>
    <typedef-decl name='GTimeType' type-id='type-id-227' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gtimezone.h' line='56' column='1' hash='90c28ef4a19ba1bd' id='type-id-226'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-155' size-in-bits='64' filepath='/usr/include/bits/types.h' line='180' column='1' hash='b119fe0931d2ee10' id='type-id-255'/>
    <typedef-decl name='__blksize_t' type-id='type-id-155' size-in-bits='64' filepath='/usr/include/bits/types.h' line='175' column='1' hash='b119fe0931d2ee10' id='type-id-254'/>
    <typedef-decl name='__builtin_va_list' type-id='type-id-214' size-in-bits='192' hash='7d1d3b86b53c983c' id='type-id-267'/>
    <typedef-decl name='__dev_t' type-id='type-id-106' size-in-bits='64' filepath='/usr/include/bits/types.h' line='145' column='1' hash='8fdc5eea2983a729' id='type-id-247'/>
    <typedef-decl name='__gid_t' type-id='type-id-84' size-in-bits='32' filepath='/usr/include/bits/types.h' line='147' column='1' hash='e66b43f97c38e87a' id='type-id-252'/>
    <typedef-decl name='__gnuc_va_list' type-id='type-id-267' size-in-bits='192' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stdarg.h' line='40' column='1' hash='7d1d3b86b53c983c' id='type-id-268'/>
    <typedef-decl name='__ino64_t' type-id='type-id-106' size-in-bits='64' filepath='/usr/include/bits/types.h' line='149' column='1' hash='8fdc5eea2983a729' id='type-id-243'/>
    <typedef-decl name='__ino_t' type-id='type-id-106' size-in-bits='64' filepath='/usr/include/bits/types.h' line='148' column='1' hash='8fdc5eea2983a729' id='type-id-248'/>
    <typedef-decl name='__mode_t' type-id='type-id-84' size-in-bits='32' filepath='/usr/include/bits/types.h' line='150' column='1' hash='e66b43f97c38e87a' id='type-id-250'/>
    <typedef-decl name='__nlink_t' type-id='type-id-106' size-in-bits='64' filepath='/usr/include/bits/types.h' line='151' column='1' hash='8fdc5eea2983a729' id='type-id-249'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-155' size-in-bits='64' filepath='/usr/include/bits/types.h' line='197' column='1' hash='b119fe0931d2ee10' id='type-id-210'/>
    <typedef-decl name='__uid_t' type-id='type-id-84' size-in-bits='32' filepath='/usr/include/bits/types.h' line='146' column='1' hash='e66b43f97c38e87a' id='type-id-251'/>
    <typedef-decl name='ssize_t' type-id='type-id-269' size-in-bits='64' filepath='/usr/include/stdio.h' line='78' column='1' hash='b119fe0931d2ee10' id='type-id-270'/>
    <typedef-decl name='va_list' type-id='type-id-268' size-in-bits='192' filepath='/usr/include/stdio.h' line='53' column='1' hash='7d1d3b86b53c983c' id='type-id-271'/>
    <qualified-type-def type-id='type-id-1' restrict='yes' hash='6a2cf982d0fba87f' id='type-id-272'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' hash='c79be78d7d7c0567' id='type-id-273'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' hash='9336ae1741b2520f' id='type-id-274'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' hash='5c02aa67ee0577dc' id='type-id-275'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' hash='b17a04b2d3e3e56b' id='type-id-276'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' hash='39fc40d7ba4ca689' id='type-id-277'/>
    <qualified-type-def type-id='type-id-234' restrict='yes' hash='566dfacc48804f50' id='type-id-278'/>
    <qualified-type-def type-id='type-id-229' const='yes' hash='a5f61a554d3e9bbe' id='type-id-279'/>
    <pointer-type-def type-id='type-id-279' size-in-bits='64' hash='62dff50a531fae4f' id='type-id-280'/>
    <qualified-type-def type-id='type-id-281' const='yes' hash='d84c95706c7078ac' id='type-id-282'/>
    <pointer-type-def type-id='type-id-282' size-in-bits='64' hash='fdf44a5f4693b1fb' id='type-id-283'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' hash='1ce54f87b39780f9' id='type-id-284'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' hash='83c198fcc1652e49' id='type-id-285'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' hash='925ad1338878bb49' id='type-id-286'/>
    <qualified-type-def type-id='type-id-286' restrict='yes' hash='625d51349de39d13' id='type-id-287'/>
    <pointer-type-def type-id='type-id-271' size-in-bits='64' hash='e01340f548ae75f1' id='type-id-288'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-258'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-260'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-236'/>
    <function-decl name='__builtin___memmove_chk' mangled-name='__memmove_chk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__memmove_chk' hash='7f32ffea222edbe7'>
      <return type-id='type-id-3'/>
    </function-decl>
    <class-decl name='__dirstream' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-291'/>
    <qualified-type-def type-id='type-id-103' restrict='yes' id='type-id-292'/>
    <function-decl name='g_date_time_ref' mangled-name='g_date_time_ref' filepath='../glib/gdatetime.c' line='688' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_ref' hash='ac6ac8d169d29455'>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_unref' mangled-name='g_date_time_unref' filepath='../glib/gdatetime.c' line='710' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_unref' hash='8f7a5c5e28e628be'>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_time_new_now' mangled-name='g_date_time_new_now' filepath='../glib/gdatetime.c' line='950' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_now' hash='afcf757b63cc1284'>
      <parameter type-id='type-id-91' name='tz' filepath='../glib/gdatetime.c' line='950' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new_now_local' mangled-name='g_date_time_new_now_local' filepath='../glib/gdatetime.c' line='975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_now_local' hash='8f7a5c5e28e628be'>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new_now_utc' mangled-name='g_date_time_new_now_utc' filepath='../glib/gdatetime.c' line='1000' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_now_utc' hash='8f7a5c5e28e628be'>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new_from_unix_local' mangled-name='g_date_time_new_from_unix_local' filepath='../glib/gdatetime.c' line='1033' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_from_unix_local' hash='a87d2e4c8ca8012b'>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new_from_unix_local_usec' mangled-name='g_date_time_new_from_unix_local_usec' filepath='../glib/gdatetime.c' line='1063' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_from_unix_local_usec' hash='a87d2e4c8ca8012b'>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new_from_unix_utc' mangled-name='g_date_time_new_from_unix_utc' filepath='../glib/gdatetime.c' line='1095' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_from_unix_utc' hash='a87d2e4c8ca8012b'>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new_from_unix_utc_usec' mangled-name='g_date_time_new_from_unix_utc_usec' filepath='../glib/gdatetime.c' line='1124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_from_unix_utc_usec' hash='a87d2e4c8ca8012b'>
      <parameter type-id='type-id-265'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new_from_timeval_local' mangled-name='g_date_time_new_from_timeval_local' filepath='../glib/gdatetime.c' line='1161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_from_timeval_local' hash='0cc9696871eab8c5'>
      <parameter type-id='type-id-283' name='tv' filepath='../glib/gdatetime.c' line='1161' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new_from_timeval_utc' mangled-name='g_date_time_new_from_timeval_utc' filepath='../glib/gdatetime.c' line='1197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_from_timeval_utc' hash='0cc9696871eab8c5'>
      <parameter type-id='type-id-283' name='tv' filepath='../glib/gdatetime.c' line='1161' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new_from_iso8601' mangled-name='g_date_time_new_from_iso8601' filepath='../glib/gdatetime.c' line='1545' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_from_iso8601' hash='789d677db7bdeb68'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new' mangled-name='g_date_time_new' filepath='../glib/gdatetime.c' line='1629' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new' hash='add9254603c87f8e'>
      <parameter type-id='type-id-91' name='tz' filepath='../glib/gdatetime.c' line='1629' column='1'/>
      <parameter type-id='type-id-6' name='year' filepath='../glib/gdatetime.c' line='1630' column='1'/>
      <parameter type-id='type-id-6' name='month' filepath='../glib/gdatetime.c' line='1631' column='1'/>
      <parameter type-id='type-id-6' name='day' filepath='../glib/gdatetime.c' line='1632' column='1'/>
      <parameter type-id='type-id-6' name='hour' filepath='../glib/gdatetime.c' line='1633' column='1'/>
      <parameter type-id='type-id-6' name='minute' filepath='../glib/gdatetime.c' line='1634' column='1'/>
      <parameter type-id='type-id-293' name='seconds' filepath='../glib/gdatetime.c' line='1635' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new_local' mangled-name='g_date_time_new_local' filepath='../glib/gdatetime.c' line='1711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_local' hash='0936611ac0938037'>
      <parameter type-id='type-id-6' name='year' filepath='../glib/gdatetime.c' line='1711' column='1'/>
      <parameter type-id='type-id-6' name='month' filepath='../glib/gdatetime.c' line='1712' column='1'/>
      <parameter type-id='type-id-6' name='day' filepath='../glib/gdatetime.c' line='1713' column='1'/>
      <parameter type-id='type-id-6' name='hour' filepath='../glib/gdatetime.c' line='1714' column='1'/>
      <parameter type-id='type-id-6' name='minute' filepath='../glib/gdatetime.c' line='1715' column='1'/>
      <parameter type-id='type-id-293' name='seconds' filepath='../glib/gdatetime.c' line='1716' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_new_utc' mangled-name='g_date_time_new_utc' filepath='../glib/gdatetime.c' line='1748' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_new_utc' hash='0936611ac0938037'>
      <parameter type-id='type-id-6' name='year' filepath='../glib/gdatetime.c' line='1711' column='1'/>
      <parameter type-id='type-id-6' name='month' filepath='../glib/gdatetime.c' line='1712' column='1'/>
      <parameter type-id='type-id-6' name='day' filepath='../glib/gdatetime.c' line='1713' column='1'/>
      <parameter type-id='type-id-6' name='hour' filepath='../glib/gdatetime.c' line='1714' column='1'/>
      <parameter type-id='type-id-6' name='minute' filepath='../glib/gdatetime.c' line='1715' column='1'/>
      <parameter type-id='type-id-293' name='seconds' filepath='../glib/gdatetime.c' line='1716' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_add' mangled-name='g_date_time_add' filepath='../glib/gdatetime.c' line='1780' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_add' hash='94222ce9bd4aca15'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='1780' column='1'/>
      <parameter type-id='type-id-266' name='timespan' filepath='../glib/gdatetime.c' line='1781' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_add_years' mangled-name='g_date_time_add_years' filepath='../glib/gdatetime.c' line='1806' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_add_years' hash='2a5ce88380039e3e'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='1936' column='1'/>
      <parameter type-id='type-id-6' name='hours' filepath='../glib/gdatetime.c' line='1937' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_add_months' mangled-name='g_date_time_add_months' filepath='../glib/gdatetime.c' line='1846' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_add_months' hash='2a5ce88380039e3e'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='1936' column='1'/>
      <parameter type-id='type-id-6' name='hours' filepath='../glib/gdatetime.c' line='1937' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_add_weeks' mangled-name='g_date_time_add_weeks' filepath='../glib/gdatetime.c' line='1889' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_add_weeks' hash='2a5ce88380039e3e'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='1936' column='1'/>
      <parameter type-id='type-id-6' name='hours' filepath='../glib/gdatetime.c' line='1937' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_add_days' mangled-name='g_date_time_add_days' filepath='../glib/gdatetime.c' line='1911' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_add_days' hash='2a5ce88380039e3e'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='1936' column='1'/>
      <parameter type-id='type-id-6' name='hours' filepath='../glib/gdatetime.c' line='1937' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_add_hours' mangled-name='g_date_time_add_hours' filepath='../glib/gdatetime.c' line='1936' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_add_hours' hash='2a5ce88380039e3e'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='1936' column='1'/>
      <parameter type-id='type-id-6' name='hours' filepath='../glib/gdatetime.c' line='1937' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_add_minutes' mangled-name='g_date_time_add_minutes' filepath='../glib/gdatetime.c' line='1956' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_add_minutes' hash='2a5ce88380039e3e'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='1936' column='1'/>
      <parameter type-id='type-id-6' name='hours' filepath='../glib/gdatetime.c' line='1937' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_add_seconds' mangled-name='g_date_time_add_seconds' filepath='../glib/gdatetime.c' line='1977' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_add_seconds' hash='e8c21e7a0110c9e5'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='1977' column='1'/>
      <parameter type-id='type-id-293' name='seconds' filepath='../glib/gdatetime.c' line='1978' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_add_full' mangled-name='g_date_time_add_full' filepath='../glib/gdatetime.c' line='2002' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_add_full' hash='c38a5ae5b670affd'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2002' column='1'/>
      <parameter type-id='type-id-6' name='years' filepath='../glib/gdatetime.c' line='2003' column='1'/>
      <parameter type-id='type-id-6' name='months' filepath='../glib/gdatetime.c' line='2004' column='1'/>
      <parameter type-id='type-id-6' name='days' filepath='../glib/gdatetime.c' line='2005' column='1'/>
      <parameter type-id='type-id-6' name='hours' filepath='../glib/gdatetime.c' line='2006' column='1'/>
      <parameter type-id='type-id-6' name='minutes' filepath='../glib/gdatetime.c' line='2007' column='1'/>
      <parameter type-id='type-id-293' name='seconds' filepath='../glib/gdatetime.c' line='2008' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_compare' mangled-name='g_date_time_compare' filepath='../glib/gdatetime.c' line='2098' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_compare' hash='388da3fa973fde78'>
      <parameter type-id='type-id-18' name='bytes1' filepath='../glib/gbytes.c' line='467' column='1'/>
      <parameter type-id='type-id-18' name='bytes2' filepath='../glib/gbytes.c' line='468' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_difference' mangled-name='g_date_time_difference' filepath='../glib/gdatetime.c' line='2130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_difference' hash='6ddf2d249a746072'>
      <parameter type-id='type-id-75' name='end' filepath='../glib/gdatetime.c' line='2130' column='1'/>
      <parameter type-id='type-id-75' name='begin' filepath='../glib/gdatetime.c' line='2131' column='1'/>
      <return type-id='type-id-266'/>
    </function-decl>
    <function-decl name='g_date_time_hash' mangled-name='g_date_time_hash' filepath='../glib/gdatetime.c' line='2151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_hash' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_date_time_equal' mangled-name='g_date_time_equal' filepath='../glib/gdatetime.c' line='2173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_equal' hash='388da3fa973fde78'>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_time_get_ymd' mangled-name='g_date_time_get_ymd' filepath='../glib/gdatetime.c' line='2192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_ymd' hash='b86f8be12b13a4dd'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2192' column='1'/>
      <parameter type-id='type-id-294' name='year' filepath='../glib/gdatetime.c' line='2193' column='1'/>
      <parameter type-id='type-id-294' name='month' filepath='../glib/gdatetime.c' line='2194' column='1'/>
      <parameter type-id='type-id-294' name='day' filepath='../glib/gdatetime.c' line='2195' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_date_time_get_year' mangled-name='g_date_time_get_year' filepath='../glib/gdatetime.c' line='2287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_year' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2481' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_get_month' mangled-name='g_date_time_get_month' filepath='../glib/gdatetime.c' line='2310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_month' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2481' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_get_day_of_month' mangled-name='g_date_time_get_day_of_month' filepath='../glib/gdatetime.c' line='2333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_day_of_month' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2481' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_get_week_numbering_year' mangled-name='g_date_time_get_week_numbering_year' filepath='../glib/gdatetime.c' line='2398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_week_numbering_year' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2481' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_get_week_of_year' mangled-name='g_date_time_get_week_of_year' filepath='../glib/gdatetime.c' line='2458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_week_of_year' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2481' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_get_day_of_week' mangled-name='g_date_time_get_day_of_week' filepath='../glib/gdatetime.c' line='2481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_day_of_week' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2481' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_get_day_of_year' mangled-name='g_date_time_get_day_of_year' filepath='../glib/gdatetime.c' line='2501' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_day_of_year' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2481' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_get_hour' mangled-name='g_date_time_get_hour' filepath='../glib/gdatetime.c' line='2524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_hour' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2481' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_get_minute' mangled-name='g_date_time_get_minute' filepath='../glib/gdatetime.c' line='2542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_minute' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2481' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_get_second' mangled-name='g_date_time_get_second' filepath='../glib/gdatetime.c' line='2560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_second' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2481' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_get_microsecond' mangled-name='g_date_time_get_microsecond' filepath='../glib/gdatetime.c' line='2578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_microsecond' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2481' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_date_time_get_seconds' mangled-name='g_date_time_get_seconds' filepath='../glib/gdatetime.c' line='2597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_seconds' hash='5cfe0fdfd2811bb7'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2597' column='1'/>
      <return type-id='type-id-293'/>
    </function-decl>
    <function-decl name='g_date_time_to_unix' mangled-name='g_date_time_to_unix' filepath='../glib/gdatetime.c' line='2620' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_to_unix' hash='837cebb043db82a3'>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='g_date_time_to_unix_usec' mangled-name='g_date_time_to_unix_usec' filepath='../glib/gdatetime.c' line='2641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_to_unix_usec' hash='837cebb043db82a3'>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-265'/>
    </function-decl>
    <function-decl name='g_date_time_to_timeval' mangled-name='g_date_time_to_timeval' filepath='../glib/gdatetime.c' line='2675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_to_timeval' hash='116791bb88a7ce79'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2675' column='1'/>
      <parameter type-id='type-id-205' name='tv' filepath='../glib/gdatetime.c' line='2676' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_time_get_utc_offset' mangled-name='g_date_time_get_utc_offset' filepath='../glib/gdatetime.c' line='2707' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_utc_offset' hash='837cebb043db82a3'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2707' column='1'/>
      <return type-id='type-id-266'/>
    </function-decl>
    <function-decl name='g_date_time_get_timezone' mangled-name='g_date_time_get_timezone' filepath='../glib/gdatetime.c' line='2728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_timezone' hash='2b92038cf031598b'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2728' column='1'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='g_date_time_get_timezone_abbreviation' mangled-name='g_date_time_get_timezone_abbreviation' filepath='../glib/gdatetime.c' line='2754' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_get_timezone_abbreviation' hash='cd3ecec11122e1b6'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2754' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_date_time_is_daylight_savings' mangled-name='g_date_time_is_daylight_savings' filepath='../glib/gdatetime.c' line='2773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_is_daylight_savings' hash='5a9a622b317e5ac0'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2773' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_date_time_to_timezone' mangled-name='g_date_time_to_timezone' filepath='../glib/gdatetime.c' line='2799' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_to_timezone' hash='7586eeebbf9d30b2'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='2799' column='1'/>
      <parameter type-id='type-id-91' name='tz' filepath='../glib/gdatetime.c' line='2800' column='1'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_to_local' mangled-name='g_date_time_to_local' filepath='../glib/gdatetime.c' line='2824' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_to_local' hash='ac6ac8d169d29455'>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_to_utc' mangled-name='g_date_time_to_utc' filepath='../glib/gdatetime.c' line='2852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_to_utc' hash='ac6ac8d169d29455'>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-75'/>
    </function-decl>
    <function-decl name='g_date_time_format' mangled-name='g_date_time_format' filepath='../glib/gdatetime.c' line='3792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_format' hash='1233ffc54ffdfd2f'>
      <parameter type-id='type-id-75' name='datetime' filepath='../glib/gdatetime.c' line='3792' column='1'/>
      <parameter type-id='type-id-14' name='format' filepath='../glib/gdatetime.c' line='3793' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_date_time_format_iso8601' mangled-name='g_date_time_format_iso8601' filepath='../glib/gdatetime.c' line='3838' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_date_time_format_iso8601' hash='2f29bbd38e3314ad'>
      <parameter type-id='type-id-75'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_dir_open' mangled-name='g_dir_open' filepath='../glib/gdir.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dir_open' hash='39aaf9013feee5c2'>
      <parameter type-id='type-id-14' name='path' filepath='../glib/gdir.c' line='150' column='1'/>
      <parameter type-id='type-id-16' name='flags' filepath='../glib/gdir.c' line='151' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gdir.c' line='152' column='1'/>
      <return type-id='type-id-273'/>
    </function-decl>
    <function-decl name='g_dir_read_name' mangled-name='g_dir_read_name' filepath='../glib/gdir.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dir_read_name' hash='1f58d10d395668df'>
      <parameter type-id='type-id-273' name='dir' filepath='../glib/gdir.c' line='235' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_dir_rewind' mangled-name='g_dir_rewind' filepath='../glib/gdir.c' line='290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dir_rewind' hash='fcab3309011166d1'>
      <parameter type-id='type-id-273' name='dir' filepath='../glib/gdir.c' line='290' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_dir_close' mangled-name='g_dir_close' filepath='../glib/gdir.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dir_close' hash='fcab3309011166d1'>
      <parameter type-id='type-id-273' name='dir' filepath='../glib/gdir.c' line='290' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_dir_ref' mangled-name='g_dir_ref' filepath='../glib/gdir.c' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dir_ref' hash='f865f8ecee65826d'>
      <parameter type-id='type-id-273' name='dir' filepath='../glib/gdir.c' line='343' column='1'/>
      <return type-id='type-id-273'/>
    </function-decl>
    <function-decl name='g_dir_unref' mangled-name='g_dir_unref' filepath='../glib/gdir.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dir_unref' hash='fcab3309011166d1'>
      <parameter type-id='type-id-273' name='dir' filepath='../glib/gdir.c' line='290' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_environ_getenv' mangled-name='g_environ_getenv' filepath='../glib/genviron.c' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_environ_getenv' hash='95c7247cdd1be68c'>
      <parameter type-id='type-id-94'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_environ_setenv' mangled-name='g_environ_setenv' filepath='../glib/genviron.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_environ_setenv' hash='e888b7030603a91b'>
      <parameter type-id='type-id-94' name='envp' filepath='../glib/genviron.c' line='135' column='1'/>
      <parameter type-id='type-id-14' name='variable' filepath='../glib/genviron.c' line='136' column='1'/>
      <parameter type-id='type-id-14' name='value' filepath='../glib/genviron.c' line='137' column='1'/>
      <parameter type-id='type-id-32' name='overwrite' filepath='../glib/genviron.c' line='138' column='1'/>
      <return type-id='type-id-94'/>
    </function-decl>
    <function-decl name='g_environ_unsetenv' mangled-name='g_environ_unsetenv' filepath='../glib/genviron.c' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_environ_unsetenv' hash='6daea153d45c7e52'>
      <parameter type-id='type-id-94' name='envp' filepath='../glib/genviron.c' line='220' column='1'/>
      <parameter type-id='type-id-14' name='variable' filepath='../glib/genviron.c' line='221' column='1'/>
      <return type-id='type-id-94'/>
    </function-decl>
    <function-decl name='g_getenv' mangled-name='g_getenv' filepath='../glib/genviron.c' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_getenv' hash='2931cb4d7a0438af'>
      <parameter type-id='type-id-14' name='str' filepath='../glib/ggettext.c' line='129' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_setenv' mangled-name='g_setenv' filepath='../glib/genviron.c' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_setenv' hash='77f10cb6d106b518'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_unsetenv' mangled-name='g_unsetenv' filepath='../glib/genviron.c' line='363' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_unsetenv' hash='3f7921bdb568b75e'>
      <parameter type-id='type-id-14' name='variable' filepath='../glib/genviron.c' line='363' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_listenv' mangled-name='g_listenv' filepath='../glib/genviron.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_listenv' hash='a660cca625e22f9c'>
      <return type-id='type-id-94'/>
    </function-decl>
    <function-decl name='g_get_environ' mangled-name='g_get_environ' filepath='../glib/genviron.c' line='445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_environ' hash='a660cca625e22f9c'>
      <return type-id='type-id-94'/>
    </function-decl>
    <function-decl name='g_error_domain_register_static' mangled-name='g_error_domain_register_static' filepath='../glib/gerror.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_domain_register_static' hash='ec6e44e26a7cccb9'>
      <parameter type-id='type-id-2' name='error_type_name' filepath='../glib/gerror.c' line='135' column='1'/>
      <parameter type-id='type-id-21' name='error_type_private_size' filepath='../glib/gerror.c' line='136' column='1'/>
      <parameter type-id='type-id-262' name='error_type_init' filepath='../glib/gerror.c' line='137' column='1'/>
      <parameter type-id='type-id-261' name='error_type_copy' filepath='../glib/gerror.c' line='138' column='1'/>
      <parameter type-id='type-id-259' name='error_type_clear' filepath='../glib/gerror.c' line='139' column='1'/>
      <return type-id='type-id-93'/>
    </function-decl>
    <function-decl name='g_error_domain_register' mangled-name='g_error_domain_register' filepath='../glib/gerror.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_domain_register' hash='ec6e44e26a7cccb9'>
      <parameter type-id='type-id-2' name='error_type_name' filepath='../glib/gerror.c' line='135' column='1'/>
      <parameter type-id='type-id-21' name='error_type_private_size' filepath='../glib/gerror.c' line='136' column='1'/>
      <parameter type-id='type-id-262' name='error_type_init' filepath='../glib/gerror.c' line='137' column='1'/>
      <parameter type-id='type-id-261' name='error_type_copy' filepath='../glib/gerror.c' line='138' column='1'/>
      <parameter type-id='type-id-259' name='error_type_clear' filepath='../glib/gerror.c' line='139' column='1'/>
      <return type-id='type-id-93'/>
    </function-decl>
    <function-decl name='g_error_new_valist' mangled-name='g_error_new_valist' filepath='../glib/gerror.c' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_new_valist' hash='1118e94754cd8ae7'>
      <parameter type-id='type-id-93' name='domain' filepath='../glib/gerror.c' line='278' column='1'/>
      <parameter type-id='type-id-6' name='code' filepath='../glib/gerror.c' line='279' column='1'/>
      <parameter type-id='type-id-14' name='format' filepath='../glib/gerror.c' line='280' column='1'/>
      <parameter type-id='type-id-277' name='args' filepath='../glib/gerror.c' line='281' column='1'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='g_error_new' mangled-name='g_error_new' filepath='../glib/gerror.c' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_new' hash='2f587607c210d01c'>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-14'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='g_error_new_literal' mangled-name='g_error_new_literal' filepath='../glib/gerror.c' line='340' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_new_literal' hash='2f587607c210d01c'>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='g_error_free' mangled-name='g_error_free' filepath='../glib/gerror.c' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_free' hash='5a93fd810447fa83'>
      <parameter type-id='type-id-98' name='error' filepath='../glib/gerror.c' line='357' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_error_copy' mangled-name='g_error_copy' filepath='../glib/gerror.c' line='410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_copy' hash='060835fb0b13e090'>
      <parameter type-id='type-id-182' name='error' filepath='../glib/gerror.c' line='410' column='1'/>
      <return type-id='type-id-98'/>
    </function-decl>
    <function-decl name='g_error_matches' mangled-name='g_error_matches' filepath='../glib/gerror.c' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_error_matches' hash='eb4d635daac6c381'>
      <parameter type-id='type-id-182' name='error' filepath='../glib/gerror.c' line='451' column='1'/>
      <parameter type-id='type-id-93' name='domain' filepath='../glib/gerror.c' line='452' column='1'/>
      <parameter type-id='type-id-6' name='code' filepath='../glib/gerror.c' line='453' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_set_error' mangled-name='g_set_error' filepath='../glib/gerror.c' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_set_error' hash='aa7c4406719d04c0'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-93'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-14'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_set_error_literal' mangled-name='g_set_error_literal' filepath='../glib/gerror.c' line='518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_set_error_literal' hash='aa7c4406719d04c0'>
      <parameter type-id='type-id-41' name='err' filepath='../glib/gerror.c' line='518' column='1'/>
      <parameter type-id='type-id-93' name='domain' filepath='../glib/gerror.c' line='519' column='1'/>
      <parameter type-id='type-id-6' name='code' filepath='../glib/gerror.c' line='520' column='1'/>
      <parameter type-id='type-id-14' name='message' filepath='../glib/gerror.c' line='521' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_propagate_error' mangled-name='g_propagate_error' filepath='../glib/gerror.c' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_propagate_error' hash='28b0697d01b93bc9'>
      <parameter type-id='type-id-41' name='dest' filepath='../glib/gerror.c' line='547' column='1'/>
      <parameter type-id='type-id-98' name='src' filepath='../glib/gerror.c' line='548' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_clear_error' mangled-name='g_clear_error' filepath='../glib/gerror.c' line='577' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_clear_error' hash='07dd3e6030b7e923'>
      <parameter type-id='type-id-41' name='err' filepath='../glib/gerror.c' line='577' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_prefix_error' mangled-name='g_prefix_error' filepath='../glib/gerror.c' line='618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_prefix_error' hash='59c27cd619b3bf25'>
      <parameter type-id='type-id-41'/>
      <parameter type-id='type-id-14'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_prefix_error_literal' mangled-name='g_prefix_error_literal' filepath='../glib/gerror.c' line='643' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_prefix_error_literal' hash='59c27cd619b3bf25'>
      <parameter type-id='type-id-41' name='err' filepath='../glib/gerror.c' line='643' column='1'/>
      <parameter type-id='type-id-14' name='prefix' filepath='../glib/gerror.c' line='644' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_propagate_prefixed_error' mangled-name='g_propagate_prefixed_error' filepath='../glib/gerror.c' line='670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_propagate_prefixed_error' hash='bbf3dc6e734a5f15'>
      <parameter type-id='type-id-41' name='dest' filepath='../glib/gerror.c' line='670' column='1'/>
      <parameter type-id='type-id-98' name='src' filepath='../glib/gerror.c' line='671' column='1'/>
      <parameter type-id='type-id-14' name='format' filepath='../glib/gerror.c' line='672' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_mkdir_with_parents' mangled-name='g_mkdir_with_parents' filepath='../glib/gfileutils.c' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mkdir_with_parents' hash='fd10421ff30a0411'>
      <parameter type-id='type-id-14' name='pathname' filepath='../glib/gfileutils.c' line='182' column='1'/>
      <parameter type-id='type-id-24' name='mode' filepath='../glib/gfileutils.c' line='183' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='g_file_test' mangled-name='g_file_test' filepath='../glib/gfileutils.c' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_test' hash='513f18dc0e7fed52'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-222'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_file_error_quark' mangled-name='g_file_error_quark' filepath='../glib/gfileutils.c' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_error_quark' hash='2bb88322482ae81c'>
      <return type-id='type-id-93'/>
    </function-decl>
    <function-decl name='g_file_error_from_errno' mangled-name='g_file_error_from_errno' filepath='../glib/gfileutils.c' line='495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_error_from_errno' hash='08a35e70420bc673'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-218'/>
    </function-decl>
    <function-decl name='g_file_get_contents' mangled-name='g_file_get_contents' filepath='../glib/gfileutils.c' line='1015' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_get_contents' hash='1b781f14ad879a43'>
      <parameter type-id='type-id-14' name='filename' filepath='../glib/gfileutils.c' line='1015' column='1'/>
      <parameter type-id='type-id-94' name='contents' filepath='../glib/gfileutils.c' line='1016' column='1'/>
      <parameter type-id='type-id-40' name='length' filepath='../glib/gfileutils.c' line='1017' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gfileutils.c' line='1018' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_file_set_contents' mangled-name='g_file_set_contents' filepath='../glib/gfileutils.c' line='1248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_set_contents' hash='ed027610e10ae49c'>
      <parameter type-id='type-id-14' name='filename' filepath='../glib/gfileutils.c' line='1248' column='1'/>
      <parameter type-id='type-id-14' name='contents' filepath='../glib/gfileutils.c' line='1249' column='1'/>
      <parameter type-id='type-id-15' name='length' filepath='../glib/gfileutils.c' line='1250' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gfileutils.c' line='1251' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_file_set_contents_full' mangled-name='g_file_set_contents_full' filepath='../glib/gfileutils.c' line='1329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_set_contents_full' hash='5ed5dcb5539b69a5'>
      <parameter type-id='type-id-14' name='filename' filepath='../glib/gfileutils.c' line='1329' column='1'/>
      <parameter type-id='type-id-14' name='contents' filepath='../glib/gfileutils.c' line='1330' column='1'/>
      <parameter type-id='type-id-15' name='length' filepath='../glib/gfileutils.c' line='1331' column='1'/>
      <parameter type-id='type-id-220' name='flags' filepath='../glib/gfileutils.c' line='1332' column='1'/>
      <parameter type-id='type-id-24' name='mode' filepath='../glib/gfileutils.c' line='1333' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gfileutils.c' line='1334' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_mkdtemp_full' mangled-name='g_mkdtemp_full' filepath='../glib/gfileutils.c' line='1645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mkdtemp_full' hash='18c86aac9598a428'>
      <parameter type-id='type-id-27' name='tmpl' filepath='../glib/gfileutils.c' line='1645' column='1'/>
      <parameter type-id='type-id-6' name='mode' filepath='../glib/gfileutils.c' line='1646' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_mkdtemp' mangled-name='g_mkdtemp' filepath='../glib/gfileutils.c' line='1682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mkdtemp' hash='e7737c19607c85bc'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_mkstemp_full' mangled-name='g_mkstemp_full' filepath='../glib/gfileutils.c' line='1715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mkstemp_full' hash='037066e9e63e7a7d'>
      <parameter type-id='type-id-27' name='tmpl' filepath='../glib/gfileutils.c' line='1715' column='1'/>
      <parameter type-id='type-id-6' name='flags' filepath='../glib/gfileutils.c' line='1716' column='1'/>
      <parameter type-id='type-id-6' name='mode' filepath='../glib/gfileutils.c' line='1717' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_mkstemp' mangled-name='g_mkstemp' filepath='../glib/gfileutils.c' line='1747' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_mkstemp' hash='d820a8cc11584215'>
      <parameter type-id='type-id-27' name='tmpl' filepath='../glib/gfileutils.c' line='1747' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_file_open_tmp' mangled-name='g_file_open_tmp' filepath='../glib/gfileutils.c' line='1860' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_open_tmp' hash='7f451eca449bb2fc'>
      <parameter type-id='type-id-14' name='tmpl' filepath='../glib/gfileutils.c' line='1860' column='1'/>
      <parameter type-id='type-id-94' name='name_used' filepath='../glib/gfileutils.c' line='1861' column='1'/>
      <parameter type-id='type-id-41' name='error' filepath='../glib/gfileutils.c' line='1862' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='g_dir_make_tmp' mangled-name='g_dir_make_tmp' filepath='../glib/gfileutils.c' line='1911' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dir_make_tmp' hash='78659feb0f875243'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_build_pathv' mangled-name='g_build_pathv' filepath='../glib/gfileutils.c' line='2044' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_build_pathv' hash='22584f97846c1445'>
      <parameter type-id='type-id-14' name='separator' filepath='../glib/gfileutils.c' line='2044' column='1'/>
      <parameter type-id='type-id-94' name='args' filepath='../glib/gfileutils.c' line='2045' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_build_path' mangled-name='g_build_path' filepath='../glib/gfileutils.c' line='2092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_build_path' hash='58a789ef00ad4f55'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_build_filename_valist' mangled-name='g_build_filename_valist' filepath='../glib/gfileutils.c' line='2259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_build_filename_valist' hash='a8b02ce1656c936b'>
      <parameter type-id='type-id-14' name='first_element' filepath='../glib/gfileutils.c' line='2259' column='1'/>
      <parameter type-id='type-id-288' name='args' filepath='../glib/gfileutils.c' line='2260' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_build_filenamev' mangled-name='g_build_filenamev' filepath='../glib/gfileutils.c' line='2287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_build_filenamev' hash='437921a6c18ce184'>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_build_filename' mangled-name='g_build_filename' filepath='../glib/gfileutils.c' line='2319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_build_filename' hash='e43aee0eb551322a'>
      <parameter type-id='type-id-14'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_file_read_link' mangled-name='g_file_read_link' filepath='../glib/gfileutils.c' line='2367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_file_read_link' hash='78659feb0f875243'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_path_is_absolute' mangled-name='g_path_is_absolute' filepath='../glib/gfileutils.c' line='2472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_path_is_absolute' hash='d731989df7e70156'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_path_skip_root' mangled-name='g_path_skip_root' filepath='../glib/gfileutils.c' line='2501' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_path_skip_root' hash='2931cb4d7a0438af'>
      <parameter type-id='type-id-14' name='str' filepath='../glib/ggettext.c' line='129' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_basename' mangled-name='g_basename' filepath='../glib/gfileutils.c' line='2577' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_basename' hash='2931cb4d7a0438af'>
      <parameter type-id='type-id-14' name='str' filepath='../glib/ggettext.c' line='129' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_path_get_basename' mangled-name='g_path_get_basename' filepath='../glib/gfileutils.c' line='2620' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_path_get_basename' hash='e43aee0eb551322a'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_path_get_dirname' mangled-name='g_path_get_dirname' filepath='../glib/gfileutils.c' line='2696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_path_get_dirname' hash='e43aee0eb551322a'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_canonicalize_filename' mangled-name='g_canonicalize_filename' filepath='../glib/gfileutils.c' line='2816' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_canonicalize_filename' hash='58a789ef00ad4f55'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='g_get_current_dir' mangled-name='g_get_current_dir' filepath='../glib/gfileutils.c' line='2960' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_get_current_dir' hash='a0e4fd26be68a7ef'>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='glib_gettext' mangled-name='glib_gettext' filepath='../glib/ggettext.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='glib_gettext' hash='2931cb4d7a0438af'>
      <parameter type-id='type-id-14' name='str' filepath='../glib/ggettext.c' line='129' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='glib_pgettext' mangled-name='glib_pgettext' filepath='../glib/ggettext.c' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='glib_pgettext' hash='955bd3c2c15ced86'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_strip_context' mangled-name='g_strip_context' filepath='../glib/ggettext.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_strip_context' hash='374a40393f8853c8'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_dpgettext' mangled-name='g_dpgettext' filepath='../glib/ggettext.c' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dpgettext' hash='c444bd1bb9e570b9'>
      <parameter type-id='type-id-14' name='domain' filepath='../glib/ggettext.c' line='214' column='1'/>
      <parameter type-id='type-id-14' name='msgctxtid' filepath='../glib/ggettext.c' line='215' column='1'/>
      <parameter type-id='type-id-21' name='msgidoffset' filepath='../glib/ggettext.c' line='216' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_dpgettext2' mangled-name='g_dpgettext2' filepath='../glib/ggettext.c' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dpgettext2' hash='211b68d7ea067803'>
      <parameter type-id='type-id-14' name='domain' filepath='../glib/ggettext.c' line='278' column='1'/>
      <parameter type-id='type-id-14' name='msgctxt' filepath='../glib/ggettext.c' line='279' column='1'/>
      <parameter type-id='type-id-14' name='msgid' filepath='../glib/ggettext.c' line='280' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_dgettext' mangled-name='g_dgettext' filepath='../glib/ggettext.c' line='406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dgettext' hash='374a40393f8853c8'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_dcgettext' mangled-name='g_dcgettext' filepath='../glib/ggettext.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dcgettext' hash='370a5f1b75c60a3f'>
      <parameter type-id='type-id-14' name='domain' filepath='../glib/ggettext.c' line='432' column='1'/>
      <parameter type-id='type-id-14' name='msgid' filepath='../glib/ggettext.c' line='433' column='1'/>
      <parameter type-id='type-id-6' name='category' filepath='../glib/ggettext.c' line='434' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_dngettext' mangled-name='g_dngettext' filepath='../glib/ggettext.c' line='462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_dngettext' hash='9aa479def44575dd'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-295'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_hash_table_new' mangled-name='g_hash_table_new' filepath='../glib/ghash.c' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_new' hash='1ba618414f3bcc05'>
      <parameter type-id='type-id-296' name='hash_func' filepath='../glib/ghash.c' line='990' column='1'/>
      <parameter type-id='type-id-297' name='key_equal_func' filepath='../glib/ghash.c' line='991' column='1'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='g_hash_table_new_full' mangled-name='g_hash_table_new_full' filepath='../glib/ghash.c' line='1023' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_new_full' hash='b456ce04b302a266'>
      <parameter type-id='type-id-296' name='hash_func' filepath='../glib/ghash.c' line='1023' column='1'/>
      <parameter type-id='type-id-297' name='key_equal_func' filepath='../glib/ghash.c' line='1024' column='1'/>
      <parameter type-id='type-id-10' name='key_destroy_func' filepath='../glib/ghash.c' line='1025' column='1'/>
      <parameter type-id='type-id-10' name='value_destroy_func' filepath='../glib/ghash.c' line='1026' column='1'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='g_hash_table_new_similar' mangled-name='g_hash_table_new_similar' filepath='../glib/ghash.c' line='1064' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_new_similar' hash='148199a8f4f606a5'>
      <parameter type-id='type-id-62' name='other_hash_table' filepath='../glib/ghash.c' line='1064' column='1'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_init' mangled-name='g_hash_table_iter_init' filepath='../glib/ghash.c' line='1100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_iter_init' hash='c04d546d44ece3b2'>
      <parameter type-id='type-id-275'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_next' mangled-name='g_hash_table_iter_next' filepath='../glib/ghash.c' line='1130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_iter_next' hash='9cc0fb926af445b8'>
      <parameter type-id='type-id-275'/>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-207'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_get_hash_table' mangled-name='g_hash_table_iter_get_hash_table' filepath='../glib/ghash.c' line='1176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_iter_get_hash_table' hash='f83a3747ca1773cf'>
      <parameter type-id='type-id-275' name='iter' filepath='../glib/ghash.c' line='1176' column='1'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_remove' mangled-name='g_hash_table_iter_remove' filepath='../glib/ghash.c' line='1227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_iter_remove' hash='759a12ea55ad239b'>
      <parameter type-id='type-id-275' name='iter' filepath='../glib/ghash.c' line='1227' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <typedef-decl name='DIR' type-id='type-id-291' filepath='/usr/include/dirent.h' line='127' column='1' id='type-id-290'/>
    <function-type size-in-bits='64' hash='6838c8464ea823cc' id='type-id-289'>
      <parameter type-id='type-id-182'/>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-3'/>
    </function-type>
    <function-type size-in-bits='64' hash='3f7921bdb568b75e' id='type-id-298'>
      <parameter type-id='type-id-14' name='variable' filepath='../glib/genviron.c' line='363' column='1'/>
      <return type-id='type-id-3'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='&lt;artificial&gt;-434c4' comp-dir-path='/usr/src/debug/glib2-2.86.3-1.fc43.x86_64/redhat-linux-build' language='LANG_C11'>
    <enum-decl name='GIOChannelError' naming-typedef-id='type-id-299' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='57' column='1' hash='b0f6f9ee329e5c7e' id='type-id-300'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_IO_CHANNEL_ERROR_FBIG' value='0'/>
      <enumerator name='G_IO_CHANNEL_ERROR_INVAL' value='1'/>
      <enumerator name='G_IO_CHANNEL_ERROR_IO' value='2'/>
      <enumerator name='G_IO_CHANNEL_ERROR_ISDIR' value='3'/>
      <enumerator name='G_IO_CHANNEL_ERROR_NOSPC' value='4'/>
      <enumerator name='G_IO_CHANNEL_ERROR_NXIO' value='5'/>
      <enumerator name='G_IO_CHANNEL_ERROR_OVERFLOW' value='6'/>
      <enumerator name='G_IO_CHANNEL_ERROR_PIPE' value='7'/>
      <enumerator name='G_IO_CHANNEL_ERROR_FAILED' value='8'/>
    </enum-decl>
    <enum-decl name='GIOCondition' naming-typedef-id='type-id-44' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gmain.h' line='34' column='1' hash='2eab2da4c5ae2edd' id='type-id-301'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_IO_IN' value='1'/>
      <enumerator name='G_IO_OUT' value='4'/>
      <enumerator name='G_IO_PRI' value='2'/>
      <enumerator name='G_IO_ERR' value='8'/>
      <enumerator name='G_IO_HUP' value='16'/>
      <enumerator name='G_IO_NVAL' value='32'/>
    </enum-decl>
    <enum-decl name='GIOError' naming-typedef-id='type-id-302' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='47' column='1' hash='a50a29c8574768fa' id='type-id-303'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_IO_ERROR_NONE' value='0'/>
      <enumerator name='G_IO_ERROR_AGAIN' value='1'/>
      <enumerator name='G_IO_ERROR_INVAL' value='2'/>
      <enumerator name='G_IO_ERROR_UNKNOWN' value='3'/>
    </enum-decl>
    <enum-decl name='GIOFlags' naming-typedef-id='type-id-304' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='87' column='1' hash='5a9c4986bd53c9af' id='type-id-305'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_IO_FLAG_NONE' value='0'/>
      <enumerator name='G_IO_FLAG_APPEND' value='1'/>
      <enumerator name='G_IO_FLAG_NONBLOCK' value='2'/>
      <enumerator name='G_IO_FLAG_IS_READABLE' value='4'/>
      <enumerator name='G_IO_FLAG_IS_WRITABLE' value='8'/>
      <enumerator name='G_IO_FLAG_IS_WRITEABLE' value='8'/>
      <enumerator name='G_IO_FLAG_IS_SEEKABLE' value='16'/>
      <enumerator name='G_IO_FLAG_MASK' value='31'/>
      <enumerator name='G_IO_FLAG_GET_MASK' value='31'/>
      <enumerator name='G_IO_FLAG_SET_MASK' value='3'/>
    </enum-decl>
    <enum-decl name='GIOStatus' naming-typedef-id='type-id-42' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='72' column='1' hash='0bfc0e6ac1595f20' id='type-id-306'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_IO_STATUS_ERROR' value='0'/>
      <enumerator name='G_IO_STATUS_NORMAL' value='1'/>
      <enumerator name='G_IO_STATUS_EOF' value='2'/>
      <enumerator name='G_IO_STATUS_AGAIN' value='3'/>
    </enum-decl>
    <enum-decl name='GKeyFileFlags' naming-typedef-id='type-id-307' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gkeyfile.h' line='53' column='1' hash='ca3cb35bb6d7511d' id='type-id-308'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_KEY_FILE_NONE' value='0'/>
      <enumerator name='G_KEY_FILE_KEEP_COMMENTS' value='1'/>
      <enumerator name='G_KEY_FILE_KEEP_TRANSLATIONS' value='2'/>
    </enum-decl>
    <enum-decl name='GMainContextFlags' naming-typedef-id='type-id-309' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gmain.h' line='58' column='1' hash='985ef845263bf680' id='type-id-310'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_MAIN_CONTEXT_FLAGS_NONE' value='0'/>
      <enumerator name='G_MAIN_CONTEXT_FLAGS_OWNERLESS_POLLING' value='1'/>
    </enum-decl>
    <enum-decl name='GSeekType' naming-typedef-id='type-id-311' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='80' column='1' hash='af28507cd178ecb6' id='type-id-312'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_SEEK_CUR' value='0'/>
      <enumerator name='G_SEEK_SET' value='1'/>
      <enumerator name='G_SEEK_END' value='2'/>
    </enum-decl>
    <enum-decl name='GUnicodeType' naming-typedef-id='type-id-313' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gunicode.h' line='119' column='1' hash='96864642d0f59a4f' id='type-id-314'>
      <underlying-type type-id='type-id-58'/>
      <enumerator name='G_UNICODE_CONTROL' value='0'/>
      <enumerator name='G_UNICODE_FORMAT' value='1'/>
      <enumerator name='G_UNICODE_UNASSIGNED' value='2'/>
      <enumerator name='G_UNICODE_PRIVATE_USE' value='3'/>
      <enumerator name='G_UNICODE_SURROGATE' value='4'/>
      <enumerator name='G_UNICODE_LOWERCASE_LETTER' value='5'/>
      <enumerator name='G_UNICODE_MODIFIER_LETTER' value='6'/>
      <enumerator name='G_UNICODE_OTHER_LETTER' value='7'/>
      <enumerator name='G_UNICODE_TITLECASE_LETTER' value='8'/>
      <enumerator name='G_UNICODE_UPPERCASE_LETTER' value='9'/>
      <enumerator name='G_UNICODE_SPACING_MARK' value='10'/>
      <enumerator name='G_UNICODE_ENCLOSING_MARK' value='11'/>
      <enumerator name='G_UNICODE_NON_SPACING_MARK' value='12'/>
      <enumerator name='G_UNICODE_DECIMAL_NUMBER' value='13'/>
      <enumerator name='G_UNICODE_LETTER_NUMBER' value='14'/>
      <enumerator name='G_UNICODE_OTHER_NUMBER' value='15'/>
      <enumerator name='G_UNICODE_CONNECT_PUNCTUATION' value='16'/>
      <enumerator name='G_UNICODE_DASH_PUNCTUATION' value='17'/>
      <enumerator name='G_UNICODE_CLOSE_PUNCTUATION' value='18'/>
      <enumerator name='G_UNICODE_FINAL_PUNCTUATION' value='19'/>
      <enumerator name='G_UNICODE_INITIAL_PUNCTUATION' value='20'/>
      <enumerator name='G_UNICODE_OTHER_PUNCTUATION' value='21'/>
      <enumerator name='G_UNICODE_OPEN_PUNCTUATION' value='22'/>
      <enumerator name='G_UNICODE_CURRENCY_SYMBOL' value='23'/>
      <enumerator name='G_UNICODE_MODIFIER_SYMBOL' value='24'/>
      <enumerator name='G_UNICODE_MATH_SYMBOL' value='25'/>
      <enumerator name='G_UNICODE_OTHER_SYMBOL' value='26'/>
      <enumerator name='G_UNICODE_LINE_SEPARATOR' value='27'/>
      <enumerator name='G_UNICODE_PARAGRAPH_SEPARATOR' value='28'/>
      <enumerator name='G_UNICODE_SPACE_SEPARATOR' value='29'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-315' size-in-bits='48' hash='b341a146a45c7b1f' id='type-id-316'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-317'/>
    </array-type-def>
    <class-decl name='_GHook' is-struct='yes' visibility='default' size-in-bits='512' filepath='../glib/ghook.h' line='75' column='1' hash='3321248016bd7d3b' id='type-id-318'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-9' visibility='default' filepath='../glib/ghook.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-319' visibility='default' filepath='../glib/ghook.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prev' type-id='type-id-319' visibility='default' filepath='../glib/ghook.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ref_count' type-id='type-id-16' visibility='default' filepath='../glib/ghook.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hook_id' type-id='type-id-295' visibility='default' filepath='../glib/ghook.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='flags' type-id='type-id-16' visibility='default' filepath='../glib/ghook.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='func' type-id='type-id-9' visibility='default' filepath='../glib/ghook.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='destroy' type-id='type-id-10' visibility='default' filepath='../glib/ghook.h' line='84' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GHookList' is-struct='yes' visibility='default' size-in-bits='448' filepath='../glib/ghook.h' line='65' column='1' hash='c1df64d54c60fa70' id='type-id-320'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='seq_id' type-id='type-id-295' visibility='default' filepath='../glib/ghook.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hook_size' type-id='type-id-16' visibility='default' filepath='../glib/ghook.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='is_setup' type-id='type-id-16' visibility='default' filepath='../glib/ghook.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hooks' type-id='type-id-319' visibility='default' filepath='../glib/ghook.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dummy3' type-id='type-id-9' visibility='default' filepath='../glib/ghook.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='finalize_hook' type-id='type-id-321' visibility='default' filepath='../glib/ghook.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dummy' type-id='type-id-322' visibility='default' filepath='../glib/ghook.h' line='73' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GIOChannel' is-struct='yes' visibility='default' size-in-bits='896' filepath='../glib/giochannel.h' line='100' column='1' hash='52c73078aad73912' id='type-id-323'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref_count' type-id='type-id-6' visibility='default' filepath='../glib/giochannel.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='funcs' type-id='type-id-324' visibility='default' filepath='../glib/giochannel.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='encoding' type-id='type-id-27' visibility='default' filepath='../glib/giochannel.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='read_cd' type-id='type-id-204' visibility='default' filepath='../glib/giochannel.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write_cd' type-id='type-id-204' visibility='default' filepath='../glib/giochannel.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='line_term' type-id='type-id-27' visibility='default' filepath='../glib/giochannel.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='line_term_len' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='buf_size' type-id='type-id-21' visibility='default' filepath='../glib/giochannel.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='read_buf' type-id='type-id-11' visibility='default' filepath='../glib/giochannel.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='encoded_read_buf' type-id='type-id-11' visibility='default' filepath='../glib/giochannel.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='write_buf' type-id='type-id-11' visibility='default' filepath='../glib/giochannel.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='partial_write_buf' type-id='type-id-316' visibility='default' filepath='../glib/giochannel.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='752'>
        <var-decl name='use_buffer' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='753'>
        <var-decl name='do_encode' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='754'>
        <var-decl name='close_on_unref' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='755'>
        <var-decl name='is_readable' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='756'>
        <var-decl name='is_writeable' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='757'>
        <var-decl name='is_seekable' type-id='type-id-16' visibility='default' filepath='../glib/giochannel.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reserved1' type-id='type-id-9' visibility='default' filepath='../glib/giochannel.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='reserved2' type-id='type-id-9' visibility='default' filepath='../glib/giochannel.h' line='128' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GIOFuncs' is-struct='yes' visibility='default' size-in-bits='512' filepath='../glib/giochannel.h' line='134' column='1' hash='087da271ce041765' id='type-id-325'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='io_read' type-id='type-id-326' visibility='default' filepath='../glib/giochannel.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='io_write' type-id='type-id-327' visibility='default' filepath='../glib/giochannel.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='io_seek' type-id='type-id-328' visibility='default' filepath='../glib/giochannel.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='io_close' type-id='type-id-329' visibility='default' filepath='../glib/giochannel.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='io_create_watch' type-id='type-id-330' visibility='default' filepath='../glib/giochannel.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='io_free' type-id='type-id-331' visibility='default' filepath='../glib/giochannel.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='io_set_flags' type-id='type-id-332' visibility='default' filepath='../glib/giochannel.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='io_get_flags' type-id='type-id-333' visibility='default' filepath='../glib/giochannel.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GKeyFile' is-struct='yes' visibility='default' size-in-bits='576' filepath='../glib/gkeyfile.c' line='506' column='1' hash='783ec428bf1da5a5' id='type-id-334'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='groups' type-id='type-id-61' visibility='default' filepath='../glib/gkeyfile.c' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='group_hash' type-id='type-id-62' visibility='default' filepath='../glib/gkeyfile.c' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='start_group' type-id='type-id-335' visibility='default' filepath='../glib/gkeyfile.c' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='current_group' type-id='type-id-335' visibility='default' filepath='../glib/gkeyfile.c' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='parse_buffer' type-id='type-id-11' visibility='default' filepath='../glib/gkeyfile.c' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='list_separator' type-id='type-id-315' visibility='default' filepath='../glib/gkeyfile.c' line='516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='flags' type-id='type-id-307' visibility='default' filepath='../glib/gkeyfile.c' line='518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='checked_locales' type-id='type-id-32' visibility='default' filepath='../glib/gkeyfile.c' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='locales' type-id='type-id-94' visibility='default' filepath='../glib/gkeyfile.c' line='521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ref_count' type-id='type-id-6' visibility='default' filepath='../glib/gkeyfile.c' line='523' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GKeyFileGroup' is-struct='yes' visibility='default' size-in-bits='192' filepath='../glib/gkeyfile.c' line='528' column='1' hash='66ffb40ac434c3a5' id='type-id-336'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-14' visibility='default' filepath='../glib/gkeyfile.c' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key_value_pairs' type-id='type-id-61' visibility='default' filepath='../glib/gkeyfile.c' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lookup_map' type-id='type-id-62' visibility='default' filepath='../glib/gkeyfile.c' line='537' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GMainContext' is-struct='yes' visibility='default' size-in-bits='1600' filepath='../glib/gmain.c' line='184' column='1' hash='aae002dbf752c354' id='type-id-337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-50' visibility='default' filepath='../glib/gmain.c' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cond' type-id='type-id-51' visibility='default' filepath='../glib/gmain.c' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='owner' type-id='type-id-338' visibility='default' filepath='../glib/gmain.c' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='owner_count' type-id='type-id-16' visibility='default' filepath='../glib/gmain.c' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='flags' type-id='type-id-309' visibility='default' filepath='../glib/gmain.c' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='waiters' type-id='type-id-12' visibility='default' filepath='../glib/gmain.c' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ref_count' type-id='type-id-6' visibility='default' filepath='../glib/gmain.c' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sources' type-id='type-id-62' visibility='default' filepath='../glib/gmain.c' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pending_dispatches' type-id='type-id-339' visibility='default' filepath='../glib/gmain.c' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='timeout_usec' type-id='type-id-265' visibility='default' filepath='../glib/gmain.c' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='next_id' type-id='type-id-16' visibility='default' filepath='../glib/gmain.c' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='source_lists' type-id='type-id-52' visibility='default' filepath='../glib/gmain.c' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='in_check_or_prepare' type-id='type-id-6' visibility='default' filepath='../glib/gmain.c' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='poll_records' type-id='type-id-340' visibility='default' filepath='../glib/gmain.c' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='n_poll_records' type-id='type-id-16' visibility='default' filepath='../glib/gmain.c' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='cached_poll_array' type-id='type-id-341' visibility='default' filepath='../glib/gmain.c' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='cached_poll_array_size' type-id='type-id-16' visibility='default' filepath='../glib/gmain.c' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='wakeup' type-id='type-id-342' visibility='default' filepath='../glib/gmain.c' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='wake_up_rec' type-id='type-id-343' visibility='default' filepath='../glib/gmain.c' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='poll_changed' type-id='type-id-32' visibility='default' filepath='../glib/gmain.c' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='poll_func' type-id='type-id-344' visibility='default' filepath='../glib/gmain.c' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='time' type-id='type-id-265' visibility='default' filepath='../glib/gmain.c' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='time_is_fresh' type-id='type-id-32' visibility='default' filepath='../glib/gmain.c' line='222' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GPollFD' is-struct='yes' visibility='default' size-in-bits='64' filepath='../glib/gpoll.h' line='93' column='1' hash='a16bdc3b8bccb808' id='type-id-345'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-6' visibility='default' filepath='../glib/gpoll.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='events' type-id='type-id-346' visibility='default' filepath='../glib/gpoll.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='revents' type-id='type-id-346' visibility='default' filepath='../glib/gpoll.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GPollRec' is-struct='yes' visibility='default' size-in-bits='256' filepath='../glib/gmain.c' line='274' column='1' hash='3ced310d68bcef54' id='type-id-347'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-341' visibility='default' filepath='../glib/gmain.c' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-340' visibility='default' filepath='../glib/gmain.c' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next' type-id='type-id-340' visibility='default' filepath='../glib/gmain.c' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priority' type-id='type-id-6' visibility='default' filepath='../glib/gmain.c' line='279' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSource' is-struct='yes' visibility='default' size-in-bits='768' filepath='../glib/gmain.h' line='267' column='1' hash='634dec89125dbeda' id='type-id-348'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='callback_data' type-id='type-id-9' visibility='default' filepath='../glib/gmain.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='callback_funcs' type-id='type-id-349' visibility='default' filepath='../glib/gmain.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='source_funcs' type-id='type-id-350' visibility='default' filepath='../glib/gmain.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ref_count' type-id='type-id-16' visibility='default' filepath='../glib/gmain.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='context' type-id='type-id-34' visibility='default' filepath='../glib/gmain.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priority' type-id='type-id-6' visibility='default' filepath='../glib/gmain.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='flags' type-id='type-id-16' visibility='default' filepath='../glib/gmain.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='source_id' type-id='type-id-16' visibility='default' filepath='../glib/gmain.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='poll_fds' type-id='type-id-12' visibility='default' filepath='../glib/gmain.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='prev' type-id='type-id-45' visibility='default' filepath='../glib/gmain.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='next' type-id='type-id-45' visibility='default' filepath='../glib/gmain.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='name' type-id='type-id-234' visibility='default' filepath='../glib/gmain.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='priv' type-id='type-id-351' visibility='default' filepath='../glib/gmain.h' line='289' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSourceCallbackFuncs' is-struct='yes' visibility='default' size-in-bits='192' filepath='../glib/gmain.h' line='292' column='1' hash='5ce4f90a5649308f' id='type-id-352'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ref' type-id='type-id-353' visibility='default' filepath='../glib/gmain.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='unref' type-id='type-id-353' visibility='default' filepath='../glib/gmain.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get' type-id='type-id-354' visibility='default' filepath='../glib/gmain.h' line='296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSourceFuncs' is-struct='yes' visibility='default' size-in-bits='384' filepath='../glib/gmain.h' line='399' column='1' hash='4c54e0c20bf56e0d' id='type-id-355'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prepare' type-id='type-id-356' visibility='default' filepath='../glib/gmain.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='check' type-id='type-id-357' visibility='default' filepath='../glib/gmain.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dispatch' type-id='type-id-358' visibility='default' filepath='../glib/gmain.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='finalize' type-id='type-id-359' visibility='default' filepath='../glib/gmain.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure_callback' type-id='type-id-360' visibility='default' filepath='../glib/gmain.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='closure_marshal' type-id='type-id-361' visibility='default' filepath='../glib/gmain.h' line='409' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GSourcePrivate' is-struct='yes' visibility='default' size-in-bits='384' filepath='../glib/gmain.c' line='282' column='1' hash='837200bcd6327e62' id='type-id-362'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='child_sources' type-id='type-id-12' visibility='default' filepath='../glib/gmain.c' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='parent_source' type-id='type-id-45' visibility='default' filepath='../glib/gmain.c' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ready_time' type-id='type-id-265' visibility='default' filepath='../glib/gmain.c' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fds' type-id='type-id-12' visibility='default' filepath='../glib/gmain.c' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dispose' type-id='type-id-363' visibility='default' filepath='../glib/gmain.c' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='static_name' type-id='type-id-32' visibility='default' filepath='../glib/gmain.c' line='296' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GHRFunc' type-id='type-id-364' size-in-bits='64' filepath='../glib/ghash.h' line='42' column='1' hash='fd7a63c0c6c822c4' id='type-id-365'/>
    <typedef-decl name='GHmac' type-id='type-id-23' size-in-bits='192' filepath='../glib/ghmac.h' line='33' column='1' id='type-id-366'/>
    <typedef-decl name='GHook' type-id='type-id-318' size-in-bits='512' filepath='../glib/ghook.h' line='40' column='1' id='type-id-367'/>
    <typedef-decl name='GHookCheckMarshaller' type-id='type-id-368' size-in-bits='64' filepath='../glib/ghook.h' line='49' column='1' hash='fd7a63c0c6c822c4' id='type-id-369'/>
    <typedef-decl name='GHookCompareFunc' type-id='type-id-370' size-in-bits='64' filepath='../glib/ghook.h' line='43' column='1' hash='fd7a63c0c6c822c4' id='type-id-371'/>
    <typedef-decl name='GHookFinalizeFunc' type-id='type-id-372' size-in-bits='64' filepath='../glib/ghook.h' line='53' column='1' hash='fd7a63c0c6c822c4' id='type-id-321'/>
    <typedef-decl name='GHookFindFunc' type-id='type-id-368' size-in-bits='64' filepath='../glib/ghook.h' line='45' column='1' hash='fd7a63c0c6c822c4' id='type-id-373'/>
    <typedef-decl name='GHookList' type-id='type-id-320' size-in-bits='448' filepath='../glib/ghook.h' line='41' column='1' id='type-id-374'/>
    <typedef-decl name='GHookMarshaller' type-id='type-id-375' size-in-bits='64' filepath='../glib/ghook.h' line='47' column='1' hash='fd7a63c0c6c822c4' id='type-id-376'/>
    <typedef-decl name='GIOChannel' type-id='type-id-323' size-in-bits='896' filepath='../glib/giochannel.h' line='43' column='1' id='type-id-377'/>
    <typedef-decl name='GIOChannelError' type-id='type-id-300' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='69' column='1' hash='b0f6f9ee329e5c7e' id='type-id-299'/>
    <typedef-decl name='GIOCondition' type-id='type-id-301' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gmain.h' line='41' column='1' hash='2eab2da4c5ae2edd' id='type-id-44'/>
    <typedef-decl name='GIOError' type-id='type-id-303' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='52' column='1' hash='a50a29c8574768fa' id='type-id-302'/>
    <typedef-decl name='GIOFlags' type-id='type-id-305' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='98' column='1' hash='5a9c4986bd53c9af' id='type-id-304'/>
    <typedef-decl name='GIOFunc' type-id='type-id-378' size-in-bits='64' filepath='../glib/giochannel.h' line='131' column='1' hash='fd7a63c0c6c822c4' id='type-id-379'/>
    <typedef-decl name='GIOFuncs' type-id='type-id-325' size-in-bits='512' filepath='../glib/giochannel.h' line='44' column='1' id='type-id-380'/>
    <typedef-decl name='GIOStatus' type-id='type-id-306' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='77' column='1' hash='0bfc0e6ac1595f20' id='type-id-42'/>
    <typedef-decl name='GKeyFile' type-id='type-id-334' size-in-bits='576' filepath='../glib/gkeyfile.h' line='50' column='1' id='type-id-381'/>
    <typedef-decl name='GKeyFileFlags' type-id='type-id-308' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gkeyfile.h' line='57' column='1' hash='ca3cb35bb6d7511d' id='type-id-307'/>
    <typedef-decl name='GKeyFileGroup' type-id='type-id-336' size-in-bits='192' filepath='../glib/gkeyfile.c' line='504' column='1' id='type-id-382'/>
    <typedef-decl name='GMainContext' type-id='type-id-337' size-in-bits='1600' filepath='../glib/gmain.h' line='70' column='1' id='type-id-383'/>
    <typedef-decl name='GMainContextFlags' type-id='type-id-310' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gmain.h' line='61' column='1' hash='985ef845263bf680' id='type-id-309'/>
    <typedef-decl name='GPollFD' type-id='type-id-345' size-in-bits='64' filepath='../glib/gpoll.h' line='61' column='1' id='type-id-343'/>
    <typedef-decl name='GPollFunc' type-id='type-id-384' size-in-bits='64' filepath='../glib/gpoll.h' line='76' column='1' hash='fd7a63c0c6c822c4' id='type-id-344'/>
    <typedef-decl name='GPollRec' type-id='type-id-347' size-in-bits='256' filepath='../glib/gmain.c' line='145' column='1' id='type-id-385'/>
    <typedef-decl name='GSeekType' type-id='type-id-312' size-in-bits='32' alignment-in-bits='32' filepath='../glib/giochannel.h' line='84' column='1' hash='af28507cd178ecb6' id='type-id-311'/>
    <typedef-decl name='GSource' type-id='type-id-348' size-in-bits='768' filepath='../glib/gmain.h' line='86' column='1' id='type-id-386'/>
    <typedef-decl name='GSourceCallbackFuncs' type-id='type-id-352' size-in-bits='192' filepath='../glib/gmain.h' line='99' column='1' id='type-id-387'/>
    <typedef-decl name='GSourceDisposeFunc' type-id='type-id-388' size-in-bits='64' filepath='../glib/gmain.h' line='265' column='1' hash='fd7a63c0c6c822c4' id='type-id-363'/>
    <typedef-decl name='GSourceDummyMarshal' type-id='type-id-389' size-in-bits='64' filepath='../glib/gmain.h' line='308' column='1' hash='fd7a63c0c6c822c4' id='type-id-361'/>
    <typedef-decl name='GSourceFunc' type-id='type-id-390' size-in-bits='64' filepath='../glib/gmain.h' line='200' column='1' hash='fd7a63c0c6c822c4' id='type-id-360'/>
    <typedef-decl name='GSourceFuncs' type-id='type-id-355' size-in-bits='384' filepath='../glib/gmain.h' line='158' column='1' id='type-id-391'/>
    <typedef-decl name='GSourceFuncsCheckFunc' type-id='type-id-392' size-in-bits='64' filepath='../glib/gmain.h' line='355' column='1' hash='fd7a63c0c6c822c4' id='type-id-357'/>
    <typedef-decl name='GSourceFuncsDispatchFunc' type-id='type-id-393' size-in-bits='64' filepath='../glib/gmain.h' line='380' column='1' hash='fd7a63c0c6c822c4' id='type-id-358'/>
    <typedef-decl name='GSourceFuncsFinalizeFunc' type-id='type-id-388' size-in-bits='64' filepath='../glib/gmain.h' line='397' column='1' hash='fd7a63c0c6c822c4' id='type-id-359'/>
    <typedef-decl name='GSourceFuncsPrepareFunc' type-id='type-id-394' size-in-bits='64' filepath='../glib/gmain.h' line='334' column='1' hash='fd7a63c0c6c822c4' id='type-id-356'/>
    <typedef-decl name='GSourcePrivate' type-id='type-id-362' size-in-bits='384' filepath='../glib/gmain.h' line='87' column='1' id='type-id-395'/>
    <typedef-decl name='GUnicodeType' type-id='type-id-314' size-in-bits='32' alignment-in-bits='32' filepath='../glib/gunicode.h' line='150' column='1' hash='96864642d0f59a4f' id='type-id-313'/>
    <typedef-decl name='GWakeup' type-id='type-id-396' size-in-bits='64' filepath='../glib/gwakeup.h' line='27' column='1' id='type-id-397'/>
    <typedef-decl name='gushort' type-id='type-id-169' size-in-bits='16' filepath='../glib/gtypes.h' line='59' column='1' hash='d7723bb93a30b11d' id='type-id-346'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' hash='9479ca579892d228' id='type-id-398'/>
    <pointer-type-def type-id='type-id-367' size-in-bits='64' hash='b97047dce1009758' id='type-id-319'/>
    <pointer-type-def type-id='type-id-374' size-in-bits='64' hash='ce99936698d6149d' id='type-id-399'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' hash='93550a37558be942' id='type-id-30'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-333'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' hash='794cfad536cded25' id='type-id-324'/>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-329'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-332'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-327'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-326'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-328'/>
    <pointer-type-def type-id='type-id-381' size-in-bits='64' hash='d9597a417c0c0f64' id='type-id-405'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' hash='012cab24a633d94e' id='type-id-335'/>
    <pointer-type-def type-id='type-id-383' size-in-bits='64' hash='72dd1d152e6bccdf' id='type-id-34'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' hash='027ab9cab58d6d0d' id='type-id-341'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' hash='fd216d6fb936320d' id='type-id-340'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' hash='f75bf6b644ee8e9d' id='type-id-45'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-330'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' hash='79f28c62b736dcd7' id='type-id-349'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' hash='d22e865d7fe0fe58' id='type-id-406'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' hash='4a25dc6cbcfef273' id='type-id-351'/>
    <pointer-type-def type-id='type-id-397' size-in-bits='64' hash='688b604b0899584e' id='type-id-342'/>
    <qualified-type-def type-id='type-id-391' const='yes' hash='df2ed216739452ea' id='type-id-407'/>
    <pointer-type-def type-id='type-id-407' size-in-bits='64' hash='9c0ddb92a32407b0' id='type-id-350'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-368'/>
    <pointer-type-def type-id='type-id-409' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-378'/>
    <pointer-type-def type-id='type-id-410' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-392'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-393'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-394'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-390'/>
    <pointer-type-def type-id='type-id-413' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-364'/>
    <pointer-type-def type-id='type-id-414' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-370'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-384'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' hash='8f7253a876e787e3' id='type-id-417'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' hash='2a03f946d3a2a4e3' id='type-id-419'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-375'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-372'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-331'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-388'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-354'/>
    <class-decl name='_GWakeup' is-struct='yes' visibility='default' size-in-bits='64' filepath='../glib/gwakeup.c' line='120' column='1' hash='8fcd0998f6a0595b' id='type-id-396'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fds' type-id='type-id-424' visibility='default' filepath='../glib/gwakeup.c' line='122' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='g_hash_table_iter_replace' mangled-name='g_hash_table_iter_replace' filepath='../glib/ghash.c' line='1361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_iter_replace' hash='759a12ea55ad239b'>
      <parameter type-id='type-id-275' name='iter' filepath='../glib/ghash.c' line='1361' column='1'/>
      <parameter type-id='type-id-9' name='value' filepath='../glib/ghash.c' line='1362' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_steal' mangled-name='g_hash_table_iter_steal' filepath='../glib/ghash.c' line='1402' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_iter_steal' hash='759a12ea55ad239b'>
      <parameter type-id='type-id-275' name='iter' filepath='../glib/ghash.c' line='1227' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_hash_table_ref' mangled-name='g_hash_table_ref' filepath='../glib/ghash.c' line='1420' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_ref' hash='148199a8f4f606a5'>
      <parameter type-id='type-id-62' name='other_hash_table' filepath='../glib/ghash.c' line='1064' column='1'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='g_hash_table_unref' mangled-name='g_hash_table_unref' filepath='../glib/ghash.c' line='1441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_unref' hash='fee2e0107105c122'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_hash_table_destroy' mangled-name='g_hash_table_destroy' filepath='../glib/ghash.c' line='1468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_destroy' hash='fee2e0107105c122'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_hash_table_lookup' mangled-name='g_hash_table_lookup' filepath='../glib/ghash.c' line='1489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_lookup' hash='fee2e0107105c122'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='1489' column='1'/>
      <parameter type-id='type-id-18' name='key' filepath='../glib/ghash.c' line='1490' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_hash_table_lookup_extended' mangled-name='g_hash_table_lookup_extended' filepath='../glib/ghash.c' line='1524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_lookup_extended' hash='42690704001aa21c'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='1524' column='1'/>
      <parameter type-id='type-id-18' name='lookup_key' filepath='../glib/ghash.c' line='1525' column='1'/>
      <parameter type-id='type-id-207' name='orig_key' filepath='../glib/ghash.c' line='1526' column='1'/>
      <parameter type-id='type-id-207' name='value' filepath='../glib/ghash.c' line='1527' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_hash_table_insert' mangled-name='g_hash_table_insert' filepath='../glib/ghash.c' line='1611' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_insert' hash='187628965cc82d83'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='1611' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='../glib/ghash.c' line='1612' column='1'/>
      <parameter type-id='type-id-9' name='value' filepath='../glib/ghash.c' line='1613' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_hash_table_replace' mangled-name='g_hash_table_replace' filepath='../glib/ghash.c' line='1639' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_replace' hash='187628965cc82d83'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='1611' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='../glib/ghash.c' line='1612' column='1'/>
      <parameter type-id='type-id-9' name='value' filepath='../glib/ghash.c' line='1613' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_hash_table_add' mangled-name='g_hash_table_add' filepath='../glib/ghash.c' line='1672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_add' hash='187628965cc82d83'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='1672' column='1'/>
      <parameter type-id='type-id-9' name='key' filepath='../glib/ghash.c' line='1673' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_hash_table_contains' mangled-name='g_hash_table_contains' filepath='../glib/ghash.c' line='1690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_contains' hash='187628965cc82d83'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_hash_table_remove' mangled-name='g_hash_table_remove' filepath='../glib/ghash.c' line='1756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_remove' hash='187628965cc82d83'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_hash_table_steal' mangled-name='g_hash_table_steal' filepath='../glib/ghash.c' line='1773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_steal' hash='187628965cc82d83'>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-18'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_hash_table_steal_extended' mangled-name='g_hash_table_steal_extended' filepath='../glib/ghash.c' line='1810' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_steal_extended' hash='42690704001aa21c'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='1524' column='1'/>
      <parameter type-id='type-id-18' name='lookup_key' filepath='../glib/ghash.c' line='1525' column='1'/>
      <parameter type-id='type-id-207' name='orig_key' filepath='../glib/ghash.c' line='1526' column='1'/>
      <parameter type-id='type-id-207' name='value' filepath='../glib/ghash.c' line='1527' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='g_hash_table_remove_all' mangled-name='g_hash_table_remove_all' filepath='../glib/ghash.c' line='1872' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_remove_all' hash='fee2e0107105c122'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_hash_table_steal_all' mangled-name='g_hash_table_steal_all' filepath='../glib/ghash.c' line='1895' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_steal_all' hash='fee2e0107105c122'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_hash_table_steal_all_keys' mangled-name='g_hash_table_steal_all_keys' filepath='../glib/ghash.c' line='1923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_steal_all_keys' hash='b8a3d1aa3a4a1907'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='2332' column='1'/>
      <return type-id='type-id-339'/>
    </function-decl>
    <function-decl name='g_hash_table_steal_all_values' mangled-name='g_hash_table_steal_all_values' filepath='../glib/ghash.c' line='1960' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_steal_all_values' hash='b8a3d1aa3a4a1907'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='2332' column='1'/>
      <return type-id='type-id-339'/>
    </function-decl>
    <function-decl name='g_hash_table_foreach_remove' mangled-name='g_hash_table_foreach_remove' filepath='../glib/ghash.c' line='2057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_foreach_remove' hash='f24ffcf82de2024e'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='2057' column='1'/>
      <parameter type-id='type-id-365' name='func' filepath='../glib/ghash.c' line='2058' column='1'/>
      <parameter type-id='type-id-9' name='user_data' filepath='../glib/ghash.c' line='2059' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_hash_table_foreach_steal' mangled-name='g_hash_table_foreach_steal' filepath='../glib/ghash.c' line='2084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_foreach_steal' hash='f24ffcf82de2024e'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='2057' column='1'/>
      <parameter type-id='type-id-365' name='func' filepath='../glib/ghash.c' line='2058' column='1'/>
      <parameter type-id='type-id-9' name='user_data' filepath='../glib/ghash.c' line='2059' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_hash_table_foreach' mangled-name='g_hash_table_foreach' filepath='../glib/ghash.c' line='2114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_foreach' hash='dbb003394a81dc2d'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='2114' column='1'/>
      <parameter type-id='type-id-425' name='func' filepath='../glib/ghash.c' line='2115' column='1'/>
      <parameter type-id='type-id-9' name='user_data' filepath='../glib/ghash.c' line='2116' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='g_hash_table_find' mangled-name='g_hash_table_find' filepath='../glib/ghash.c' line='2172' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_find' hash='dbb003394a81dc2d'>
      <parameter type-id='type-id-62' name='hash_table' filepath='../glib/ghash.c' line='2172' column='1'/>
      <parameter type-id='type-id-365' name='predicate' filepath='../glib/ghash.c' line='2173' column='1'/>
      <parameter type-id='type-id-9' name='user_data' filepath='../glib/ghash.c' line='2174' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='g_hash_table_size' mangled-name='g_hash_table_size' filepath='../glib/ghash.c' line='2220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_hash_table_size' hash='0a81d0c1174a41bf'>
