<abi-corpus version='2.4' architecture='elf-amd-x86_64' soname='libc.so.6'>
  <elf-needed>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_Exit' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_Fork' version='GLIBC_2.34' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_IO_adjust_column' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_IO_adjust_wcolumn' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_IO_default_doallocate' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_IO_default_finish' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_IO_default_pbackfail' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='sys_nerr' size='4' version='GLIBC_2.3' is-default-version='no' type='object-type' binding='global-binding' visibility='default-visibility' alias='_sys_nerr@GLIBC_2.3' is-defined='yes'/>
    <elf-symbol name='sys_nerr' size='4' version='GLIBC_2.4' is-default-version='no' type='object-type' binding='global-binding' visibility='default-visibility' alias='_sys_nerr@GLIBC_2.4' is-defined='yes'/>
    <elf-symbol name='sys_sigabbrev' size='512' version='GLIBC_2.2.5' is-default-version='no' type='object-type' binding='global-binding' visibility='default-visibility' alias='sys_sigabbrev@GLIBC_2.3.3' is-defined='yes'/>
    <elf-symbol name='sys_sigabbrev' size='520' version='GLIBC_2.3.3' is-default-version='no' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='sys_siglist' size='512' version='GLIBC_2.2.5' is-default-version='no' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='sys_siglist' size='520' version='GLIBC_2.3.3' is-default-version='no' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='timezone' size='8' version='GLIBC_2.2.5' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tzname' size='16' version='GLIBC_2.2.5' is-default-version='yes' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <undefined-elf-function-symbols>
    <elf-symbol name='__tls_get_addr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__tunable_get_val' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__tunable_is_initialized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_dl_allocate_tls' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_dl_allocate_tls_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_dl_audit_preinit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_dl_audit_symbind_alt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_dl_catch_exception' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_dl_deallocate_tls' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_dl_find_dso_for_object' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_dl_rtld_di_serinfo' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_dl_signal_error' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_dl_signal_exception' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='__libc_enable_secure' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__libc_stack_end' version='GLIBC_2.2.5' is-default-version='yes' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__rseq_offset' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__rseq_size' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_dl_argv' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_rtld_global' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_rtld_global_ro' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='argp-ba.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp' language='LANG_C11'>
    <var-decl name='argp_program_bug_address' type-id='type-id-1' mangled-name='argp_program_bug_address' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-ba.c' line='25' column='1' elf-symbol-id='argp_program_bug_address@@GLIBC_2.2.5'/>
  </abi-instr>
  <abi-instr address-size='64' path='argp-eexst.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp' language='LANG_C11'>
    <var-decl name='argp_err_exit_status' type-id='type-id-2' mangled-name='argp_err_exit_status' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-eexst.c' line='31' column='1' elf-symbol-id='argp_err_exit_status@@GLIBC_2.2.5'/>
  </abi-instr>
  <abi-instr address-size='64' path='argp-fmtstream.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp' language='LANG_C11'>
    <function-type size-in-bits='64' hash='dfcaf269970e9f69' id='type-id-3'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-6'>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='argp-fs-xinl.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp' language='LANG_C11'>
    <class-decl name='argp_fmtstream' is-struct='yes' visibility='default' size-in-bits='576' filepath='../argp/argp-fmtstream.h' line='80' column='1' hash='de782d656d9065d8' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stream' type-id='type-id-4' visibility='default' filepath='../argp/argp-fmtstream.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lmargin' type-id='type-id-9' visibility='default' filepath='../argp/argp-fmtstream.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rmargin' type-id='type-id-9' visibility='default' filepath='../argp/argp-fmtstream.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wmargin' type-id='type-id-10' visibility='default' filepath='../argp/argp-fmtstream.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='point_offs' type-id='type-id-9' visibility='default' filepath='../argp/argp-fmtstream.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='point_col' type-id='type-id-10' visibility='default' filepath='../argp/argp-fmtstream.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='buf' type-id='type-id-11' visibility='default' filepath='../argp/argp-fmtstream.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='p' type-id='type-id-11' visibility='default' filepath='../argp/argp-fmtstream.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='end' type-id='type-id-11' visibility='default' filepath='../argp/argp-fmtstream.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='argp_fmtstream_t' type-id='type-id-12' size-in-bits='64' filepath='../argp/argp-fmtstream.h' line='97' column='1' hash='a421119c2b8d6d65' id='type-id-13'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' hash='a421119c2b8d6d65' id='type-id-12'/>
  </abi-instr>
  <abi-instr address-size='64' path='argp-help.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp' language='LANG_C11'>
    <class-decl name='argp' is-struct='yes' visibility='default' size-in-bits='448' filepath='../argp/argp.h' line='182' column='1' hash='0e054edcd407d675' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='options' type-id='type-id-15' visibility='default' filepath='../argp/argp.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='parser' type-id='type-id-16' visibility='default' filepath='../argp/argp.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='args_doc' type-id='type-id-1' visibility='default' filepath='../argp/argp.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-1' visibility='default' filepath='../argp/argp.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='children' type-id='type-id-17' visibility='default' filepath='../argp/argp.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='help_filter' type-id='type-id-18' visibility='default' filepath='../argp/argp.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='argp_domain' type-id='type-id-1' visibility='default' filepath='../argp/argp.h' line='232' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='argp_child' is-struct='yes' visibility='default' size-in-bits='256' filepath='../argp/argp.h' line='248' column='1' hash='af6f0fc13f7a12cc' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='argp' type-id='type-id-20' visibility='default' filepath='../argp/argp.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='type-id-5' visibility='default' filepath='../argp/argp.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='header' type-id='type-id-1' visibility='default' filepath='../argp/argp.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='group' type-id='type-id-5' visibility='default' filepath='../argp/argp.h' line='268' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='argp_option' is-struct='yes' visibility='default' size-in-bits='384' filepath='../argp/argp.h' line='43' column='1' hash='f3548f70fabad087' id='type-id-21'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default' filepath='../argp/argp.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='type-id-5' visibility='default' filepath='../argp/argp.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='arg' type-id='type-id-1' visibility='default' filepath='../argp/argp.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-5' visibility='default' filepath='../argp/argp.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-1' visibility='default' filepath='../argp/argp.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='group' type-id='type-id-5' visibility='default' filepath='../argp/argp.h' line='73' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='argp_state' is-struct='yes' visibility='default' size-in-bits='768' filepath='../argp/argp.h' line='273' column='1' hash='399c1228878e6f9f' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='root_argp' type-id='type-id-20' visibility='default' filepath='../argp/argp.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='argc' type-id='type-id-5' visibility='default' filepath='../argp/argp.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='argv' type-id='type-id-23' visibility='default' filepath='../argp/argp.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next' type-id='type-id-5' visibility='default' filepath='../argp/argp.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='flags' type-id='type-id-24' visibility='default' filepath='../argp/argp.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='arg_num' type-id='type-id-24' visibility='default' filepath='../argp/argp.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='quoted' type-id='type-id-5' visibility='default' filepath='../argp/argp.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='input' type-id='type-id-25' visibility='default' filepath='../argp/argp.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='child_inputs' type-id='type-id-26' visibility='default' filepath='../argp/argp.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hook' type-id='type-id-25' visibility='default' filepath='../argp/argp.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='name' type-id='type-id-11' visibility='default' filepath='../argp/argp.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='err_stream' type-id='type-id-4' visibility='default' filepath='../argp/argp.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='out_stream' type-id='type-id-4' visibility='default' filepath='../argp/argp.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='pstate' type-id='type-id-25' visibility='default' filepath='../argp/argp.h' line='316' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='argp_parser_t' type-id='type-id-27' size-in-bits='64' filepath='../argp/argp.h' line='113' column='1' hash='fd7a63c0c6c822c4' id='type-id-16'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' hash='422675d2f00b0c82' id='type-id-28'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-18'/>
    <qualified-type-def type-id='type-id-14' const='yes' hash='ddb36999440cfd15' id='type-id-30'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' hash='ca3ac87eae1591d6' id='type-id-20'/>
    <qualified-type-def type-id='type-id-20' restrict='yes' hash='20488f9be5213f61' id='type-id-31'/>
    <qualified-type-def type-id='type-id-19' const='yes' hash='af5de5131dbdf14b' id='type-id-32'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' hash='1680bfbf08224adb' id='type-id-17'/>
    <qualified-type-def type-id='type-id-21' const='yes' hash='84021f14750ae0fb' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' hash='0c14e5879e6f39bf' id='type-id-15'/>
    <qualified-type-def type-id='type-id-22' const='yes' hash='9d3bccc68593ae92' id='type-id-34'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' hash='1b96d92d50e62f3c' id='type-id-35'/>
    <qualified-type-def type-id='type-id-35' restrict='yes' hash='df426deccba529c2' id='type-id-36'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-27'/>
    <function-decl name='__argp_help' mangled-name='argp_help' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='argp_help@@GLIBC_2.2.5' hash='a622374cc406c689'>
      <parameter type-id='type-id-20' name='argp' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1801' column='1'/>
      <parameter type-id='type-id-4' name='stream' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1801' column='1'/>
      <parameter type-id='type-id-24' name='flags' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1802' column='1'/>
      <parameter type-id='type-id-11' name='name' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1802' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='__argp_state_help' mangled-name='argp_state_help' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1839' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='argp_state_help@@GLIBC_2.2.5' hash='2bcbca554c5e5666'>
      <parameter type-id='type-id-35' name='state' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1839' column='1'/>
      <parameter type-id='type-id-4' name='stream' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1839' column='1'/>
      <parameter type-id='type-id-24' name='flags' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1839' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='__argp_error' mangled-name='argp_error' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1909' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='argp_error@@GLIBC_2.2.5' hash='9db30cdae22d82e1'>
      <parameter type-id='type-id-35' name='state' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1909' column='1'/>
      <parameter type-id='type-id-1' name='fmt' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='1909' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='__argp_failure' mangled-name='argp_failure' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='2005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='argp_failure@@GLIBC_2.2.5' hash='f224d06a28da3ab0'>
      <parameter type-id='type-id-35' name='state' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='2005' column='1'/>
      <parameter type-id='type-id-5' name='status' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='2005' column='1'/>
      <parameter type-id='type-id-5' name='errnum' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='2005' column='1'/>
      <parameter type-id='type-id-1' name='fmt' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-help.c' line='2006' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='63f13efed1e26e48' id='type-id-29'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' hash='68664f2994a80180' id='type-id-37'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-2'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='argp-parse.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp' language='LANG_C11'>
    <qualified-type-def type-id='type-id-28' restrict='yes' hash='f1f1c944e9e4d247' id='type-id-38'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-40'/>
    <function-decl name='__argp_parse' mangled-name='argp_parse' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-parse.c' line='869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='argp_parse@@GLIBC_2.2.5' hash='62e4883b8a920c20'>
      <parameter type-id='type-id-20' name='argp' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-parse.c' line='869' column='1'/>
      <parameter type-id='type-id-5' name='argc' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-parse.c' line='869' column='1'/>
      <parameter type-id='type-id-23' name='argv' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-parse.c' line='869' column='1'/>
      <parameter type-id='type-id-24' name='flags' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-parse.c' line='869' column='1'/>
      <parameter type-id='type-id-41' name='end_index' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-parse.c' line='870' column='1'/>
      <parameter type-id='type-id-25' name='input' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-parse.c' line='870' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' hash='2a1b649cc8bd3160' id='type-id-39'>
      <parameter type-id='type-id-42'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='argp-pv.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp' language='LANG_C11'>
    <var-decl name='argp_program_version' type-id='type-id-1' mangled-name='argp_program_version' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-pv.c' line='24' column='1' elf-symbol-id='argp_program_version@@GLIBC_2.2.5'/>
  </abi-instr>
  <abi-instr address-size='64' path='argp-pvh.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp' language='LANG_C11'>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-44'/>
    <var-decl name='argp_program_version_hook' type-id='type-id-44' mangled-name='argp_program_version_hook' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp/argp-pvh.c' line='31' column='1' elf-symbol-id='argp_program_version_hook@@GLIBC_2.2.5'/>
    <function-type size-in-bits='64' hash='c1cff50cd593f86d' id='type-id-43'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-28'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='argp-xinl.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/argp' language='LANG_C11'>
    <function-decl name='__argp_usage' mangled-name='argp_usage' filepath='../argp/argp.h' line='526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='argp_usage@@GLIBC_2.2.5' hash='38c1061b1977db1a'>
      <parameter type-id='type-id-35' name='__state' filepath='../argp/argp.h' line='526' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='__assert.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert' language='LANG_C11'>
    <function-decl name='__assert' mangled-name='__assert' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert/__assert.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__assert@@GLIBC_2.2.5' hash='05ab1293c22ba15e'>
      <parameter type-id='type-id-1' name='assertion' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert/__assert.c' line='23' column='1'/>
      <parameter type-id='type-id-1' name='file' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert/__assert.c' line='23' column='1'/>
      <parameter type-id='type-id-5' name='line' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert/__assert.c' line='23' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='assert-perr.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert' language='LANG_C11'>
    <function-decl name='__assert_perror_fail' mangled-name='__GI___assert_perror_fail' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert/assert-perr.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__assert_perror_fail@@GLIBC_2.2.5' hash='87e9dbd0b397c28d'>
      <parameter type-id='type-id-5' name='errnum' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert/assert-perr.c' line='28' column='1'/>
      <parameter type-id='type-id-1' name='file' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert/assert-perr.c' line='29' column='1'/>
      <parameter type-id='type-id-24' name='line' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert/assert-perr.c' line='29' column='1'/>
      <parameter type-id='type-id-1' name='function' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert/assert-perr.c' line='30' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='assert.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert' language='LANG_C11'>
    <class-decl name='abort_msg_s' is-struct='yes' visibility='default' size-in-bits='32' filepath='../include/stdlib.h' line='363' column='1' hash='a6978608c4f3ddd6' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='type-id-24' visibility='default' filepath='../include/stdlib.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='msg' type-id='type-id-46' visibility='default' filepath='../include/stdlib.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='../misc/bits/types/struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='type-id-25' visibility='default' filepath='../misc/bits/types/struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='type-id-9' visibility='default' filepath='../misc/bits/types/struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__gconv_btowc_fct' type-id='type-id-48' size-in-bits='64' filepath='../iconv/gconv.h' line='76' column='1' hash='fd7a63c0c6c822c4' id='type-id-49'/>
    <typedef-decl name='__gconv_end_fct' type-id='type-id-50' size-in-bits='64' filepath='../iconv/gconv.h' line='80' column='1' hash='fd7a63c0c6c822c4' id='type-id-51'/>
    <typedef-decl name='__gconv_fct' type-id='type-id-52' size-in-bits='64' filepath='../iconv/gconv.h' line='71' column='1' hash='fd7a63c0c6c822c4' id='type-id-53'/>
    <typedef-decl name='__gconv_init_fct' type-id='type-id-54' size-in-bits='64' filepath='../iconv/gconv.h' line='79' column='1' hash='fd7a63c0c6c822c4' id='type-id-55'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' hash='e3dd2455194bc66c' id='type-id-56'/>
    <qualified-type-def type-id='type-id-47' const='yes' hash='a74535423f2d1afd' id='type-id-57'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' hash='a645f8907fb9457d' id='type-id-58'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-60'/>
    <class-decl name='_IO_jump_t' is-struct='yes' visibility='default' size-in-bits='1344' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/libio/libioP.h' line='295' column='1' hash='a0b50b8a4eecbbda' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__dummy' type-id='type-id-9' visibility='default' filepath='../libio/libioP.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__dummy2' type-id='type-id-9' visibility='default' filepath='../libio/libioP.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__finish' type-id='type-id-62' visibility='default' filepath='../libio/libioP.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__overflow' type-id='type-id-63' visibility='default' filepath='../libio/libioP.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__underflow' type-id='type-id-64' visibility='default' filepath='../libio/libioP.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__uflow' type-id='type-id-64' visibility='default' filepath='../libio/libioP.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='__pbackfail' type-id='type-id-65' visibility='default' filepath='../libio/libioP.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='__xsputn' type-id='type-id-66' visibility='default' filepath='../libio/libioP.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='__xsgetn' type-id='type-id-67' visibility='default' filepath='../libio/libioP.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='__seekoff' type-id='type-id-68' visibility='default' filepath='../libio/libioP.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='__seekpos' type-id='type-id-69' visibility='default' filepath='../libio/libioP.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='__setbuf' type-id='type-id-70' visibility='default' filepath='../libio/libioP.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='__sync' type-id='type-id-71' visibility='default' filepath='../libio/libioP.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='__doallocate' type-id='type-id-72' visibility='default' filepath='../libio/libioP.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='__read' type-id='type-id-73' visibility='default' filepath='../libio/libioP.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__write' type-id='type-id-74' visibility='default' filepath='../libio/libioP.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='__seek' type-id='type-id-75' visibility='default' filepath='../libio/libioP.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='__close' type-id='type-id-76' visibility='default' filepath='../libio/libioP.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='__stat' type-id='type-id-77' visibility='default' filepath='../libio/libioP.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='__showmanyc' type-id='type-id-78' visibility='default' filepath='../libio/libioP.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='__imbue' type-id='type-id-79' visibility='default' filepath='../libio/libioP.h' line='318' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__gconv_loaded_object' is-struct='yes' visibility='default' size-in-bits='384' filepath='./gconv_int.h' line='69' column='1' hash='2dc743ca9c6f2974' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default' filepath='./gconv_int.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='counter' type-id='type-id-5' visibility='default' filepath='./gconv_int.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='handle' type-id='type-id-25' visibility='default' filepath='./gconv_int.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fct' type-id='type-id-53' visibility='default' filepath='./gconv_int.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='init_fct' type-id='type-id-55' visibility='default' filepath='./gconv_int.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='end_fct' type-id='type-id-51' visibility='default' filepath='./gconv_int.h' line='84' column='1'/>
      </data-member>
    </class-decl>
    <var-decl name='_rtld_global_ro' type-id='type-id-81' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='705' column='1' elf-symbol-id='_rtld_global_ro'/>
    <function-decl name='__assert_fail' mangled-name='__assert_fail' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/assert/assert.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__assert_fail@@GLIBC_2.2.5' hash='f20e7a25b596c040'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='5ac3795bb1331787' id='type-id-82'>
      <parameter type-id='type-id-4'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='3c356c441830742f' id='type-id-83'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='c07d8e55611dec50' id='type-id-85'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-86'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-88'/>
      <parameter type-id='type-id-89'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='80d6dbb9e70c13b7' id='type-id-91'>
      <parameter type-id='type-id-84'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-92'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='9438807715195f2a' id='type-id-93'>
      <parameter type-id='type-id-84'/>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-95'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='catgets.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets' language='LANG_C11'>
    <enum-decl name='__anonymous_enum__' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='35' column='1' hash='1da5bea5d7567c24#6' id='type-id-96'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='mmapped' value='0'/>
      <enumerator name='malloced' value='1'/>
    </enum-decl>
    <class-decl name='catalog_info' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='33' column='1' hash='17e46b50bd7570c8' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='type-id-96' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='plane_size' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='plane_depth' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name_ptr' type-id='type-id-99' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='strings' type-id='type-id-1' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='file_ptr' type-id='type-id-100' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='file_size' type-id='type-id-9' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='catalog_obj' is-struct='yes' visibility='default' size-in-bits='96' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='21' column='1' hash='782893c8917dc9f4' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='magic' type-id='type-id-102' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='plane_size' type-id='type-id-102' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='plane_depth' type-id='type-id-102' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='name_ptr' type-id='type-id-103' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='28' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__nl_catd' type-id='type-id-104' size-in-bits='64' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgetsinfo.h' line='44' column='1' hash='0718ae6e7c88ced4' id='type-id-105'/>
    <array-type-def dimensions='1' type-id='type-id-102' size-in-bits='unknown' hash='d71ea9da2a27c259' id='type-id-103'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-107'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' hash='0718ae6e7c88ced4' id='type-id-104'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' hash='7816f64968e56c59' id='type-id-100'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' hash='a285db8f38e4ea02' id='type-id-99'/>
    <typedef-decl name='nl_catd' type-id='type-id-25' filepath='../catgets/nl_types.h' line='33' column='1' id='type-id-108'/>
    <var-decl name='__libc_enable_secure' type-id='type-id-5' visibility='default' filepath='../include/unistd.h' line='204' column='1' elf-symbol-id='__libc_enable_secure'/>
    <function-decl name='catopen' mangled-name='catopen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgets.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='catopen@@GLIBC_2.2.5' hash='7cffa03161e7e042'>
      <parameter type-id='type-id-1' name='cat_name' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgets.c' line='31' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgets.c' line='31' column='1'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='catgets' mangled-name='catgets' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgets.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='catgets@@GLIBC_2.2.5' hash='4c38feeaf886970e'>
      <parameter type-id='type-id-108' name='catalog_desc' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgets.c' line='88' column='1'/>
      <parameter type-id='type-id-5' name='set' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgets.c' line='88' column='1'/>
      <parameter type-id='type-id-5' name='message' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgets.c' line='88' column='1'/>
      <parameter type-id='type-id-1' name='string' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgets.c' line='88' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='catclose' mangled-name='catclose' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgets.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='catclose@@GLIBC_2.2.5' hash='388da3fa973fde78'>
      <parameter type-id='type-id-108' name='catalog_desc' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/catgets.c' line='119' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='open_catalog.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets' language='LANG_C11'>
    <function-decl name='__open_catalog' mangled-name='__GI___open_catalog' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/catgets/open_catalog.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__open_catalog@@GLIBC_PRIVATE' hash='9a33bd24f00fab25'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-105'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-109'>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../sysdeps/generic/unwind-resume.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-110' size-in-bits='128' hash='c529e5b43b168dfb' id='type-id-111'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-112'/>
    </array-type-def>
    <enum-decl name='_Unwind_Reason_Code' naming-typedef-id='type-id-113' size-in-bits='32' alignment-in-bits='32' filepath='../sysdeps/generic/unwind.h' line='48' column='1' hash='bbc6671cb57edbd5' id='type-id-114'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='_URC_NO_REASON' value='0'/>
      <enumerator name='_URC_FOREIGN_EXCEPTION_CAUGHT' value='1'/>
      <enumerator name='_URC_FATAL_PHASE2_ERROR' value='2'/>
      <enumerator name='_URC_FATAL_PHASE1_ERROR' value='3'/>
      <enumerator name='_URC_NORMAL_STOP' value='4'/>
      <enumerator name='_URC_END_OF_STACK' value='5'/>
      <enumerator name='_URC_HANDLER_FOUND' value='6'/>
      <enumerator name='_URC_INSTALL_CONTEXT' value='7'/>
      <enumerator name='_URC_CONTINUE_UNWIND' value='8'/>
    </enum-decl>
    <class-decl name='_Unwind_Exception' is-struct='yes' visibility='default' size-in-bits='256' filepath='../sysdeps/generic/unwind.h' line='72' column='1' hash='646064b476a78a74' id='type-id-115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-116' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='unwind_link' is-struct='yes' visibility='default' size-in-bits='384' filepath='../sysdeps/generic/unwind-link.h' line='41' column='1' hash='fe6d0226810e4dc9' id='type-id-117'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr__Unwind_Backtrace' type-id='type-id-118' visibility='default' filepath='../sysdeps/generic/unwind-link.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ptr__Unwind_ForcedUnwind' type-id='type-id-119' visibility='default' filepath='../sysdeps/generic/unwind-link.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ptr__Unwind_GetCFA' type-id='type-id-120' visibility='default' filepath='../sysdeps/generic/unwind-link.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ptr__Unwind_GetIP' type-id='type-id-121' visibility='default' filepath='../sysdeps/generic/unwind-link.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ptr__Unwind_Resume' type-id='type-id-122' visibility='default' filepath='../sysdeps/generic/unwind-link.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ptr_personality' type-id='type-id-123' visibility='default' filepath='../sysdeps/generic/unwind-link.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='256' is-anonymous='yes' filepath='../sysdeps/generic/unwind.h' line='76' column='1' hash='fd512d004a41aa7f' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exception_class' type-id='type-id-125' visibility='default' filepath='../sysdeps/generic/unwind.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exception_cleanup' type-id='type-id-126' visibility='default' filepath='../sysdeps/generic/unwind.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='private_1' type-id='type-id-110' visibility='default' filepath='../sysdeps/generic/unwind.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='private_2' type-id='type-id-110' visibility='default' filepath='../sysdeps/generic/unwind.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Unwind_Action' type-id='type-id-5' size-in-bits='32' filepath='../sysdeps/generic/unwind.h' line='93' column='1' hash='09d17c08f594edc7' id='type-id-127'/>
    <typedef-decl name='_Unwind_Exception_Class' type-id='type-id-106' size-in-bits='64' filepath='../sysdeps/generic/unwind.h' line='43' column='1' hash='8fdc5eea2983a729' id='type-id-125'/>
    <typedef-decl name='_Unwind_Exception_Cleanup_Fn' type-id='type-id-128' size-in-bits='64' filepath='../sysdeps/generic/unwind.h' line='69' column='1' hash='fd7a63c0c6c822c4' id='type-id-126'/>
    <typedef-decl name='_Unwind_Ptr' type-id='type-id-106' size-in-bits='64' filepath='../sysdeps/generic/unwind.h' line='36' column='1' hash='8fdc5eea2983a729' id='type-id-129'/>
    <typedef-decl name='_Unwind_Reason_Code' type-id='type-id-114' size-in-bits='32' alignment-in-bits='32' filepath='../sysdeps/generic/unwind.h' line='58' column='1' hash='bbc6671cb57edbd5' id='type-id-113'/>
    <typedef-decl name='_Unwind_Stop_Fn' type-id='type-id-130' size-in-bits='64' filepath='../sysdeps/generic/unwind.h' line='112' column='1' hash='fd7a63c0c6c822c4' id='type-id-131'/>
    <typedef-decl name='_Unwind_Trace_Fn' type-id='type-id-132' size-in-bits='64' filepath='../sysdeps/generic/unwind.h' line='130' column='1' hash='fd7a63c0c6c822c4' id='type-id-133'/>
    <typedef-decl name='_Unwind_Word' type-id='type-id-106' size-in-bits='64' filepath='../sysdeps/generic/unwind.h' line='34' column='1' hash='8fdc5eea2983a729' id='type-id-110'/>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='256' is-anonymous='yes' filepath='../sysdeps/generic/unwind.h' line='74' column='1' hash='2e80b0293ec6801d#41' id='type-id-116'>
      <data-member access='public'>
        <var-decl name='' type-id='type-id-124' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='unwind_exception_align' type-id='type-id-111' visibility='default' filepath='../sysdeps/generic/unwind.h' line='85' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-115' size-in-bits='64' hash='e4993ab2705570df' id='type-id-134'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-121'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-132'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-119'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-118'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-123'/>
    <pointer-type-def type-id='type-id-140' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-130'/>
    <pointer-type-def type-id='type-id-141' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-120'/>
    <pointer-type-def type-id='type-id-117' size-in-bits='64' hash='7bcccb5c659458aa' id='type-id-142'/>
    <pointer-type-def type-id='type-id-143' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-122'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-128'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-146'/>
    <class-decl name='_Unwind_Context' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-145'/>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-135'>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-129'/>
    </function-type>
    <function-type size-in-bits='64' hash='39f6fa8960a48704' id='type-id-136'>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-113'/>
    </function-type>
    <function-type size-in-bits='64' hash='44a765cf0a769286' id='type-id-137'>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-113'/>
    </function-type>
    <function-type size-in-bits='64' hash='229028c238f07093' id='type-id-138'>
      <parameter type-id='type-id-133'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-113'/>
    </function-type>
    <function-type size-in-bits='64' hash='3011e8a4f5b0a0c8' id='type-id-139'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-113'/>
    </function-type>
    <function-type size-in-bits='64' hash='3011e8a4f5b0a0c8' id='type-id-140'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-125'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-146'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-113'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-141'>
      <parameter type-id='type-id-146'/>
      <return type-id='type-id-110'/>
    </function-type>
    <function-type size-in-bits='64' hash='1ccb506500620650' id='type-id-143'>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='2455b6a1e8fb9f71' id='type-id-144'>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../sysdeps/x86/libc-start.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-147' size-in-bits='320' hash='e7f9696e246a3049' id='type-id-148'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='type-id-149'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-150' size-in-bits='unknown' hash='4e18d24e18d1fb77' id='type-id-151'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-107'/>
    </array-type-def>
    <enum-decl name='dl_plt_rewrite_control' size-in-bits='32' alignment-in-bits='32' filepath='../sysdeps/x86_64/feature-control.h' line='36' column='1' hash='872b7f8631d9cf14' id='type-id-152'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='plt_rewrite_none' value='0'/>
      <enumerator name='plt_rewrite_jmp' value='1'/>
      <enumerator name='plt_rewrite_jmpabs' value='2'/>
    </enum-decl>
    <enum-decl name='dl_x86_cet_control' size-in-bits='32' alignment-in-bits='32' filepath='../sysdeps/x86_64/feature-control.h' line='23' column='1' hash='359e5219cb3d91c4' id='type-id-153'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='cet_elf_property' value='0'/>
      <enumerator name='cet_always_on' value='1'/>
      <enumerator name='cet_always_off' value='2'/>
      <enumerator name='cet_permissive' value='3'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='type-id-154' size-in-bits='14336' hash='13c337e53b9f4f7b' id='type-id-155'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-156'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-157' size-in-bits='512' hash='8e4c722572470e23' id='type-id-158'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-159'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#4' id='type-id-160'/>
    <class-decl name='__jmp_buf_tag' is-struct='yes' visibility='default' size-in-bits='1600' filepath='../setjmp/bits/types/struct___jmp_buf_tag.h' line='26' column='1' hash='0d7cc580e71a7367' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__jmpbuf' type-id='type-id-162' visibility='default' filepath='../setjmp/bits/types/struct___jmp_buf_tag.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='__mask_was_saved' type-id='type-id-5' visibility='default' filepath='../setjmp/bits/types/struct___jmp_buf_tag.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='__saved_mask' type-id='type-id-163' visibility='default' filepath='../setjmp/bits/types/struct___jmp_buf_tag.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' is-struct='yes' visibility='default' size-in-bits='128' filepath='../sysdeps/nptl/bits/thread-shared-types.h' line='51' column='1' hash='5bcfb7f1ab39fa47' id='type-id-164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-165' visibility='default' filepath='../sysdeps/nptl/bits/thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-165' visibility='default' filepath='../sysdeps/nptl/bits/thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' is-struct='yes' visibility='default' size-in-bits='320' filepath='../sysdeps/x86/nptl/bits/struct_mutex.h' line='22' column='1' hash='765d7e157ef2ec37' id='type-id-166'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-5' visibility='default' filepath='../sysdeps/x86/nptl/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/nptl/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-5' visibility='default' filepath='../sysdeps/x86/nptl/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/nptl/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-5' visibility='default' filepath='../sysdeps/x86/nptl/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-160' visibility='default' filepath='../sysdeps/x86/nptl/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-160' visibility='default' filepath='../sysdeps/x86/nptl/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-167' visibility='default' filepath='../sysdeps/x86/nptl/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__rtld_lock_recursive_t' is-struct='yes' naming-typedef-id='type-id-168' visibility='default' size-in-bits='320' filepath='../sysdeps/nptl/libc-lockP.h' line='39' column='1' hash='ebfe554908cfd4ef' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mutex' type-id='type-id-170' visibility='default' filepath='../sysdeps/nptl/libc-lockP.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__sigset_t' is-struct='yes' naming-typedef-id='type-id-163' visibility='default' size-in-bits='1024' filepath='../sysdeps/unix/sysv/linux/bits/types/__sigset_t.h' line='5' column='1' hash='18950dbdbe728dbc' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-172' visibility='default' filepath='../sysdeps/unix/sysv/linux/bits/types/__sigset_t.h' line='7' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dl_scope_free_list' is-struct='yes' visibility='default' size-in-bits='3264' filepath='../sysdeps/generic/ldsodefs.h' line='462' column='1' hash='d5604c85df7fd007' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list' type-id='type-id-174' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='465' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dl_x86_feature_control' is-struct='yes' visibility='default' size-in-bits='32' filepath='../sysdeps/x86_64/feature-control.h' line='46' column='1' hash='3087700fdde7bc43' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ibt' type-id='type-id-153' visibility='default' filepath='../sysdeps/x86_64/feature-control.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='shstk' type-id='type-id-153' visibility='default' filepath='../sysdeps/x86_64/feature-control.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='plt_rewrite' type-id='type-id-152' visibility='default' filepath='../sysdeps/x86_64/feature-control.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dtv_slotinfo' is-struct='yes' visibility='default' size-in-bits='128' filepath='../sysdeps/generic/ldsodefs.h' line='430' column='1' hash='be3ffd3bf1ed6c39' id='type-id-150'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gen' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='map' type-id='type-id-176' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='433' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dtv_slotinfo_list' is-struct='yes' visibility='default' size-in-bits='128' filepath='../sysdeps/generic/ldsodefs.h' line='426' column='1' hash='2ec5e00f390332c7' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='428' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-178' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='slotinfo' type-id='type-id-151' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='434' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='link_namespaces' is-struct='yes' visibility='default' size-in-bits='896' filepath='../sysdeps/generic/ldsodefs.h' line='333' column='1' hash='06aa177409a70355' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ns_loaded' type-id='type-id-176' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_ns_nloaded' type-id='type-id-24' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_ns_main_searchlist' type-id='type-id-179' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_ns_global_scope_alloc' type-id='type-id-24' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='_ns_global_scope_pending_adds' type-id='type-id-24' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='libc_map' type-id='type-id-176' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_ns_unique_sym_table' type-id='type-id-180' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='370' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='list_head' is-struct='yes' visibility='default' size-in-bits='128' filepath='../include/list_t.h' line='24' column='1' hash='8b1616f7c87b2f30' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-182' visibility='default' filepath='../include/list_t.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prev' type-id='type-id-182' visibility='default' filepath='../include/list_t.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rtld_global' is-struct='yes' visibility='default' size-in-bits='16960' filepath='../sysdeps/generic/ldsodefs.h' line='321' column='1' hash='37eb1c5959c4f79f' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_dl_ns' type-id='type-id-155' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14336'>
        <var-decl name='_dl_nns' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14400'>
        <var-decl name='_dl_load_lock' type-id='type-id-168' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14720'>
        <var-decl name='_dl_load_write_lock' type-id='type-id-168' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15040'>
        <var-decl name='_dl_load_tls_lock' type-id='type-id-168' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15360'>
        <var-decl name='_dl_load_adds' type-id='type-id-184' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15424'>
        <var-decl name='_dl_initfirst' type-id='type-id-176' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15488'>
        <var-decl name='_dl_profile_map' type-id='type-id-176' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15552'>
        <var-decl name='_dl_num_relocations' type-id='type-id-106' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15616'>
        <var-decl name='_dl_num_cache_relocations' type-id='type-id-106' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15680'>
        <var-decl name='_dl_all_dirs' type-id='type-id-185' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15744'>
        <var-decl name='_dl_x86_feature_1' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86_64/dl-procruntime.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15776'>
        <var-decl name='_dl_x86_feature_control' type-id='type-id-175' visibility='default' filepath='../sysdeps/x86_64/dl-procruntime.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15808'>
        <var-decl name='_dl_stack_flags' type-id='type-id-186' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15840'>
        <var-decl name='_dl_tls_dtv_gaps' type-id='type-id-187' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15872'>
        <var-decl name='_dl_tls_max_dtv_idx' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15936'>
        <var-decl name='_dl_tls_dtv_slotinfo_list' type-id='type-id-178' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16000'>
        <var-decl name='_dl_tls_static_nelem' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16064'>
        <var-decl name='_dl_tls_static_used' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16128'>
        <var-decl name='_dl_tls_static_optional' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16192'>
        <var-decl name='_dl_initial_dtv' type-id='type-id-25' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16256'>
        <var-decl name='_dl_tls_generation' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16320'>
        <var-decl name='_dl_scope_free_list' type-id='type-id-188' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='_dl_stack_used' type-id='type-id-189' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16512'>
        <var-decl name='_dl_stack_user' type-id='type-id-189' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16640'>
        <var-decl name='_dl_stack_cache' type-id='type-id-189' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16768'>
        <var-decl name='_dl_stack_cache_actsize' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16832'>
        <var-decl name='_dl_in_flight_stack' type-id='type-id-190' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16896'>
        <var-decl name='_dl_stack_cache_lock' type-id='type-id-5' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='486' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='unique_sym' is-struct='yes' visibility='default' size-in-bits='256' filepath='../sysdeps/generic/ldsodefs.h' line='360' column='1' hash='19d5aa8ed6ca6c41' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hashval' type-id='type-id-102' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sym' type-id='type-id-192' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='map' type-id='type-id-193' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='365' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='unique_sym_table' is-struct='yes' visibility='default' size-in-bits='576' filepath='../sysdeps/generic/ldsodefs.h' line='357' column='1' hash='4f61999aaaa04ec1' id='type-id-180'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='type-id-168' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='entries' type-id='type-id-194' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='size' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='n_elements' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='free' type-id='type-id-195' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='369' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__jmp_buf' type-id='type-id-158' size-in-bits='512' filepath='../sysdeps/x86/bits/setjmp.h' line='31' column='1' hash='8e4c722572470e23' id='type-id-162'/>
    <typedef-decl name='__pthread_list_t' type-id='type-id-164' size-in-bits='128' filepath='../sysdeps/nptl/bits/thread-shared-types.h' line='55' column='1' id='type-id-167'/>
    <typedef-decl name='__rtld_lock_recursive_t' type-id='type-id-169' size-in-bits='320' filepath='../sysdeps/nptl/libc-lockP.h' line='39' column='1' id='type-id-168'/>
    <typedef-decl name='__sigset_t' type-id='type-id-171' size-in-bits='1024' filepath='../sysdeps/unix/sysv/linux/bits/types/__sigset_t.h' line='8' column='1' id='type-id-163'/>
    <typedef-decl name='list_t' type-id='type-id-181' size-in-bits='128' filepath='../include/list_t.h' line='28' column='1' id='type-id-189'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-196' size-in-bits='320' filepath='../sysdeps/nptl/bits/pthreadtypes.h' line='72' column='1' id='type-id-170'/>
    <union-decl name='pthread_mutex_t' naming-typedef-id='type-id-170' visibility='default' size-in-bits='320' filepath='../sysdeps/nptl/bits/pthreadtypes.h' line='67' column='1' hash='8e3e5ddbcaed875f' id='type-id-196'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-166' visibility='default' filepath='../sysdeps/nptl/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-148' visibility='default' filepath='../sysdeps/nptl/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-157' visibility='default' filepath='../sysdeps/nptl/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <array-type-def dimensions='1' type-id='type-id-106' size-in-bits='1024' hash='ed1e12a813ec6094' id='type-id-172'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-156'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-25' hash='3ea7a4ef2e50ede5' id='type-id-174'>
      <subrange length='50' lower-bound='0' upper-bound='49' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='5e09f3767fc90e0b' id='type-id-197'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' hash='1a46972fee97b4f6' id='type-id-198'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' hash='b83eb2deac70d470' id='type-id-165'/>
    <qualified-type-def type-id='type-id-199' const='yes' hash='1e736957cbbbb120' id='type-id-200'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' hash='46d225cacc071a78' id='type-id-193'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' hash='7c62bab353563288' id='type-id-188'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' hash='76692c7ff3f96596' id='type-id-178'/>
    <pointer-type-def type-id='type-id-201' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-202'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' hash='4384be68da5e788b' id='type-id-182'/>
    <pointer-type-def type-id='type-id-191' size-in-bits='64' hash='d06c077727368626' id='type-id-194'/>
    <function-decl name='__libc_start_main_impl' mangled-name='__libc_start_main' filepath='../csu/libc-start.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__libc_start_main@@GLIBC_2.34' hash='53f58e0bf02b201b'>
      <parameter type-id='type-id-202' name='main' filepath='../csu/libc-start.c' line='234' column='1'/>
      <parameter type-id='type-id-5' name='argc' filepath='../csu/libc-start.c' line='235' column='1'/>
      <parameter type-id='type-id-23' name='argv' filepath='../csu/libc-start.c' line='235' column='1'/>
      <parameter type-id='type-id-202' name='init' filepath='../csu/libc-start.c' line='239' column='1'/>
      <parameter type-id='type-id-203' name='fini' filepath='../csu/libc-start.c' line='240' column='1'/>
      <parameter type-id='type-id-203' name='rtld_fini' filepath='../csu/libc-start.c' line='241' column='1'/>
      <parameter type-id='type-id-25' name='stack_end' filepath='../csu/libc-start.c' line='241' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <var-decl name='_rtld_global' type-id='type-id-183' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='511' column='1' elf-symbol-id='_rtld_global'/>
    <function-decl name='_dl_audit_preinit' filepath='../sysdeps/generic/ldsodefs.h' line='1427' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_dl_audit_preinit' hash='b2af78908ae2fcee'>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='094b8789feb300b0' id='type-id-201'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-5'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='check_fds.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-204' size-in-bits='192' hash='9904ddbe9e0e1da6' id='type-id-205'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='type-id-206'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-147'/>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-5'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-157'/>
    <class-decl name='stat64' is-struct='yes' visibility='default' size-in-bits='1152' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='103' column='1' hash='e5a68f8cd66462d4' id='type-id-207'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-208' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-209' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-210' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-211' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-212' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-213' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-5' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-208' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-214' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-215' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-216' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-217' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-217' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-217' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-205' visibility='default' filepath='../sysdeps/unix/sysv/linux/x86/bits/struct_stat.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' filepath='../time/bits/types/struct_timespec.h' line='11' column='1' hash='7451f9a3207df4f1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-218' visibility='default' filepath='../time/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-204' visibility='default' filepath='../time/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__blkcnt64_t' type-id='type-id-157' size-in-bits='64' filepath='../posix/bits/types.h' line='181' column='1' hash='b119fe0931d2ee10' id='type-id-216'/>
    <typedef-decl name='__blksize_t' type-id='type-id-157' size-in-bits='64' filepath='../posix/bits/types.h' line='175' column='1' hash='b119fe0931d2ee10' id='type-id-215'/>
    <typedef-decl name='__dev_t' type-id='type-id-106' size-in-bits='64' filepath='../posix/bits/types.h' line='145' column='1' hash='8fdc5eea2983a729' id='type-id-208'/>
    <typedef-decl name='__gid_t' type-id='type-id-24' size-in-bits='32' filepath='../posix/bits/types.h' line='147' column='1' hash='e66b43f97c38e87a' id='type-id-213'/>
    <typedef-decl name='__ino64_t' type-id='type-id-106' size-in-bits='64' filepath='../posix/bits/types.h' line='149' column='1' hash='8fdc5eea2983a729' id='type-id-209'/>
    <typedef-decl name='__mode_t' type-id='type-id-24' size-in-bits='32' filepath='../posix/bits/types.h' line='150' column='1' hash='e66b43f97c38e87a' id='type-id-211'/>
    <typedef-decl name='__nlink_t' type-id='type-id-106' size-in-bits='64' filepath='../posix/bits/types.h' line='151' column='1' hash='8fdc5eea2983a729' id='type-id-210'/>
    <typedef-decl name='__off_t' type-id='type-id-157' size-in-bits='64' filepath='../posix/bits/types.h' line='152' column='1' hash='b119fe0931d2ee10' id='type-id-214'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-157' size-in-bits='64' filepath='../posix/bits/types.h' line='197' column='1' hash='b119fe0931d2ee10' id='type-id-204'/>
    <typedef-decl name='__time_t' type-id='type-id-157' size-in-bits='64' filepath='../posix/bits/types.h' line='160' column='1' hash='b119fe0931d2ee10' id='type-id-218'/>
    <typedef-decl name='__uid_t' type-id='type-id-24' size-in-bits='32' filepath='../posix/bits/types.h' line='146' column='1' hash='e66b43f97c38e87a' id='type-id-212'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-24'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-106'/>
    <qualified-type-def type-id='type-id-147' const='yes' hash='3e50fd33f9bb78d9' id='type-id-219'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' hash='c44743f354f6a443' id='type-id-1'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' hash='06f1603a0ba87e2d' id='type-id-220'/>
    <type-decl name='variadic parameter type' id='type-id-221'/>
  </abi-instr>
  <abi-instr address-size='64' path='errno-loc.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu' language='LANG_C11'>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='type-id-41'/>
    <function-decl name='__errno_location' mangled-name='__GI___errno_location' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu/errno-loc.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location@@GLIBC_2.2.5' hash='c0e4f5f42afc96e0'>
      <return type-id='type-id-41'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='errno.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu' language='LANG_C11'>
    <var-decl name='errno' type-id='type-id-5' mangled-name='errno' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu/errno.c' line='31' column='1' elf-symbol-id='errno@@GLIBC_PRIVATE'/>
  </abi-instr>
  <abi-instr address-size='64' path='init-first.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-222' size-in-bits='5376' hash='6e66f637ebfc3d1c' id='type-id-223'>
      <subrange length='84' lower-bound='0' upper-bound='83' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='626489adc97c0c46' id='type-id-224'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-225' size-in-bits='4096' hash='aed5cb25e94a259e' id='type-id-226'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-159'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-227' size-in-bits='512' hash='8d601374b3fd05e2' id='type-id-228'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-229'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-227' size-in-bits='1024' hash='ca631e06d574c552' id='type-id-230'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-159'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-231' size-in-bits='512' hash='bd87731865f7cbc6' id='type-id-232'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-112'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-233' size-in-bits='512' hash='d2f8058b434393f8' id='type-id-234'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-235'/>
    </array-type-def>
    <type-decl name='__int128' size-in-bits='128' hash='8782fa5e5b495ba5' id='type-id-236'/>
    <array-type-def dimensions='1' type-id='type-id-236' size-in-bits='512' hash='d77da4a0557b1573' id='type-id-237'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-229'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='type-id-187'/>
    <array-type-def dimensions='1' type-id='type-id-238' size-in-bits='2560' hash='9ec57570d7a96531' id='type-id-239'>
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='4e72a2f569b234f4' id='type-id-240'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-241'/>
    <array-type-def dimensions='1' type-id='type-id-241' size-in-bits='512' hash='f8859bc464d8cd16' id='type-id-242'>
      <subrange length='8' lower-bound='0' upper-bound='7' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-159'/>
    </array-type-def>
    <enum-decl name='cpu_features_kind' size-in-bits='32' alignment-in-bits='32' filepath='../sysdeps/x86/include/cpu-features.h' line='878' column='1' hash='67bcfd8ea31eb91e' id='type-id-243'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='arch_kind_unknown' value='0'/>
      <enumerator name='arch_kind_intel' value='1'/>
      <enumerator name='arch_kind_amd' value='2'/>
      <enumerator name='arch_kind_zhaoxin' value='3'/>
      <enumerator name='arch_kind_hygon' value='4'/>
      <enumerator name='arch_kind_other' value='5'/>
    </enum-decl>
    <enum-decl name='dl_readonly_area_error_type' size-in-bits='32' alignment-in-bits='32' filepath='../sysdeps/generic/ldsodefs.h' line='279' column='1' hash='23fcdf411f974d3c' id='type-id-244'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='dl_readonly_area_rdonly' value='0'/>
      <enumerator name='dl_readonly_area_writable' value='1'/>
      <enumerator name='dl_readonly_area_not_found' value='2'/>
    </enum-decl>
    <enum-decl name='dso_sort_algorithm' size-in-bits='32' alignment-in-bits='32' filepath='../sysdeps/generic/ldsodefs.h' line='243' column='1' hash='293c32673766eaea' id='type-id-245'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='dso_sort_algorithm_original' value='0'/>
      <enumerator name='dso_sort_algorithm_dfs' value='1'/>
    </enum-decl>
    <enum-decl name='r_dir_status' size-in-bits='32' alignment-in-bits='32' filepath='../sysdeps/generic/ldsodefs.h' line='206' column='1' hash='272a8400a43e756f' id='type-id-246'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='unknown' value='0'/>
      <enumerator name='nonexisting' value='1'/>
      <enumerator name='existing' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__1' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' filepath='../sysdeps/x86/link_map.h' line='21' column='1' hash='18ccac7a826e1908#3' id='type-id-247'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='lc_property_unknown' value='0'/>
      <enumerator name='lc_property_none' value='1'/>
      <enumerator name='lc_property_valid' value='2'/>
    </enum-decl>
    <enum-decl name='__anonymous_enum__' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' filepath='../include/link.h' line='175' column='1' hash='1d1c94f4884aaea8#5' id='type-id-248'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='lt_executable' value='0'/>
      <enumerator name='lt_library' value='1'/>
      <enumerator name='lt_loaded' value='2'/>
    </enum-decl>
    <type-decl name='float' size-in-bits='32' hash='d7ec3bf03d3c5690' id='type-id-249'/>
    <array-type-def dimensions='1' type-id='type-id-249' size-in-bits='128' hash='b3db84c58df322c1' id='type-id-250'>
      <subrange length='4' lower-bound='0' upper-bound='3' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-229'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-249' size-in-bits='256' hash='c442e5c69f7df4a9' id='type-id-251'>
      <subrange length='8' lower-bound='0' upper-bound='7' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-159'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-176' size-in-bits='unknown' hash='9d69a3b9b9df57d8' id='type-id-252'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-107'/>
    </array-type-def>
    <type-decl name='long double' size-in-bits='128' hash='2a9bbfe8bb0475f1#2' id='type-id-253'/>
    <array-type-def dimensions='1' type-id='type-id-246' size-in-bits='unknown' alignment-in-bits='32' hash='5eb1e5a44781b682' id='type-id-254'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-107'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-179' size-in-bits='128' hash='3bc8e6b6eab180e7' id='type-id-255'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-112'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-179' size-in-bits='256' hash='0742cd2a82dee26a' id='type-id-256'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-229'/>
    </array-type-def>
    <class-decl name='Dl_info' is-struct='yes' naming-typedef-id='type-id-257' visibility='default' size-in-bits='256' filepath='../dlfcn/dlfcn.h' line='88' column='1' hash='445ead05329a9415' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dli_fname' type-id='type-id-1' visibility='default' filepath='../dlfcn/dlfcn.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dli_fbase' type-id='type-id-25' visibility='default' filepath='../dlfcn/dlfcn.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dli_sname' type-id='type-id-1' visibility='default' filepath='../dlfcn/dlfcn.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dli_saddr' type-id='type-id-25' visibility='default' filepath='../dlfcn/dlfcn.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf32_Sym' is-struct='yes' naming-typedef-id='type-id-259' visibility='default' size-in-bits='128' filepath='../elf/elf.h' line='520' column='1' hash='f24563f7359f98e8' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_name' type-id='type-id-261' visibility='default' filepath='../elf/elf.h' line='522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='st_value' type-id='type-id-262' visibility='default' filepath='../elf/elf.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_size' type-id='type-id-261' visibility='default' filepath='../elf/elf.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='st_info' type-id='type-id-94' visibility='default' filepath='../elf/elf.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='st_other' type-id='type-id-94' visibility='default' filepath='../elf/elf.h' line='526' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='st_shndx' type-id='type-id-263' visibility='default' filepath='../elf/elf.h' line='527' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Dyn' is-struct='yes' naming-typedef-id='type-id-264' visibility='default' size-in-bits='128' filepath='../elf/elf.h' line='878' column='1' hash='fe10d98cdb17c2d2' id='type-id-265'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='d_tag' type-id='type-id-266' visibility='default' filepath='../elf/elf.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='d_un' type-id='type-id-267' visibility='default' filepath='../elf/elf.h' line='885' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Ehdr' is-struct='yes' naming-typedef-id='type-id-268' visibility='default' size-in-bits='512' filepath='../elf/elf.h' line='81' column='1' hash='b8444b3606110e44' id='type-id-269'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='e_ident' type-id='type-id-270' visibility='default' filepath='../elf/elf.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='e_type' type-id='type-id-271' visibility='default' filepath='../elf/elf.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='e_machine' type-id='type-id-271' visibility='default' filepath='../elf/elf.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='e_version' type-id='type-id-186' visibility='default' filepath='../elf/elf.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='e_entry' type-id='type-id-272' visibility='default' filepath='../elf/elf.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='e_phoff' type-id='type-id-273' visibility='default' filepath='../elf/elf.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='e_shoff' type-id='type-id-273' visibility='default' filepath='../elf/elf.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='e_flags' type-id='type-id-186' visibility='default' filepath='../elf/elf.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='e_ehsize' type-id='type-id-271' visibility='default' filepath='../elf/elf.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='e_phentsize' type-id='type-id-271' visibility='default' filepath='../elf/elf.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='e_phnum' type-id='type-id-271' visibility='default' filepath='../elf/elf.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='e_shentsize' type-id='type-id-271' visibility='default' filepath='../elf/elf.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='e_shnum' type-id='type-id-271' visibility='default' filepath='../elf/elf.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <var-decl name='e_shstrndx' type-id='type-id-271' visibility='default' filepath='../elf/elf.h' line='96' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Phdr' is-struct='yes' naming-typedef-id='type-id-274' visibility='default' size-in-bits='448' filepath='../elf/elf.h' line='697' column='1' hash='4b4898b4e81729f5' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p_type' type-id='type-id-186' visibility='default' filepath='../elf/elf.h' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='p_flags' type-id='type-id-186' visibility='default' filepath='../elf/elf.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='p_offset' type-id='type-id-273' visibility='default' filepath='../elf/elf.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='p_vaddr' type-id='type-id-272' visibility='default' filepath='../elf/elf.h' line='702' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='p_paddr' type-id='type-id-272' visibility='default' filepath='../elf/elf.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='p_filesz' type-id='type-id-276' visibility='default' filepath='../elf/elf.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='p_memsz' type-id='type-id-276' visibility='default' filepath='../elf/elf.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='p_align' type-id='type-id-276' visibility='default' filepath='../elf/elf.h' line='706' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_Sym' is-struct='yes' naming-typedef-id='type-id-277' visibility='default' size-in-bits='192' filepath='../elf/elf.h' line='530' column='1' hash='59d1917446b00c8f' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_name' type-id='type-id-186' visibility='default' filepath='../elf/elf.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='st_info' type-id='type-id-94' visibility='default' filepath='../elf/elf.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='st_other' type-id='type-id-94' visibility='default' filepath='../elf/elf.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='st_shndx' type-id='type-id-279' visibility='default' filepath='../elf/elf.h' line='535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_value' type-id='type-id-272' visibility='default' filepath='../elf/elf.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_size' type-id='type-id-276' visibility='default' filepath='../elf/elf.h' line='537' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='Elf64_auxv_t' is-struct='yes' naming-typedef-id='type-id-280' visibility='default' size-in-bits='128' filepath='../elf/elf.h' line='1185' column='1' hash='af1df157b29430cf' id='type-id-281'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a_type' type-id='type-id-282' visibility='default' filepath='../elf/elf.h' line='1187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='a_un' type-id='type-id-283' visibility='default' filepath='../elf/elf.h' line='1194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='La_x86_64_regs' is-struct='yes' visibility='default' size-in-bits='6144' filepath='../sysdeps/x86/bits/link.h' line='86' column='1' hash='8623be207d7794bd' id='type-id-284'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lr_rdx' type-id='type-id-282' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lr_r8' type-id='type-id-282' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lr_r9' type-id='type-id-282' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lr_rcx' type-id='type-id-282' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lr_rsi' type-id='type-id-282' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lr_rdi' type-id='type-id-282' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lr_rbp' type-id='type-id-282' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lr_rsp' type-id='type-id-282' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='lr_xmm' type-id='type-id-230' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='lr_vector' type-id='type-id-226' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='__glibc_unused1' type-id='type-id-237' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='La_x86_64_retval' is-struct='yes' visibility='default' size-in-bits='1920' filepath='../sysdeps/x86/bits/link.h' line='104' column='1' hash='6edf7e6c146b37ba' id='type-id-285'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lrv_rax' type-id='type-id-282' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lrv_rdx' type-id='type-id-282' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lrv_xmm0' type-id='type-id-227' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lrv_xmm1' type-id='type-id-227' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lrv_st0' type-id='type-id-253' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='lrv_st1' type-id='type-id-253' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='lrv_vector0' type-id='type-id-225' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='lrv_vector1' type-id='type-id-225' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='__glibc_unused1' type-id='type-id-236' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='__glibc_unused2' type-id='type-id-236' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='audit_ifaces' is-struct='yes' visibility='default' size-in-bits='576' filepath='../sysdeps/generic/ldsodefs.h' line='249' column='1' hash='1f5fe5ae62bd18ec' id='type-id-286'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='activity' type-id='type-id-287' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='objsearch' type-id='type-id-288' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='objopen' type-id='type-id-289' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='preinit' type-id='type-id-290' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='type-id-291' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='type-id-292' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='type-id-293' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='objclose' type-id='type-id-294' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='next' type-id='type-id-295' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='276' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpu_features' is-struct='yes' visibility='default' size-in-bits='4224' filepath='../sysdeps/x86/include/cpu-features.h' line='921' column='1' hash='8ef2f9b3de6b3955' id='type-id-296'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='basic' type-id='type-id-297' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='923' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='features' type-id='type-id-239' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='924' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='preferred' type-id='type-id-298' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='925' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='isa_1' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='927' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='xsave_state_size' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='xsave_state_full_size' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='939' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='data_cache_size' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='shared_cache_size' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='non_temporal_threshold' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='memset_non_temporal_threshold' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='949' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='rep_movsb_threshold' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='951' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='rep_movsb_stop_threshold' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='953' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='rep_stosb_threshold' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='955' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='level1_icache_size' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='957' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='level1_icache_linesize' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='959' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='level1_dcache_size' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='961' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='level1_dcache_assoc' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='963' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='level1_dcache_linesize' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='965' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='level2_cache_size' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='967' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='level2_cache_assoc' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='969' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3840'>
        <var-decl name='level2_cache_linesize' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='971' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3904'>
        <var-decl name='level3_cache_size' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='973' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='level3_cache_assoc' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='975' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='level3_cache_linesize' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='level4_cache_size' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='979' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='cachesize_non_temporal_divisor' type-id='type-id-106' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='982' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpu_features_basic' is-struct='yes' visibility='default' size-in-bits='160' filepath='../sysdeps/x86/include/cpu-features.h' line='888' column='1' hash='67ea2c2d894b44de' id='type-id-297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kind' type-id='type-id-243' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='890' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_cpuid' type-id='type-id-5' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='family' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='892' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='model' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='893' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stepping' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='894' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='cpuid_feature_internal' is-struct='yes' visibility='default' size-in-bits='256' filepath='../sysdeps/x86/include/cpu-features.h' line='905' column='1' hash='53fd10e3872d3f43' id='type-id-238'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='type-id-299' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='type-id-300' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='cpuid_registers' is-struct='yes' visibility='default' size-in-bits='128' filepath='../sysdeps/x86/include/cpu-features.h' line='897' column='1' hash='9d31f35e4ce34262' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eax' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='899' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ebx' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='900' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ecx' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='901' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='edx' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='902' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dl_find_object' is-struct='yes' visibility='default' size-in-bits='768' filepath='../dlfcn/dlfcn.h' line='203' column='1' hash='b0a29330016c3609' id='type-id-302'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dlfo_flags' type-id='type-id-184' visibility='default' filepath='../dlfcn/dlfcn.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dlfo_map_start' type-id='type-id-25' visibility='default' filepath='../dlfcn/dlfcn.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dlfo_map_end' type-id='type-id-25' visibility='default' filepath='../dlfcn/dlfcn.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dlfo_link_map' type-id='type-id-176' visibility='default' filepath='../dlfcn/dlfcn.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dlfo_eh_frame' type-id='type-id-25' visibility='default' filepath='../dlfcn/dlfcn.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dlfo_sframe' type-id='type-id-25' visibility='default' filepath='../dlfcn/dlfcn.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='__dlfo_reserved' type-id='type-id-303' visibility='default' filepath='../dlfcn/dlfcn.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dlfcn_hook' is-struct='yes' visibility='default' size-in-bits='832' filepath='../include/dlfcn.h' line='99' column='1' hash='6b0ef78862147ce3' id='type-id-304'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dlopen' type-id='type-id-305' visibility='default' filepath='../include/dlfcn.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dlclose' type-id='type-id-306' visibility='default' filepath='../include/dlfcn.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dlsym' type-id='type-id-307' visibility='default' filepath='../include/dlfcn.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dlvsym' type-id='type-id-308' visibility='default' filepath='../include/dlfcn.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dlerror' type-id='type-id-309' visibility='default' filepath='../include/dlfcn.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dladdr' type-id='type-id-310' visibility='default' filepath='../include/dlfcn.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dladdr1' type-id='type-id-311' visibility='default' filepath='../include/dlfcn.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dlinfo' type-id='type-id-312' visibility='default' filepath='../include/dlfcn.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dlmopen' type-id='type-id-313' visibility='default' filepath='../include/dlfcn.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='libc_dlopen_mode' type-id='type-id-314' visibility='default' filepath='../include/dlfcn.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='libc_dlsym' type-id='type-id-315' visibility='default' filepath='../include/dlfcn.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='libc_dlvsym' type-id='type-id-316' visibility='default' filepath='../include/dlfcn.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='libc_dlclose' type-id='type-id-306' visibility='default' filepath='../include/dlfcn.h' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='libname_list' is-struct='yes' visibility='default' size-in-bits='192' filepath='../sysdeps/generic/ldsodefs.h' line='233' column='1' hash='61ca6fc16e5ccd78' id='type-id-317'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-318' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dont_free' type-id='type-id-5' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='237' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='link_map' is-struct='yes' visibility='default' size-in-bits='9664' filepath='../include/link.h' line='95' column='1' hash='a79003db03886318' id='type-id-199'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='l_addr' type-id='type-id-272' visibility='default' filepath='../include/link.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='l_name' type-id='type-id-11' visibility='default' filepath='../include/link.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='l_ld' type-id='type-id-222' visibility='default' filepath='../include/link.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='l_next' type-id='type-id-176' visibility='default' filepath='../include/link.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='l_prev' type-id='type-id-176' visibility='default' filepath='../include/link.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='l_real' type-id='type-id-176' visibility='default' filepath='../include/link.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='l_ns' type-id='type-id-319' visibility='default' filepath='../include/link.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='l_libname' type-id='type-id-318' visibility='default' filepath='../include/link.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='l_info' type-id='type-id-223' visibility='default' filepath='../include/link.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='l_phdr' type-id='type-id-320' visibility='default' filepath='../include/link.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='l_entry' type-id='type-id-272' visibility='default' filepath='../include/link.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='l_phnum' type-id='type-id-271' visibility='default' filepath='../include/link.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6032'>
        <var-decl name='l_ldnum' type-id='type-id-271' visibility='default' filepath='../include/link.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='l_searchlist' type-id='type-id-321' visibility='default' filepath='../include/link.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='l_symbolic_searchlist' type-id='type-id-321' visibility='default' filepath='../include/link.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='l_loader' type-id='type-id-176' visibility='default' filepath='../include/link.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='l_versions' type-id='type-id-322' visibility='default' filepath='../include/link.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='l_nversions' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6496'>
        <var-decl name='l_nbuckets' type-id='type-id-323' visibility='default' filepath='../include/link.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='l_gnu_bitmask_idxbits' type-id='type-id-261' visibility='default' filepath='../include/link.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6560'>
        <var-decl name='l_gnu_shift' type-id='type-id-261' visibility='default' filepath='../include/link.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='l_gnu_bitmask' type-id='type-id-324' visibility='default' filepath='../include/link.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='' type-id='type-id-325' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='' type-id='type-id-326' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='l_direct_opencount' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='l_type' type-id='type-id-248' visibility='default' filepath='../include/link.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6818'>
        <var-decl name='l_dt_relr_ref' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6819'>
        <var-decl name='l_relocated' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6820'>
        <var-decl name='l_init_called' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6821'>
        <var-decl name='l_global' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6822'>
        <var-decl name='l_reserved' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6824'>
        <var-decl name='l_main_map' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6825'>
        <var-decl name='l_visited' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6826'>
        <var-decl name='l_map_used' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6827'>
        <var-decl name='l_map_done' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6828'>
        <var-decl name='l_phdr_allocated' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6829'>
        <var-decl name='l_soname_added' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6830'>
        <var-decl name='l_faked' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6831'>
        <var-decl name='l_need_tls_init' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6832'>
        <var-decl name='l_auditing' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6833'>
        <var-decl name='l_audit_any_plt' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6834'>
        <var-decl name='l_removed' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6835'>
        <var-decl name='l_contiguous' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6836'>
        <var-decl name='l_free_initfini' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6837'>
        <var-decl name='l_ld_readonly' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6838'>
        <var-decl name='l_find_object_processed' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6839'>
        <var-decl name='l_tls_in_slotinfo' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6840'>
        <var-decl name='l_nodelete_active' type-id='type-id-187' visibility='default' filepath='../include/link.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='l_nodelete_pending' type-id='type-id-187' visibility='default' filepath='../include/link.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6856'>
        <var-decl name='l_has_jump_slot_reloc' type-id='type-id-187' visibility='default' filepath='../sysdeps/x86_64/link_map.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6864'>
        <var-decl name='l_property' type-id='type-id-247' visibility='default' filepath='../sysdeps/x86/link_map.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6880'>
        <var-decl name='l_x86_feature_1_and' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/link_map.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='l_x86_isa_1_needed' type-id='type-id-24' visibility='default' filepath='../sysdeps/x86/link_map.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6944'>
        <var-decl name='l_1_needed' type-id='type-id-24' visibility='default' filepath='../sysdeps/generic/link_map.h' line='2' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='l_rpath_dirs' type-id='type-id-327' visibility='default' filepath='../include/link.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='l_reloc_result' type-id='type-id-328' visibility='default' filepath='../include/link.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='l_versyms' type-id='type-id-329' visibility='default' filepath='../include/link.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='l_origin' type-id='type-id-1' visibility='default' filepath='../include/link.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='l_map_start' type-id='type-id-272' visibility='default' filepath='../include/link.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='l_map_end' type-id='type-id-272' visibility='default' filepath='../include/link.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7424'>
        <var-decl name='l_scope_mem' type-id='type-id-256' visibility='default' filepath='../include/link.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7680'>
        <var-decl name='l_scope_max' type-id='type-id-9' visibility='default' filepath='../include/link.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7744'>
        <var-decl name='l_scope' type-id='type-id-330' visibility='default' filepath='../include/link.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7808'>
        <var-decl name='l_local_scope' type-id='type-id-255' visibility='default' filepath='../include/link.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='l_file_id' type-id='type-id-331' visibility='default' filepath='../include/link.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8064'>
        <var-decl name='l_runpath_dirs' type-id='type-id-327' visibility='default' filepath='../include/link.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='l_initfini' type-id='type-id-332' visibility='default' filepath='../include/link.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='l_reldeps' type-id='type-id-333' visibility='default' filepath='../include/link.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='l_reldepsmax' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8352'>
        <var-decl name='l_used' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='l_feature_1' type-id='type-id-186' visibility='default' filepath='../include/link.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8416'>
        <var-decl name='l_flags_1' type-id='type-id-186' visibility='default' filepath='../include/link.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='l_flags' type-id='type-id-186' visibility='default' filepath='../include/link.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8480'>
        <var-decl name='l_idx' type-id='type-id-5' visibility='default' filepath='../include/link.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='l_mach' type-id='type-id-334' visibility='default' filepath='../include/link.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='l_lookup_cache' type-id='type-id-335' visibility='default' filepath='../include/link.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8960'>
        <var-decl name='l_tls_initimage' type-id='type-id-25' visibility='default' filepath='../include/link.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9024'>
        <var-decl name='l_tls_initimage_size' type-id='type-id-9' visibility='default' filepath='../include/link.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='l_tls_blocksize' type-id='type-id-9' visibility='default' filepath='../include/link.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9152'>
        <var-decl name='l_tls_align' type-id='type-id-9' visibility='default' filepath='../include/link.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9216'>
        <var-decl name='l_tls_firstbyte_offset' type-id='type-id-9' visibility='default' filepath='../include/link.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9280'>
        <var-decl name='l_tls_offset' type-id='type-id-336' visibility='default' filepath='../include/link.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='l_tls_modid' type-id='type-id-9' visibility='default' filepath='../include/link.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='l_tls_dtor_count' type-id='type-id-9' visibility='default' filepath='../include/link.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9472'>
        <var-decl name='l_relro_addr' type-id='type-id-272' visibility='default' filepath='../include/link.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9536'>
        <var-decl name='l_relro_size' type-id='type-id-9' visibility='default' filepath='../include/link.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9600'>
        <var-decl name='l_serial' type-id='type-id-184' visibility='default' filepath='../include/link.h' line='348' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='link_map_machine' is-struct='yes' visibility='default' size-in-bits='192' filepath='../sysdeps/x86/linkmap.h' line='2' column='1' hash='ea95d7b855a93ad5' id='type-id-334'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='plt' type-id='type-id-272' visibility='default' filepath='../sysdeps/x86/linkmap.h' line='4' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gotplt' type-id='type-id-272' visibility='default' filepath='../sysdeps/x86/linkmap.h' line='5' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tlsdesc_table' type-id='type-id-25' visibility='default' filepath='../sysdeps/x86/linkmap.h' line='6' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='link_map_reldeps' is-struct='yes' visibility='default' size-in-bits='64' filepath='../include/link.h' line='281' column='1' hash='65f57e00e5f981dd' id='type-id-337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='act' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='list' type-id='type-id-252' visibility='default' filepath='../include/link.h' line='284' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='r_file_id' is-struct='yes' visibility='default' size-in-bits='128' filepath='../sysdeps/posix/dl-fileid.h' line='24' column='1' hash='816f08835489104c' id='type-id-331'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev' type-id='type-id-338' visibility='default' filepath='../sysdeps/posix/dl-fileid.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ino' type-id='type-id-339' visibility='default' filepath='../sysdeps/posix/dl-fileid.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='r_found_version' is-struct='yes' visibility='default' size-in-bits='192' filepath='../sysdeps/generic/ldsodefs.h' line='195' column='1' hash='9820e5ea4b366dd6' id='type-id-340'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hash' type-id='type-id-186' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='hidden' type-id='type-id-5' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='filename' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='201' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='r_scope_elem' is-struct='yes' visibility='default' size-in-bits='128' filepath='../include/link.h' line='66' column='1' hash='723fad801dbf224c' id='type-id-321'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='r_list' type-id='type-id-332' visibility='default' filepath='../include/link.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='r_nlist' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='r_search_path_elem' is-struct='yes' visibility='default' size-in-bits='320' filepath='../sysdeps/generic/ldsodefs.h' line='208' column='1' hash='fabf0f6453ac367c' id='type-id-341'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-185' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='what' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='where' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dirname' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dirnamelen' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='status' type-id='type-id-254' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='222' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='r_search_path_struct' is-struct='yes' visibility='default' size-in-bits='128' filepath='../include/link.h' line='76' column='1' hash='d0ede8a118aa0b15' id='type-id-327'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dirs' type-id='type-id-342' visibility='default' filepath='../include/link.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='malloced' type-id='type-id-5' visibility='default' filepath='../include/link.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='reloc_result' is-struct='yes' visibility='default' size-in-bits='256' filepath='../include/link.h' line='235' column='1' hash='f50f6f8c39bf2e07' id='type-id-343'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='type-id-272' visibility='default' filepath='../include/link.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bound' type-id='type-id-176' visibility='default' filepath='../include/link.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='boundndx' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='enterexit' type-id='type-id-102' visibility='default' filepath='../include/link.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='init' type-id='type-id-24' visibility='default' filepath='../include/link.h' line='245' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rtld_global_ro' is-struct='yes' visibility='default' size-in-bits='7424' filepath='../sysdeps/generic/ldsodefs.h' line='523' column='1' hash='d914705706d6a51a' id='type-id-344'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_dl_debug_mask' type-id='type-id-5' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_dl_platform' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_dl_platformlen' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_dl_pagesize' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_dl_minsigstacksize' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='550' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_dl_inhibit_cache' type-id='type-id-5' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_dl_initial_searchlist' type-id='type-id-321' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_dl_clktck' type-id='type-id-5' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='559' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='_dl_verbose' type-id='type-id-5' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='562' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_dl_debug_fd' type-id='type-id-5' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='_dl_lazy' type-id='type-id-5' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_dl_bind_not' type-id='type-id-5' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='_dl_dynamic_weak' type-id='type-id-5' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_dl_fpu_control' type-id='type-id-345' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_dl_hwcap' type-id='type-id-282' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_dl_auxv' type-id='type-id-346' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_dl_x86_cpu_features' type-id='type-id-296' visibility='default' filepath='../sysdeps/x86/dl-procinfo.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='_dl_x86_tlsdesc_dynamic' type-id='type-id-25' visibility='default' filepath='../sysdeps/x86/dl-procinfo.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='_dl_x86_64_runtime_resolve' type-id='type-id-25' visibility='default' filepath='../sysdeps/x86_64/dl-procinfo.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='_dl_inhibit_rpath' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='_dl_origin_path' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5376'>
        <var-decl name='_dl_tls_static_size' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='_dl_tls_static_align' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='_dl_tls_static_surplus' type-id='type-id-9' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='_dl_profile' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='_dl_profile_output' type-id='type-id-1' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='_dl_init_all_dirs' type-id='type-id-185' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='_dl_sysinfo_dso' type-id='type-id-347' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='_dl_sysinfo_map' type-id='type-id-176' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='_dl_vdso_clock_gettime64' type-id='type-id-348' visibility='default' filepath='../sysdeps/unix/sysv/linux/dl-vdso-setup.c' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='_dl_vdso_gettimeofday' type-id='type-id-349' visibility='default' filepath='../sysdeps/unix/sysv/linux/dl-vdso-setup.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='_dl_vdso_time' type-id='type-id-350' visibility='default' filepath='../sysdeps/unix/sysv/linux/dl-vdso-setup.c' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='_dl_vdso_getcpu' type-id='type-id-351' visibility='default' filepath='../sysdeps/unix/sysv/linux/dl-vdso-setup.c' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='_dl_vdso_clock_getres_time64' type-id='type-id-348' visibility='default' filepath='../sysdeps/unix/sysv/linux/dl-vdso-setup.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6208'>
        <var-decl name='_dl_vdso_getrandom' type-id='type-id-352' visibility='default' filepath='../sysdeps/unix/sysv/linux/dl-vdso-setup.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='_dl_hwcap2' type-id='type-id-282' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='_dl_hwcap3' type-id='type-id-282' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='_dl_hwcap4' type-id='type-id-282' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='645' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='_dl_dso_sort_algo' type-id='type-id-245' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='_dl_debug_printf' type-id='type-id-353' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='_dl_mcount' type-id='type-id-354' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='_dl_lookup_symbol_x' type-id='type-id-355' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='_dl_open' type-id='type-id-356' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='_dl_close' type-id='type-id-195' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='_dl_catch_error' type-id='type-id-357' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6912'>
        <var-decl name='_dl_error_free' type-id='type-id-195' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='_dl_tls_get_addr_soft' type-id='type-id-358' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7040'>
        <var-decl name='_dl_libc_freeres' type-id='type-id-203' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7104'>
        <var-decl name='_dl_find_object' type-id='type-id-359' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7168'>
        <var-decl name='_dl_readonly_area' type-id='type-id-360' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7232'>
        <var-decl name='_dl_dlfcn_hook' type-id='type-id-361' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7296'>
        <var-decl name='_dl_audit' type-id='type-id-295' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='_dl_naudit' type-id='type-id-24' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='692' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timeval' is-struct='yes' visibility='default' size-in-bits='128' filepath='../time/bits/types/struct_timeval.h' line='8' column='1' hash='bc6c194f1d75b24d' id='type-id-362'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-218' visibility='default' filepath='../time/bits/types/struct_timeval.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_usec' type-id='type-id-363' visibility='default' filepath='../time/bits/types/struct_timeval.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='256' is-anonymous='yes' filepath='../include/link.h' line='301' column='1' hash='434f02c1ec024a6b#11' id='type-id-335'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sym' type-id='type-id-192' visibility='default' filepath='../include/link.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type_class' type-id='type-id-5' visibility='default' filepath='../include/link.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-176' visibility='default' filepath='../include/link.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ret' type-id='type-id-192' visibility='default' filepath='../include/link.h' line='306' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Dl_info' type-id='type-id-258' size-in-bits='256' filepath='../dlfcn/dlfcn.h' line='94' column='1' id='type-id-257'/>
    <typedef-decl name='Elf32_Addr' type-id='type-id-102' size-in-bits='32' filepath='../elf/elf.h' line='43' column='1' hash='e66b43f97c38e87a' id='type-id-262'/>
    <typedef-decl name='Elf32_Section' type-id='type-id-364' size-in-bits='16' filepath='../elf/elf.h' line='51' column='1' hash='d7723bb93a30b11d' id='type-id-263'/>
    <typedef-decl name='Elf32_Sym' type-id='type-id-260' size-in-bits='128' filepath='../elf/elf.h' line='528' column='1' id='type-id-259'/>
    <typedef-decl name='Elf32_Word' type-id='type-id-102' size-in-bits='32' filepath='../elf/elf.h' line='31' column='1' hash='e66b43f97c38e87a' id='type-id-261'/>
    <typedef-decl name='Elf64_Addr' type-id='type-id-282' size-in-bits='64' filepath='../elf/elf.h' line='44' column='1' hash='8fdc5eea2983a729' id='type-id-272'/>
    <typedef-decl name='Elf64_Dyn' type-id='type-id-265' size-in-bits='128' filepath='../elf/elf.h' line='886' column='1' id='type-id-264'/>
    <typedef-decl name='Elf64_Ehdr' type-id='type-id-269' size-in-bits='512' filepath='../elf/elf.h' line='97' column='1' id='type-id-268'/>
    <typedef-decl name='Elf64_Half' type-id='type-id-364' size-in-bits='16' filepath='../elf/elf.h' line='28' column='1' hash='d7723bb93a30b11d' id='type-id-271'/>
    <typedef-decl name='Elf64_Off' type-id='type-id-282' size-in-bits='64' filepath='../elf/elf.h' line='48' column='1' hash='8fdc5eea2983a729' id='type-id-273'/>
    <typedef-decl name='Elf64_Phdr' type-id='type-id-275' size-in-bits='448' filepath='../elf/elf.h' line='707' column='1' id='type-id-274'/>
    <typedef-decl name='Elf64_Section' type-id='type-id-364' size-in-bits='16' filepath='../elf/elf.h' line='52' column='1' hash='d7723bb93a30b11d' id='type-id-279'/>
    <typedef-decl name='Elf64_Sxword' type-id='type-id-365' size-in-bits='64' filepath='../elf/elf.h' line='40' column='1' hash='b119fe0931d2ee10' id='type-id-266'/>
    <typedef-decl name='Elf64_Sym' type-id='type-id-278' size-in-bits='192' filepath='../elf/elf.h' line='538' column='1' id='type-id-277'/>
    <typedef-decl name='Elf64_Versym' type-id='type-id-271' size-in-bits='16' filepath='../elf/elf.h' line='56' column='1' hash='d7723bb93a30b11d' id='type-id-366'/>
    <typedef-decl name='Elf64_Word' type-id='type-id-102' size-in-bits='32' filepath='../elf/elf.h' line='33' column='1' hash='e66b43f97c38e87a' id='type-id-186'/>
    <typedef-decl name='Elf64_Xword' type-id='type-id-282' size-in-bits='64' filepath='../elf/elf.h' line='39' column='1' hash='8fdc5eea2983a729' id='type-id-276'/>
    <typedef-decl name='Elf64_auxv_t' type-id='type-id-281' size-in-bits='128' filepath='../elf/elf.h' line='1195' column='1' id='type-id-280'/>
    <typedef-decl name='Elf_Symndx' type-id='type-id-102' size-in-bits='32' filepath='../bits/elfclass.h' line='14' column='1' hash='e66b43f97c38e87a' id='type-id-323'/>
    <typedef-decl name='La_x86_64_vector' type-id='type-id-367' size-in-bits='512' filepath='../sysdeps/x86/bits/link.h' line='84' column='1' id='type-id-225'/>
    <typedef-decl name='La_x86_64_xmm' type-id='type-id-250' size-in-bits='128' filepath='../sysdeps/x86/bits/link.h' line='68' column='1' hash='b3db84c58df322c1' id='type-id-227'/>
    <typedef-decl name='La_x86_64_ymm' type-id='type-id-251' size-in-bits='256' filepath='../sysdeps/x86/bits/link.h' line='69' column='1' hash='c442e5c69f7df4a9' id='type-id-231'/>
    <typedef-decl name='La_x86_64_zmm' type-id='type-id-242' size-in-bits='512' filepath='../sysdeps/x86/bits/link.h' line='71' column='1' hash='f8859bc464d8cd16' id='type-id-233'/>
    <typedef-decl name='Lmid_t' type-id='type-id-157' size-in-bits='64' filepath='../dlfcn/dlfcn.h' line='34' column='1' hash='b119fe0931d2ee10' id='type-id-319'/>
    <typedef-decl name='__clockid_t' type-id='type-id-5' size-in-bits='32' filepath='../posix/bits/types.h' line='169' column='1' hash='09d17c08f594edc7' id='type-id-368'/>
    <typedef-decl name='__int64_t' type-id='type-id-157' size-in-bits='64' filepath='../posix/bits/types.h' line='44' column='1' hash='b119fe0931d2ee10' id='type-id-369'/>
    <typedef-decl name='__ssize_t' type-id='type-id-157' size-in-bits='64' filepath='../posix/bits/types.h' line='194' column='1' hash='b119fe0931d2ee10' id='type-id-370'/>
    <typedef-decl name='__suseconds_t' type-id='type-id-157' size-in-bits='64' filepath='../posix/bits/types.h' line='162' column='1' hash='b119fe0931d2ee10' id='type-id-363'/>
    <typedef-decl name='__uint16_t' type-id='type-id-371' size-in-bits='16' filepath='../posix/bits/types.h' line='40' column='1' hash='d7723bb93a30b11d' id='type-id-372'/>
    <typedef-decl name='__uint32_t' type-id='type-id-24' size-in-bits='32' filepath='../posix/bits/types.h' line='42' column='1' hash='e66b43f97c38e87a' id='type-id-373'/>
    <typedef-decl name='__uint64_t' type-id='type-id-106' size-in-bits='64' filepath='../posix/bits/types.h' line='45' column='1' hash='8fdc5eea2983a729' id='type-id-374'/>
    <typedef-decl name='clockid_t' type-id='type-id-368' size-in-bits='32' filepath='../time/bits/types/clockid_t.h' line='7' column='1' hash='09d17c08f594edc7' id='type-id-375'/>
    <typedef-decl name='fpu_control_t' type-id='type-id-371' size-in-bits='16' filepath='../sysdeps/x86/fpu_control.h' line='90' column='1' hash='d7723bb93a30b11d' id='type-id-345'/>
    <typedef-decl name='ino64_t' type-id='type-id-209' size-in-bits='64' filepath='../posix/sys/types.h' line='54' column='1' hash='8fdc5eea2983a729' id='type-id-339'/>
    <typedef-decl name='int64_t' type-id='type-id-369' size-in-bits='64' filepath='../bits/stdint-intn.h' line='27' column='1' hash='b119fe0931d2ee10' id='type-id-365'/>
    <typedef-decl name='lookup_t' type-id='type-id-176' size-in-bits='64' filepath='../sysdeps/generic/ldsodefs.h' line='104' column='1' hash='90f68929c8bd68b8' id='type-id-376'/>
    <typedef-decl name='ptrdiff_t' type-id='type-id-157' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stddef.h' line='160' column='1' hash='b119fe0931d2ee10' id='type-id-336'/>
    <typedef-decl name='size_t' type-id='type-id-106' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='type-id-9'/>
    <typedef-decl name='ssize_t' type-id='type-id-370' size-in-bits='64' filepath='../libio/stdio.h' line='78' column='1' hash='b119fe0931d2ee10' id='type-id-10'/>
    <typedef-decl name='time_t' type-id='type-id-218' size-in-bits='64' filepath='../time/bits/types/time_t.h' line='10' column='1' hash='b119fe0931d2ee10' id='type-id-377'/>
    <typedef-decl name='uint16_t' type-id='type-id-372' size-in-bits='16' filepath='../bits/stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='type-id-364'/>
    <typedef-decl name='uint32_t' type-id='type-id-373' size-in-bits='32' filepath='../bits/stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='type-id-102'/>
    <typedef-decl name='uint64_t' type-id='type-id-374' size-in-bits='64' filepath='../bits/stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='type-id-282'/>
    <typedef-decl name='uintptr_t' type-id='type-id-106' size-in-bits='64' filepath='../stdlib/stdint.h' line='79' column='1' hash='8fdc5eea2983a729' id='type-id-190'/>
    <union-decl name='La_x86_64_vector' naming-typedef-id='type-id-225' visibility='default' size-in-bits='512' filepath='../sysdeps/x86/bits/link.h' line='77' column='1' hash='2436bf4177161b50' id='type-id-367'>
      <data-member access='public'>
        <var-decl name='ymm' type-id='type-id-232' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='zmm' type-id='type-id-234' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='81' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='xmm' type-id='type-id-228' visibility='default' filepath='../sysdeps/x86/bits/link.h' line='83' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../sysdeps/generic/ldsodefs.h' line='262' column='1' hash='5479b6765c81aeb8#2' id='type-id-292'>
      <data-member access='public'>
        <var-decl name='i86_gnu_pltenter' type-id='type-id-378' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='265' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='x86_64_gnu_pltenter' type-id='type-id-379' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='265' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='x32_gnu_pltenter' type-id='type-id-380' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='265' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../elf/elf.h' line='881' column='1' hash='6a291853fcbf22a5#3' id='type-id-267'>
      <data-member access='public'>
        <var-decl name='d_val' type-id='type-id-276' visibility='default' filepath='../elf/elf.h' line='883' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='d_ptr' type-id='type-id-272' visibility='default' filepath='../elf/elf.h' line='884' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../include/link.h' line='162' column='1' hash='43b9589ac8218fdb#12' id='type-id-325'>
      <data-member access='public'>
        <var-decl name='l_gnu_buckets' type-id='type-id-381' visibility='default' filepath='../include/link.h' line='164' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='l_chain' type-id='type-id-382' visibility='default' filepath='../include/link.h' line='165' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../include/link.h' line='167' column='1' hash='893d2dcc44239fb1#13' id='type-id-326'>
      <data-member access='public'>
        <var-decl name='l_gnu_chain_zero' type-id='type-id-381' visibility='default' filepath='../include/link.h' line='169' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='l_buckets' type-id='type-id-382' visibility='default' filepath='../include/link.h' line='170' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../elf/elf.h' line='1188' column='1' hash='7a8cbf12fff76032#49' id='type-id-283'>
      <data-member access='public'>
        <var-decl name='a_val' type-id='type-id-282' visibility='default' filepath='../elf/elf.h' line='1190' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../sysdeps/generic/ldsodefs.h' line='255' column='1' hash='e564fbd23d8c211c#51' id='type-id-291'>
      <data-member access='public'>
        <var-decl name='symbind32' type-id='type-id-383' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='257' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='symbind64' type-id='type-id-384' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='259' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__8' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='../sysdeps/generic/ldsodefs.h' line='268' column='1' hash='8ca5190fbf91b6cd#55' id='type-id-293'>
      <data-member access='public'>
        <var-decl name='i86_gnu_pltexit' type-id='type-id-385' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='271' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='x86_64_gnu_pltexit' type-id='type-id-386' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='271' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='x32_gnu_pltexit' type-id='type-id-387' visibility='default' filepath='../sysdeps/generic/ldsodefs.h' line='271' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../sysdeps/x86/include/cpu-features.h' line='912' column='1' hash='5fc7b00358caa6a2#57' id='type-id-300'>
      <data-member access='public'>
        <var-decl name='active_array' type-id='type-id-388' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='914' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='active' type-id='type-id-301' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='915' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='../sysdeps/x86/include/cpu-features.h' line='907' column='1' hash='1e6ce1c72171656a#58' id='type-id-299'>
      <data-member access='public'>
        <var-decl name='cpuid_array' type-id='type-id-388' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='909' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cpuid' type-id='type-id-301' visibility='default' filepath='../sysdeps/x86/include/cpu-features.h' line='910' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='type-id-97'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-94'/>
    <array-type-def dimensions='1' type-id='type-id-94' size-in-bits='128' hash='db96c40792853cfe' id='type-id-270'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-156'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='32' hash='208eeaf38f58d035' id='type-id-298'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-235'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-24' size-in-bits='128' hash='42086985110cb09a' id='type-id-388'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-229'/>
    </array-type-def>
    <type-decl name='unsigned long long int' size-in-bits='64' hash='ebdfc4685a1e82df#3' id='type-id-184'/>
    <array-type-def dimensions='1' type-id='type-id-184' size-in-bits='384' hash='7d57bb7debf3a6c2' id='type-id-303'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-106' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='type-id-389'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#4' id='type-id-371'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' hash='58711d26b01ba3c1' id='type-id-390'/>
    <pointer-type-def type-id='type-id-391' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-378'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-380'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' hash='81f34c547ee9f647' id='type-id-393'/>
    <pointer-type-def type-id='type-id-394' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-379'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' hash='3206d1002e26588e' id='type-id-222'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' hash='ea0f618b457f3c17' id='type-id-395'/>
    <pointer-type-def type-id='type-id-366' size-in-bits='64' hash='876bbfc9c3acdcf4' id='type-id-329'/>
    <pointer-type-def type-id='type-id-280' size-in-bits='64' hash='556f81c2a571b32a' id='type-id-346'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' hash='ad19a919c58f0651' id='type-id-396'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' hash='e7dde34e4ef0d547' id='type-id-397'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' hash='6421a4b249f64b66' id='type-id-295'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' hash='9c0e3f8596726a0b' id='type-id-398'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-11'/>
    <pointer-type-def type-id='type-id-399' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-288'/>
    <pointer-type-def type-id='type-id-400' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-309'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-23'/>
    <qualified-type-def type-id='type-id-261' const='yes' hash='5c125f98c05d0a96' id='type-id-401'/>
    <pointer-type-def type-id='type-id-401' size-in-bits='64' hash='b27af600eea45070' id='type-id-381'/>
    <qualified-type-def type-id='type-id-272' const='yes' hash='da6a31a1c9b7880b' id='type-id-402'/>
    <pointer-type-def type-id='type-id-402' size-in-bits='64' hash='1ec84d048c11aa17' id='type-id-324'/>
    <qualified-type-def type-id='type-id-268' const='yes' hash='14748f303e55779d' id='type-id-403'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' hash='59489a54900ba47f' id='type-id-347'/>
    <qualified-type-def type-id='type-id-274' const='yes' hash='51611f98abc3863c' id='type-id-404'/>
    <pointer-type-def type-id='type-id-404' size-in-bits='64' hash='d7f46a025d7f7c6d' id='type-id-320'/>
    <qualified-type-def type-id='type-id-277' const='yes' hash='f86c8f4238204abd' id='type-id-405'/>
    <pointer-type-def type-id='type-id-405' size-in-bits='64' hash='bb500a4acf88d8ae' id='type-id-192'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' hash='43d0bc742e67776a' id='type-id-406'/>
    <qualified-type-def type-id='type-id-323' const='yes' hash='6e887d11b0f6f18a' id='type-id-407'/>
    <pointer-type-def type-id='type-id-407' size-in-bits='64' hash='cb294d8a84c1a801' id='type-id-382'/>
    <qualified-type-def type-id='type-id-284' const='yes' hash='b97ef4e81a1a4caa' id='type-id-408'/>
    <pointer-type-def type-id='type-id-408' size-in-bits='64' hash='9aa7aba14a35804c' id='type-id-409'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-410'/>
    <qualified-type-def type-id='type-id-304' const='yes' hash='42f28459be75fc03' id='type-id-411'/>
    <pointer-type-def type-id='type-id-411' size-in-bits='64' hash='6a7a59f0fe34ce4f' id='type-id-361'/>
    <qualified-type-def type-id='type-id-340' const='yes' hash='85ddebebd40912a6' id='type-id-412'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' hash='7087bdd4deac313d' id='type-id-413'/>
    <qualified-type-def type-id='type-id-344' const='yes' hash='cd40ba9c07e9cc2a' id='type-id-81'/>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' hash='60573ddbe6249c88' id='type-id-414'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-360'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-348'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-357'/>
    <pointer-type-def type-id='type-id-418' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-349'/>
    <pointer-type-def type-id='type-id-419' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-351'/>
    <pointer-type-def type-id='type-id-420' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-306'/>
    <pointer-type-def type-id='type-id-421' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-310'/>
    <pointer-type-def type-id='type-id-422' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-311'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-359'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-312'/>
    <pointer-type-def type-id='type-id-317' size-in-bits='64' hash='d2cb24fff6948361' id='type-id-318'/>
    <pointer-type-def type-id='type-id-199' size-in-bits='64' hash='90f68929c8bd68b8' id='type-id-176'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' hash='446dee1d4a14305f' id='type-id-332'/>
    <pointer-type-def type-id='type-id-337' size-in-bits='64' hash='c13915c72f2cd039' id='type-id-333'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' hash='9525b6affe75cc9d#2' id='type-id-425'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-355'/>
    <pointer-type-def type-id='type-id-340' size-in-bits='64' hash='dba4d536eea4ed2f' id='type-id-322'/>
    <pointer-type-def type-id='type-id-321' size-in-bits='64' hash='6028876d3c197569' id='type-id-179'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' hash='9ccd67552b2cf68b' id='type-id-330'/>
    <pointer-type-def type-id='type-id-341' size-in-bits='64' hash='f7db72e8aef32f91' id='type-id-185'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' hash='ad8ca7177ca5c715' id='type-id-342'/>
    <pointer-type-def type-id='type-id-343' size-in-bits='64' hash='b528e7ec7499ae23' id='type-id-328'/>
    <pointer-type-def type-id='type-id-427' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-352'/>
    <pointer-type-def type-id='type-id-428' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-350'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' hash='784a05f2083b5c30' id='type-id-429'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' hash='abfdebaa4180c5b7' id='type-id-430'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' hash='5f318e120e3d3e21' id='type-id-431'/>
    <pointer-type-def type-id='type-id-432' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-383'/>
    <pointer-type-def type-id='type-id-433' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-384'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' hash='1934f759d4490b61' id='type-id-434'/>
    <pointer-type-def type-id='type-id-435' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-385'/>
    <pointer-type-def type-id='type-id-436' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-387'/>
    <pointer-type-def type-id='type-id-437' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-386'/>
    <pointer-type-def type-id='type-id-438' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-289'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-294'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' hash='232fa04f890c2a5a' id='type-id-440'/>
    <pointer-type-def type-id='type-id-441' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-354'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-353'/>
    <pointer-type-def type-id='type-id-443' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-290'/>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-287'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-203'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-195'/>
    <pointer-type-def type-id='type-id-445' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-313'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-314'/>
    <pointer-type-def type-id='type-id-447' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-305'/>
    <pointer-type-def type-id='type-id-448' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-356'/>
    <pointer-type-def type-id='type-id-449' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-358'/>
    <pointer-type-def type-id='type-id-450' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-315'/>
    <pointer-type-def type-id='type-id-451' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-316'/>
    <pointer-type-def type-id='type-id-452' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-308'/>
    <pointer-type-def type-id='type-id-453' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-307'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' hash='473a9667a2856e32' id='type-id-26'/>
    <pointer-type-def type-id='type-id-454' size-in-bits='64' id='type-id-455'/>
    <pointer-type-def type-id='type-id-456' size-in-bits='64' id='type-id-457'/>
    <qualified-type-def type-id='type-id-454' const='yes' id='type-id-458'/>
    <pointer-type-def type-id='type-id-458' size-in-bits='64' id='type-id-459'/>
    <class-decl name='La_i86_regs' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-454'/>
    <class-decl name='La_i86_retval' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-456'/>
    <function-decl name='__libc_init_first' mangled-name='__libc_init_first' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu/init-first.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__libc_init_first@@GLIBC_2.2.5' hash='d8c09233a25b2ead'>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <type-decl name='void' id='type-id-7'/>
    <pointer-type-def type-id='type-id-7' id='type-id-25'/>
    <function-type size-in-bits='64' hash='beee6aa28ca6ea5c' id='type-id-391'>
      <parameter type-id='type-id-393'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-455'/>
      <parameter type-id='type-id-440'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-425'/>
      <return type-id='type-id-262'/>
    </function-type>
    <function-type size-in-bits='64' hash='25c8e55c2a4daddf' id='type-id-392'>
      <parameter type-id='type-id-393'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-396'/>
      <parameter type-id='type-id-440'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-425'/>
      <return type-id='type-id-262'/>
    </function-type>
    <function-type size-in-bits='64' hash='d15af77480d48e5b' id='type-id-394'>
      <parameter type-id='type-id-395'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-396'/>
      <parameter type-id='type-id-440'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-425'/>
      <return type-id='type-id-272'/>
    </function-type>
    <function-type size-in-bits='64' hash='f3ec58f050df3d8f' id='type-id-399'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' hash='02a096d257a5e00d' id='type-id-400'>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' hash='73f49857ea5eda8d' id='type-id-415'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-244'/>
    </function-type>
    <function-type size-in-bits='64' hash='abb4abf77092cad6' id='type-id-416'>
      <parameter type-id='type-id-375'/>
      <parameter type-id='type-id-430'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='f665afd24f4b2d2f' id='type-id-417'>
      <parameter type-id='type-id-410'/>
      <parameter type-id='type-id-410'/>
      <parameter type-id='type-id-398'/>
      <parameter type-id='type-id-195'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='b270d121908e8263' id='type-id-418'>
      <parameter type-id='type-id-431'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='e70a91745e9a1c74' id='type-id-419'>
      <parameter type-id='type-id-440'/>
      <parameter type-id='type-id-440'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-420'>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='b1b4616e01fa8582' id='type-id-421'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-390'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='ebfa3497c759a737' id='type-id-422'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-390'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='90bec03971a4b5cf' id='type-id-423'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-414'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='d628501fd2223339' id='type-id-424'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-5'/>
    </function-type>
    <function-type size-in-bits='64' hash='fe57cc9b59165333' id='type-id-426'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-176'/>
      <parameter type-id='type-id-406'/>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-413'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-376'/>
    </function-type>
    <function-type size-in-bits='64' hash='30339402a5cac7d3' id='type-id-427'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-9'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' hash='dfbf0d86b5e56f45' id='type-id-428'>
      <parameter type-id='type-id-429'/>
      <return type-id='type-id-377'/>
    </function-type>
    <function-type size-in-bits='64' hash='1beea905ac514895' id='type-id-432'>
      <parameter type-id='type-id-393'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-440'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-190'/>
    </function-type>
    <function-type size-in-bits='64' hash='4a82b6c4ecdd42c1' id='type-id-433'>
      <parameter type-id='type-id-395'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-440'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-190'/>
    </function-type>
    <function-type size-in-bits='64' hash='45c3c68cf7675f46' id='type-id-435'>
      <parameter type-id='type-id-393'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-459'/>
      <parameter type-id='type-id-457'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' hash='09c437ab337080fe' id='type-id-436'>
      <parameter type-id='type-id-393'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-409'/>
      <parameter type-id='type-id-397'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' hash='057586a83a0397d2' id='type-id-437'>
      <parameter type-id='type-id-395'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-409'/>
      <parameter type-id='type-id-397'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' hash='f1c2ae8043b1b086' id='type-id-438'>
      <parameter type-id='type-id-176'/>
      <parameter type-id='type-id-319'/>
      <parameter type-id='type-id-434'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' hash='47b16de5a6d51dc6' id='type-id-439'>
      <parameter type-id='type-id-434'/>
      <return type-id='type-id-24'/>
    </function-type>
    <function-type size-in-bits='64' hash='91495cdf6321a116' id='type-id-441'>
      <parameter type-id='type-id-272'/>
      <parameter type-id='type-id-272'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='f9435d738c2c7035' id='type-id-443'>
      <parameter type-id='type-id-434'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='484456fde34d6754' id='type-id-444'>
      <parameter type-id='type-id-434'/>
      <parameter type-id='type-id-24'/>
      <return type-id='type-id-7'/>
    </function-type>
    <function-type size-in-bits='64' hash='f2690588a26e973f' id='type-id-445'>
      <parameter type-id='type-id-319'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' hash='7cffa03161e7e042' id='type-id-446'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' hash='7cffa03161e7e042' id='type-id-447'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' hash='6e9777e4148e377d' id='type-id-448'>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-319'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' hash='b2af78908ae2fcee' id='type-id-449'>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' hash='53885bde0aa65efe' id='type-id-450'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' hash='3d5693612af11c46' id='type-id-451'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' hash='3d5693612af11c46' id='type-id-452'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' hash='53885bde0aa65efe' id='type-id-453'>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-25'/>
      <return type-id='type-id-25'/>
    </function-type>
    <function-type size-in-bits='64' hash='53885bde0aa65efe' id='type-id-442'>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='version.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu' language='LANG_C11'>
    <function-decl name='__gnu_get_libc_release' mangled-name='gnu_get_libc_release' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu/version.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnu_get_libc_release@@GLIBC_2.2.5' hash='53885bde0aa65efe'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__gnu_get_libc_version' mangled-name='gnu_get_libc_version' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/csu/version.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnu_get_libc_version@@GLIBC_2.2.5' hash='53885bde0aa65efe'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ctype-c99.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype' language='LANG_C11'>
    <function-decl name='isblank' mangled-name='isblank' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isblank@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ctype-c99_l.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype' language='LANG_C11'>
    <function-decl name='__isblank_l' mangled-name='__isblank_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isblank_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ctype-extn.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype' language='LANG_C11'>
    <function-decl name='_tolower' mangled-name='_tolower' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-extn.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_tolower@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='_toupper' mangled-name='_toupper' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-extn.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_toupper@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='toascii' mangled-name='toascii' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-extn.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='toascii@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='isascii' mangled-name='isascii' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-extn.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isascii@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ctype-info.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-461' size-in-bits='unknown' hash='aea432c75365ece4' id='type-id-462'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-107'/>
    </array-type-def>
    <typedef-decl name='__int32_t' type-id='type-id-5' size-in-bits='32' filepath='../posix/bits/types.h' line='41' column='1' hash='09d17c08f594edc7' id='type-id-463'/>
    <typedef-decl name='int32_t' type-id='type-id-463' size-in-bits='32' filepath='../bits/stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='type-id-464'/>
    <qualified-type-def type-id='type-id-463' const='yes' hash='3aaf0f2479f2834c' id='type-id-465'/>
    <pointer-type-def type-id='type-id-465' size-in-bits='64' hash='96e1bfcb27b9d6ed' id='type-id-466'/>
    <qualified-type-def type-id='type-id-373' const='yes' hash='7498793d05474fe3' id='type-id-467'/>
    <pointer-type-def type-id='type-id-467' size-in-bits='64' hash='47fd502b413bc7bd' id='type-id-468'/>
    <qualified-type-def type-id='type-id-464' const='yes' hash='118d35f5174d8310' id='type-id-469'/>
    <pointer-type-def type-id='type-id-469' size-in-bits='64' hash='f58d7a5e4ceb114e' id='type-id-470'/>
    <pointer-type-def type-id='type-id-470' size-in-bits='64' hash='bf01fe4297e4097a' id='type-id-471'/>
    <pointer-type-def type-id='type-id-472' size-in-bits='64' hash='b6631e6f59f2a2c1' id='type-id-473'/>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='../include/ctype.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_b_loc@@GLIBC_2.3' hash='dfb41af42b9f1250'>
      <return type-id='type-id-473'/>
    </function-decl>
    <function-decl name='__ctype_toupper_loc' mangled-name='__ctype_toupper_loc' filepath='../include/ctype.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_toupper_loc@@GLIBC_2.3' hash='2dffcab850dda719'>
      <return type-id='type-id-471'/>
    </function-decl>
    <function-decl name='__ctype_tolower_loc' mangled-name='__ctype_tolower_loc' filepath='../include/ctype.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_tolower_loc@@GLIBC_2.3' hash='2dffcab850dda719'>
      <return type-id='type-id-471'/>
    </function-decl>
    <function-decl name='__ctype_init' mangled-name='__GI___ctype_init' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-info.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_init@@GLIBC_PRIVATE' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
    <var-decl name='__ctype_b' type-id='type-id-474' mangled-name='__ctype_b' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-info.c' line='68' column='1' elf-symbol-id='__ctype_b@GLIBC_2.2.5'/>
    <var-decl name='__ctype32_b' type-id='type-id-468' mangled-name='__ctype32_b' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-info.c' line='69' column='1' elf-symbol-id='__ctype32_b@GLIBC_2.2.5'/>
    <var-decl name='__ctype_tolower' type-id='type-id-466' mangled-name='__ctype_tolower' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-info.c' line='70' column='1' elf-symbol-id='__ctype_tolower@GLIBC_2.2.5'/>
    <var-decl name='__ctype_toupper' type-id='type-id-466' mangled-name='__ctype_toupper' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-info.c' line='71' column='1' elf-symbol-id='__ctype_toupper@GLIBC_2.2.5'/>
    <var-decl name='__ctype32_tolower' type-id='type-id-468' mangled-name='__ctype32_tolower' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-info.c' line='72' column='1' elf-symbol-id='__ctype32_tolower@GLIBC_2.2.5'/>
    <var-decl name='__ctype32_toupper' type-id='type-id-468' mangled-name='__ctype32_toupper' visibility='default' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-info.c' line='73' column='1' elf-symbol-id='__ctype32_toupper@GLIBC_2.2.5'/>
  </abi-instr>
  <abi-instr address-size='64' path='ctype.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype' language='LANG_C11'>
    <function-decl name='isalnum' mangled-name='isalnum' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isalnum@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='isalpha' mangled-name='isalpha' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isalpha@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='iscntrl' mangled-name='iscntrl' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='iscntrl@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='isdigit' mangled-name='isdigit' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isdigit@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='islower' mangled-name='islower' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='islower@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='isgraph' mangled-name='isgraph' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isgraph@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='isprint' mangled-name='isprint' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isprint@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='ispunct' mangled-name='ispunct' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ispunct@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='isspace' mangled-name='isspace' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isspace@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='isupper' mangled-name='isupper' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isupper@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='isxdigit' mangled-name='isxdigit' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isxdigit@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='tolower' mangled-name='__GI_tolower' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tolower@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='toupper' mangled-name='__GI_toupper' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='toupper@@GLIBC_2.2.5' hash='d628501fd2223339'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ctype_l.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype' language='LANG_C11'>
    <function-decl name='__isalnum_l' mangled-name='__isalnum_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isalnum_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__isalpha_l' mangled-name='__isalpha_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isalpha_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__iscntrl_l' mangled-name='__iscntrl_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__iscntrl_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__isdigit_l' mangled-name='__isdigit_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isdigit_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__islower_l' mangled-name='__islower_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__islower_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__isgraph_l' mangled-name='__isgraph_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isgraph_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__isprint_l' mangled-name='__isprint_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isprint_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__ispunct_l' mangled-name='__ispunct_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='34' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ispunct_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__isspace_l' mangled-name='__isspace_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isspace_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__isupper_l' mangled-name='__isupper_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isupper_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__isxdigit_l' mangled-name='__isxdigit_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isxdigit_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__tolower_l' mangled-name='__tolower_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__tolower_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='__toupper_l' mangled-name='__toupper_l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype_l.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__toupper_l@@GLIBC_2.2.5' hash='fa849306bfaa53c4'>
      <parameter type-id='type-id-5' name='c' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <parameter type-id='type-id-460' name='l' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/ctype-c99_l.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='isctype.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype' language='LANG_C11'>
    <function-decl name='__isctype' mangled-name='__isctype' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/isctype.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isctype@@GLIBC_2.3' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-5' name='ch' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/isctype.c' line='23' column='1'/>
      <parameter type-id='type-id-5' name='mask' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/ctype/isctype.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../sysdeps/unix/sysv/linux/ppoll_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__ppoll_chk' mangled-name='__ppoll_chk' filepath='../sysdeps/unix/sysv/linux/ppoll_chk.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ppoll_chk@@GLIBC_2.16' hash='5fc8c40a944409dc'>
      <parameter type-id='type-id-475' name='fds' filepath='../sysdeps/unix/sysv/linux/ppoll_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-476' name='nfds' filepath='../sysdeps/unix/sysv/linux/ppoll_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-477' name='tmo' filepath='../sysdeps/unix/sysv/linux/ppoll_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-478' name='ss' filepath='../sysdeps/unix/sysv/linux/ppoll_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-106' name='fdslen' filepath='../sysdeps/unix/sysv/linux/ppoll_chk.c' line='24' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../sysdeps/unix/sysv/linux/readonly-area-fallback.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='asprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='___asprintf_chk' mangled-name='__asprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/asprintf_chk.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asprintf_chk@@GLIBC_2.8' hash='0147035cb894c11c'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-5'/>
      <parameter type-id='type-id-1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='backtrace.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__backtrace' mangled-name='__GI___backtrace' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/backtrace.c' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__backtrace@@GLIBC_2.2.5' hash='03f7c1904d44eca6'>
      <parameter type-id='type-id-26' name='array' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/backtrace.c' line='103' column='1'/>
      <parameter type-id='type-id-5' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/backtrace.c' line='103' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='backtracesyms.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__backtrace_symbols' mangled-name='__backtrace_symbols' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/backtracesyms.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__backtrace_symbols@@GLIBC_2.2.5' hash='1ad21153feb758ce'>
      <parameter type-id='type-id-479' name='array' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/backtracesyms.c' line='36' column='1'/>
      <parameter type-id='type-id-5' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/backtracesyms.c' line='36' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='backtracesymsfd.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__backtrace_symbols_fd' mangled-name='__GI___backtrace_symbols_fd' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/backtracesymsfd.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__backtrace_symbols_fd@@GLIBC_2.2.5' hash='ae5f1af54d2b4e86'>
      <parameter type-id='type-id-479' name='array' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/backtracesymsfd.c' line='35' column='1'/>
      <parameter type-id='type-id-5' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/backtracesymsfd.c' line='35' column='1'/>
      <parameter type-id='type-id-5' name='fd' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/backtracesymsfd.c' line='35' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='chk_fail.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__chk_fail' mangled-name='__GI___chk_fail' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/chk_fail.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__chk_fail@@GLIBC_2.3.4' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='confstr_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__confstr_chk' mangled-name='__confstr_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/confstr_chk.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__confstr_chk@@GLIBC_2.4' hash='3fa0bd3e2ecdc3e3'>
      <parameter type-id='type-id-5' name='name' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/confstr_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-11' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/confstr_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/confstr_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/confstr_chk.c' line='22' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__dprintf_chk' mangled-name='__dprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/dprintf_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__dprintf_chk@@GLIBC_2.8' hash='036914148a5f7500'>
      <parameter type-id='type-id-5' name='d' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/dprintf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/dprintf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-1' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/dprintf_chk.c' line='24' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='explicit_bzero_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__explicit_bzero_chk' mangled-name='__explicit_bzero_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/explicit_bzero_chk.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__explicit_bzero_chk@@GLIBC_2.25' hash='91495cdf6321a116'>
      <parameter type-id='type-id-25' name='dst' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/explicit_bzero_chk.c' line='29' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/explicit_bzero_chk.c' line='29' column='1'/>
      <parameter type-id='type-id-9' name='dstlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/explicit_bzero_chk.c' line='29' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fdelt_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__fdelt_chk' mangled-name='__GI___fdelt_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fdelt_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__fdelt_warn@@GLIBC_2.15' hash='b1dcd91100b153bb#5'>
      <parameter type-id='type-id-157' name='d' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fdelt_chk.c' line='23' column='1'/>
      <return type-id='type-id-157'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fgets_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__fgets_chk' mangled-name='__fgets_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgets_chk.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__fgets_chk@@GLIBC_2.4' hash='7b82d3adef0e4204'>
      <parameter type-id='type-id-11' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgets_chk.c' line='32' column='1'/>
      <parameter type-id='type-id-9' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgets_chk.c' line='32' column='1'/>
      <parameter type-id='type-id-5' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgets_chk.c' line='32' column='1'/>
      <parameter type-id='type-id-480' name='fp' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgets_chk.c' line='32' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fgets_u_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__fgets_unlocked_chk' mangled-name='__GI___fgets_unlocked_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgets_u_chk.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__fgets_unlocked_chk@@GLIBC_2.4' hash='7b82d3adef0e4204'>
      <parameter type-id='type-id-11' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgets_chk.c' line='32' column='1'/>
      <parameter type-id='type-id-9' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgets_chk.c' line='32' column='1'/>
      <parameter type-id='type-id-5' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgets_chk.c' line='32' column='1'/>
      <parameter type-id='type-id-480' name='fp' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgets_chk.c' line='32' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fgetws_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__fgetws_chk' mangled-name='__fgetws_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgetws_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__fgetws_chk@@GLIBC_2.4' hash='0adae27cb36f1a74'>
      <parameter type-id='type-id-481' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgetws_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgetws_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-5' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgetws_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-480' name='fp' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgetws_chk.c' line='23' column='1'/>
      <return type-id='type-id-481'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fgetws_u_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__fgetws_unlocked_chk' mangled-name='__fgetws_unlocked_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgetws_u_chk.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__fgetws_unlocked_chk@@GLIBC_2.4' hash='0adae27cb36f1a74'>
      <parameter type-id='type-id-481' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgetws_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgetws_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-5' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgetws_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-480' name='fp' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fgetws_chk.c' line='23' column='1'/>
      <return type-id='type-id-481'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fortify_fail.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__fortify_fail' mangled-name='__GI___fortify_fail' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fortify_fail.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__fortify_fail@@GLIBC_PRIVATE' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='___fprintf_chk' mangled-name='__fprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fprintf_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__fprintf_chk@@GLIBC_2.3.4' hash='5c35d2c352069845#2'>
      <parameter type-id='type-id-480' name='fp' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fprintf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fprintf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-1' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fprintf_chk.c' line='24' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fread_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__fread_chk' mangled-name='__fread_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_chk.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__fread_chk@@GLIBC_2.7' hash='0d6ee0d8d015c3ca'>
      <parameter type-id='type-id-482' name='ptr' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_chk.c' line='31' column='1'/>
      <parameter type-id='type-id-9' name='ptrlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_chk.c' line='31' column='1'/>
      <parameter type-id='type-id-9' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_chk.c' line='32' column='1'/>
      <parameter type-id='type-id-9' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_chk.c' line='32' column='1'/>
      <parameter type-id='type-id-483' name='stream' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_chk.c' line='32' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fread_u_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__fread_unlocked_chk' mangled-name='__fread_unlocked_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_u_chk.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__fread_unlocked_chk@@GLIBC_2.7' hash='0d6ee0d8d015c3ca'>
      <parameter type-id='type-id-482' name='ptr' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_chk.c' line='31' column='1'/>
      <parameter type-id='type-id-9' name='ptrlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_chk.c' line='31' column='1'/>
      <parameter type-id='type-id-9' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_chk.c' line='32' column='1'/>
      <parameter type-id='type-id-9' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_chk.c' line='32' column='1'/>
      <parameter type-id='type-id-483' name='stream' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fread_chk.c' line='32' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fwprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__fwprintf_chk' mangled-name='__fwprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fwprintf_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__fwprintf_chk@@GLIBC_2.4' hash='e7afe72acde6ea96'>
      <parameter type-id='type-id-480' name='fp' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fwprintf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fwprintf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-484' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/fwprintf_chk.c' line='24' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='getcwd_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__getcwd_chk' mangled-name='__getcwd_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getcwd_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__getcwd_chk@@GLIBC_2.4' hash='f567781ec489db7a'>
      <parameter type-id='type-id-11' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getcwd_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-9' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getcwd_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getcwd_chk.c' line='24' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='getdomainname_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__getdomainname_chk' mangled-name='__GI___getdomainname_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getdomainname_chk.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__getdomainname_chk@@GLIBC_2.4' hash='42def59a7fc3d257'>
      <parameter type-id='type-id-11' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getdomainname_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getdomainname_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-9' name='nreal' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getdomainname_chk.c' line='22' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='getgroups_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__getgroups_chk' mangled-name='__getgroups_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getgroups_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__getgroups_chk@@GLIBC_2.4' hash='a65de22bfc16ada7'>
      <parameter type-id='type-id-5' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getgroups_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-485' name='list' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getgroups_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='listlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getgroups_chk.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gethostname_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__gethostname_chk' mangled-name='__gethostname_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/gethostname_chk.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__gethostname_chk@@GLIBC_2.4' hash='42def59a7fc3d257'>
      <parameter type-id='type-id-11' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getdomainname_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getdomainname_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-9' name='nreal' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getdomainname_chk.c' line='22' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='gets_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__gets_chk' mangled-name='__gets_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/gets_chk.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__gets_chk@@GLIBC_2.3.4' hash='8d96ff9a88b5c973'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='getwd_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__getwd_chk' mangled-name='__getwd_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/getwd_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__getwd_chk@@GLIBC_2.4' hash='8d96ff9a88b5c973'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='inet_ntop_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__inet_ntop_chk' mangled-name='__GI___inet_ntop_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/inet_ntop_chk.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__inet_ntop_chk@@GLIBC_2.42' hash='479a71f9dc794ac3'>
      <parameter type-id='type-id-5' name='af' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/inet_ntop_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-25' name='src' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/inet_ntop_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-11' name='dst' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/inet_ntop_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-486' name='size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/inet_ntop_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='dst_size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/inet_ntop_chk.c' line='23' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='inet_pton_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__inet_pton_chk' mangled-name='__GI___inet_pton_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/inet_pton_chk.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__inet_pton_chk@@GLIBC_2.42' hash='e852bd73466c80dc'>
      <parameter type-id='type-id-5' name='af' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/inet_pton_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/inet_pton_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-25' name='dst' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/inet_pton_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-9' name='dst_size' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/inet_pton_chk.c' line='22' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='longjmp_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__longjmp_chk' mangled-name='__GI___longjmp_chk' filepath='../setjmp/longjmp.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__longjmp_chk@@GLIBC_2.11' hash='262f488871b7c99c'>
      <parameter type-id='type-id-487'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mbsnrtowcs_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__mbsnrtowcs_chk' mangled-name='__mbsnrtowcs_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsnrtowcs_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__mbsnrtowcs_chk@@GLIBC_2.4' hash='6d81d91eecf5ba14'>
      <parameter type-id='type-id-481' name='dst' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsnrtowcs_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-410' name='src' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsnrtowcs_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='nmc' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsnrtowcs_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsnrtowcs_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-488' name='ps' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsnrtowcs_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-9' name='dstlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsnrtowcs_chk.c' line='24' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mbsrtowcs_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__mbsrtowcs_chk' mangled-name='__mbsrtowcs_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsrtowcs_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__mbsrtowcs_chk@@GLIBC_2.4' hash='6a79caaf4e1782ec'>
      <parameter type-id='type-id-481' name='dst' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsrtowcs_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-410' name='src' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsrtowcs_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsrtowcs_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-488' name='ps' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsrtowcs_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-9' name='dstlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbsrtowcs_chk.c' line='24' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='mbstowcs_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__mbstowcs_chk' mangled-name='__mbstowcs_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbstowcs_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__mbstowcs_chk@@GLIBC_2.4' hash='56bbd2a5bf48865e'>
      <parameter type-id='type-id-481' name='dst' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbstowcs_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbstowcs_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbstowcs_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-9' name='dstlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/mbstowcs_chk.c' line='24' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='noophooks.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__cyg_profile_func_enter' mangled-name='__cyg_profile_func_enter' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/noophooks.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__cyg_profile_func_enter@@GLIBC_2.2.5' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-25' name='this_fn' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/noophooks.c' line='22' column='1'/>
      <parameter type-id='type-id-25' name='call_site' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/noophooks.c' line='22' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-489'>
      <parameter type-id='type-id-25' name='this_fn' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/noophooks.c' line='22' column='1'/>
      <parameter type-id='type-id-25' name='call_site' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/noophooks.c' line='22' column='1'/>
      <return type-id='type-id-7'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='obprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <class-decl name='obstack' is-struct='yes' visibility='default' size-in-bits='704' filepath='../malloc/obstack.h' line='153' column='1' hash='80ff7df2cb6a9bff' id='type-id-490'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='chunk_size' type-id='type-id-157' visibility='default' filepath='../malloc/obstack.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='chunk' type-id='type-id-491' visibility='default' filepath='../malloc/obstack.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='object_base' type-id='type-id-11' visibility='default' filepath='../malloc/obstack.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next_free' type-id='type-id-11' visibility='default' filepath='../malloc/obstack.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='chunk_limit' type-id='type-id-11' visibility='default' filepath='../malloc/obstack.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='temp' type-id='type-id-492' visibility='default' filepath='../malloc/obstack.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='alignment_mask' type-id='type-id-5' visibility='default' filepath='../malloc/obstack.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='chunkfun' type-id='type-id-493' visibility='default' filepath='../malloc/obstack.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='freefun' type-id='type-id-494' visibility='default' filepath='../malloc/obstack.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='extra_arg' type-id='type-id-25' visibility='default' filepath='../malloc/obstack.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='use_extra_arg' type-id='type-id-24' visibility='default' filepath='../malloc/obstack.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='641'>
        <var-decl name='maybe_empty_object' type-id='type-id-24' visibility='default' filepath='../malloc/obstack.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='642'>
        <var-decl name='alloc_failed' type-id='type-id-24' visibility='default' filepath='../malloc/obstack.h' line='177' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='__obstack_printf_chk' mangled-name='__obstack_printf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/obprintf_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__obstack_printf_chk@@GLIBC_2.8' hash='3244cc85d86a7ea2'>
      <parameter type-id='type-id-495' name='obstack' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/obprintf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/obprintf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-1' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/obprintf_chk.c' line='24' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='poll_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__poll_chk' mangled-name='__poll_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/poll_chk.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__poll_chk@@GLIBC_2.16' hash='f02f010077bcf06f'>
      <parameter type-id='type-id-475' name='fds' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/poll_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-476' name='nfds' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/poll_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-5' name='timeout' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/poll_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-106' name='fdslen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/poll_chk.c' line='22' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pread64_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__pread64_chk' mangled-name='__pread64_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread64_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__pread64_chk@@GLIBC_2.4' hash='33800747c0c03639'>
      <parameter type-id='type-id-5' name='fd' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread64_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-25' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread64_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='nbytes' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread64_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-496' name='offset' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread64_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread64_chk.c' line='23' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pread_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__pread_chk' mangled-name='__pread_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__pread_chk@@GLIBC_2.4' hash='33800747c0c03639'>
      <parameter type-id='type-id-5' name='fd' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-25' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='nbytes' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-497' name='offset' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/pread_chk.c' line='23' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='printf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='___printf_chk' mangled-name='__printf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/printf_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__printf_chk@@GLIBC_2.3.4' hash='e4623ae51caf7651'>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/printf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-1' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/printf_chk.c' line='24' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='read_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__read_chk' mangled-name='__GI___read_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/read_chk.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__read_chk@@GLIBC_2.4' hash='ef2f14629b18a16c'>
      <parameter type-id='type-id-5' name='fd' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/read_chk.c' line='21' column='1'/>
      <parameter type-id='type-id-25' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/read_chk.c' line='21' column='1'/>
      <parameter type-id='type-id-9' name='nbytes' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/read_chk.c' line='21' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/read_chk.c' line='21' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='readlink_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__readlink_chk' mangled-name='__readlink_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/readlink_chk.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__readlink_chk@@GLIBC_2.4' hash='6101ac988f380b29'>
      <parameter type-id='type-id-498' name='path' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/readlink_chk.c' line='27' column='1'/>
      <parameter type-id='type-id-499' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/readlink_chk.c' line='27' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/readlink_chk.c' line='27' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/readlink_chk.c' line='28' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='readlinkat_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__readlinkat_chk' mangled-name='__readlinkat_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/readlinkat_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__readlinkat_chk@@GLIBC_2.5' hash='8cc61750e82bc2d9'>
      <parameter type-id='type-id-5' name='fd' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/readlinkat_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-498' name='path' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/readlinkat_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-499' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/readlinkat_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-9' name='len' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/readlinkat_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/readlinkat_chk.c' line='25' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='readonly-area.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <enum-decl name='readonly_error_type' size-in-bits='32' alignment-in-bits='32' filepath='../include/stdlib.h' line='371' column='1' hash='746ab8ff12802cbd' id='type-id-500'>
      <underlying-type type-id='type-id-97'/>
      <enumerator name='readonly_noerror' value='0'/>
      <enumerator name='readonly_area_writable' value='1'/>
      <enumerator name='readonly_procfs_inaccessible' value='2'/>
      <enumerator name='readonly_procfs_open_fail' value='3'/>
    </enum-decl>
  </abi-instr>
  <abi-instr address-size='64' path='realpath_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__realpath_chk' mangled-name='__realpath_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/realpath_chk.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__realpath_chk@@GLIBC_2.4' hash='f3e335582f0b70f6'>
      <parameter type-id='type-id-1' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/realpath_chk.c' line='26' column='1'/>
      <parameter type-id='type-id-11' name='resolved' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/realpath_chk.c' line='26' column='1'/>
      <parameter type-id='type-id-9' name='resolvedlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/realpath_chk.c' line='26' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='recv_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__recv_chk' mangled-name='__recv_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recv_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__recv_chk@@GLIBC_2.4' hash='3803a2580d0eeba1'>
      <parameter type-id='type-id-5' name='fd' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recv_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-25' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recv_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recv_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recv_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-5' name='flags' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recv_chk.c' line='23' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='recvfrom_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <qualified-type-def type-id='type-id-501' restrict='yes' hash='a826ca4896eac1a9' id='type-id-502'/>
    <function-decl name='__recvfrom_chk' mangled-name='__recvfrom_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recvfrom_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__recvfrom_chk@@GLIBC_2.4' hash='c4565c074dc2db54'>
      <parameter type-id='type-id-5' name='fd' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recvfrom_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-25' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recvfrom_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recvfrom_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recvfrom_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-5' name='flags' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recvfrom_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-503' name='addr' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recvfrom_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-501' name='addr_len' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/recvfrom_chk.c' line='24' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='snprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='___snprintf_chk' mangled-name='__snprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/snprintf_chk.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__snprintf_chk@@GLIBC_2.3.4' hash='d784ac1763ae0fb2'>
      <parameter type-id='type-id-11' name='s' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/snprintf_chk.c' line='25' column='1'/>
      <parameter type-id='type-id-9' name='maxlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/snprintf_chk.c' line='25' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/snprintf_chk.c' line='25' column='1'/>
      <parameter type-id='type-id-9' name='slen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/snprintf_chk.c' line='25' column='1'/>
      <parameter type-id='type-id-1' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/snprintf_chk.c' line='26' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='sprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='___sprintf_chk' mangled-name='__sprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/sprintf_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sprintf_chk@@GLIBC_2.3.4' hash='c61e4e4c51233aba'>
      <parameter type-id='type-id-11' name='s' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/sprintf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/sprintf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-9' name='slen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/sprintf_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-1' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/sprintf_chk.c' line='24' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='stack_chk_fail.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stack_chk_fail.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__stack_chk_fail@@GLIBC_2.4' hash='7f32ffea222edbe7'>
      <return type-id='type-id-7'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='stpcpy_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__stpcpy_chk' mangled-name='__GI___stpcpy_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpcpy_chk.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__stpcpy_chk@@GLIBC_2.3.4' hash='2da84c559242300d'>
      <parameter type-id='type-id-11' name='dest' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpcpy_chk.c' line='27' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpcpy_chk.c' line='27' column='1'/>
      <parameter type-id='type-id-9' name='destlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpcpy_chk.c' line='27' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='stpncpy_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__stpncpy_chk' mangled-name='__stpncpy_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__stpncpy_chk@@GLIBC_2.4' hash='bc5b721dd443c00e'>
      <parameter type-id='type-id-11' name='dest' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <parameter type-id='type-id-9' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <parameter type-id='type-id-9' name='destlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='strcat_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__strcat_chk' mangled-name='__strcat_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strcat_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__strcat_chk@@GLIBC_2.3.4' hash='2da84c559242300d'>
      <parameter type-id='type-id-11' name='dest' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpcpy_chk.c' line='27' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpcpy_chk.c' line='27' column='1'/>
      <parameter type-id='type-id-9' name='destlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpcpy_chk.c' line='27' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='strcpy_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__strcpy_chk' mangled-name='__GI___strcpy_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strcpy_chk.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__strcpy_chk@@GLIBC_2.3.4' hash='2da84c559242300d'>
      <parameter type-id='type-id-11' name='dest' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpcpy_chk.c' line='27' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpcpy_chk.c' line='27' column='1'/>
      <parameter type-id='type-id-9' name='destlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpcpy_chk.c' line='27' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='strlcat_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__strlcat_chk' mangled-name='__strlcat_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strlcat_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__strlcat_chk@@GLIBC_2.38' hash='3de56420be9a3b23'>
      <parameter type-id='type-id-499' name='s1' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strlcat_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-498' name='s2' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strlcat_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-9' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strlcat_chk.c' line='25' column='1'/>
      <parameter type-id='type-id-9' name='s1len' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strlcat_chk.c' line='25' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='strlcpy_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__strlcpy_chk' mangled-name='__strlcpy_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strlcpy_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__strlcpy_chk@@GLIBC_2.38' hash='3de56420be9a3b23'>
      <parameter type-id='type-id-499' name='s1' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strlcat_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-498' name='s2' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strlcat_chk.c' line='24' column='1'/>
      <parameter type-id='type-id-9' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strlcat_chk.c' line='25' column='1'/>
      <parameter type-id='type-id-9' name='s1len' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strlcat_chk.c' line='25' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='strncat_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__strncat_chk' mangled-name='__strncat_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strncat_chk.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__strncat_chk@@GLIBC_2.3.4' hash='bc5b721dd443c00e'>
      <parameter type-id='type-id-11' name='dest' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <parameter type-id='type-id-9' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <parameter type-id='type-id-9' name='destlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='strncpy_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__strncpy_chk' mangled-name='__GI___strncpy_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/strncpy_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__strncpy_chk@@GLIBC_2.3.4' hash='bc5b721dd443c00e'>
      <parameter type-id='type-id-11' name='dest' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <parameter type-id='type-id-9' name='n' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <parameter type-id='type-id-9' name='destlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/stpncpy_chk.c' line='26' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='swprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__swprintf_chk' mangled-name='__swprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/swprintf_chk.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__swprintf_chk@@GLIBC_2.4' hash='fe984aa1c4dcfcc3'>
      <parameter type-id='type-id-481' name='s' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/swprintf_chk.c' line='25' column='1'/>
      <parameter type-id='type-id-9' name='maxlen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/swprintf_chk.c' line='25' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/swprintf_chk.c' line='25' column='1'/>
      <parameter type-id='type-id-9' name='slen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/swprintf_chk.c' line='25' column='1'/>
      <parameter type-id='type-id-484' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/swprintf_chk.c' line='26' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ttyname_r_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__ttyname_r_chk' mangled-name='__ttyname_r_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/ttyname_r_chk.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ttyname_r_chk@@GLIBC_2.4' hash='a44f03c8e161f019'>
      <parameter type-id='type-id-5' name='fd' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/ttyname_r_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-11' name='buf' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/ttyname_r_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-9' name='buflen' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/ttyname_r_chk.c' line='22' column='1'/>
      <parameter type-id='type-id-9' name='nreal' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/ttyname_r_chk.c' line='22' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vasprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__vasprintf_chk' mangled-name='__vasprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vasprintf_chk.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__vasprintf_chk@@GLIBC_2.8' hash='6f6355cc5ee26d1a'>
      <parameter type-id='type-id-23' name='result_ptr' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vasprintf_chk.c' line='30' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vasprintf_chk.c' line='30' column='1'/>
      <parameter type-id='type-id-1' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vasprintf_chk.c' line='30' column='1'/>
      <parameter type-id='type-id-504' name='ap' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vasprintf_chk.c' line='30' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vdprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__vdprintf_chk' mangled-name='__vdprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vdprintf_chk.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__vdprintf_chk@@GLIBC_2.8' hash='771d3fdb1cc440bb'>
      <parameter type-id='type-id-5' name='d' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vdprintf_chk.c' line='30' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vdprintf_chk.c' line='30' column='1'/>
      <parameter type-id='type-id-1' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vdprintf_chk.c' line='30' column='1'/>
      <parameter type-id='type-id-504' name='ap' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vdprintf_chk.c' line='30' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vfprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='___vfprintf_chk' mangled-name='__vfprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vfprintf_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__vfprintf_chk@@GLIBC_2.3.4' hash='5dbe80a2759f8176'>
      <parameter type-id='type-id-480' name='fp' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vfprintf_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vfprintf_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-1' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vfprintf_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-504' name='ap' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vfprintf_chk.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vfwprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__vfwprintf_chk' mangled-name='__vfwprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vfwprintf_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__vfwprintf_chk@@GLIBC_2.4' hash='24827f281dde6e30'>
      <parameter type-id='type-id-480' name='fp' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vfwprintf_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vfwprintf_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-484' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vfwprintf_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-504' name='ap' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vfwprintf_chk.c' line='23' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vobprintf_chk.c' comp-dir-path='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug' language='LANG_C11'>
    <function-decl name='__obstack_vprintf_chk' mangled-name='__obstack_vprintf_chk' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vobprintf_chk.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__obstack_vprintf_chk@@GLIBC_2.8' hash='c489a7a08d30b509'>
      <parameter type-id='type-id-495' name='obstack' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vobprintf_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-5' name='flag' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vobprintf_chk.c' line='23' column='1'/>
      <parameter type-id='type-id-1' name='format' filepath='/usr/src/debug/glibc-2.42-9.fc43.x86_64/debug/vobprintf_chk.c' line='23' column='1'/>
